{
  "_note": "Keys are achievement IDs from achievements.json. Values are in-game description text.",
  "byId": {
    "1": "Cook a rocktail on a range in the Falador area.",
    "2": "Complete this quest.",
    "3": "Complete a city quest from an inhabitant of Menaphos.",
    "4": "Complete 10 city quests from an inhabitant of Menaphos. (X/10)",
    "5": "Complete 50 city quests from an inhabitant of Menaphos. (X/50)",
    "6": "Complete 100 city quests from an inhabitant of Menaphos. (X/100)",
    "7": "Complete 200 city quests from an inhabitant of Menaphos. (X/200)",
    "8": "Reach level 92 in the Prayer skill.",
    "9": "Obtained a collection of unique drops from Slayer monsters from and around Daemonheim.",
    "10": "Unfurl a flag in the Max Guild garden or jump for joy if you have already unfurled them all.",
    "11": "Complete Three's Company with 100%.",
    "12": "Harvest spines from a cactus you grew yourself in Al Kharid.",
    "13": "Purchase a God staff from the Chamber guardian in the Mage Arena.",
    "14": "Play as the following familiars in Familiarisation.",
    "15": "Work with Ramarno (in Camdozaal) to obtain a hatchet of bloom and blight. (X/9)",
    "16": "Smith a mithril platebody on the anvil in the jailhouse sewers.",
    "17": "Smith and fletch 10 rune bolts at once within Varrock.",
    "18": "Cross the River Lum using a crossbow.",
    "19": "Discover the pieces of a famous quote from Stephen Hawking. (X/4)",
    "20": "Find and read the scruffy note in the Scabarite Cavern.",
    "21": "Talk to a civilian in West Ardougne about selling a cat.",
    "22": "Unlock the ability to change your spellbook using War's Grimoire at War's Retreat.",
    "23": "Charge or combine a spirit gem.",
    "24": "Obtained a collection of unique drops from the Gate of Elidinis.",
    "25": "Cleanse the Corrupted Seren Stone with at least one crystal.",
    "26": "Complete this quest.",
    "27": "Complete the 'A Cultist's Journey' tasks from the Curator.",
    "28": "Unlock all upgrades from Sydekix's Shop.",
    "29": "Bring a mound of bacon, bread and a chocolate bar to Seren.",
    "30": "Complete this quest.",
    "31": "Complete this quest.",
    "32": "Complete this quest.",
    "33": "Use the Summoning obelisk near Rellekka's gate.",
    "34": "Burn each of the listed logs.",
    "35": "Use a crater to convert a memory of tier 2 or higher to energy.",
    "36": "Sample all of the listed baked potatoes. (X/7)",
    "37": "Upgrade all buildings in Fort Forinthry to Tier 3.",
    "38": "Spin some fungal bowstring at the spinning wheel in the City of Um.",
    "39": "Speak to Mekhat within the Sanctum of Rebirth.",
    "40": "Use the Summoning obelisk to the east of the Fight Arena.",
    "41": "Work with Wilfred (near Falador lodestone) to obtain a hatchet of ember and glade.",
    "42": "Make a Necromancy potion while in the City of Um.",
    "43": "Look through Father Aereck's selection of gravestones.",
    "44": "After Extinction quest, ask Prehistoric Potterington at the Anachronia dinosaur farm about zygomites.",
    "45": "Shatter a crystal geode. (X/1)",
    "46": "Shatter 5 crystal geodes. (X/5)",
    "47": "Shatter 10 crystal geodes. (X/10)",
    "48": "Shatter 25 crystal geodes. (X/25)",
    "49": "Ascend the Dark Wizards' Tower while wearing full proselyte armour.",
    "50": "Select a colour for a new kitten.",
    "51": "Work with Ramarno (in Camdozaal) to obtain a pickaxe of life and death. (X/9)",
    "52": "Wear a full diving outfit to go diving in Everlight.",
    "53": "Cook a lobster on the range in Lumbridge Castle's kitchen.",
    "54": "Loot the trunk in the Temple of Aminishi.",
    "55": "Attempt to steal a nature rune from a chest in a house to the east of Ardougne market.",
    "56": "Solve this mystery.",
    "57": "Reunite Irwinsson with his lost compass.",
    "58": "After upgrading the grove at Fort Forinthry to Tier 3, return to Oak to learn about his new discovery.",
    "59": "Solve this mystery.",
    "60": "Solve this mystery.",
    "61": "Collect 5 palm leaves.",
    "62": "Get mahogany from your Etceterian subjects.",
    "63": "Create an anchovy pizza from scratch in the Bandit Camp and give it to Fat Tony. (X/5)",
    "64": "Mount all three of the Raptor's slayer trophies.",
    "65": "Talk to Selene to learn a Necromancy prayer.",
    "66": "Build a prayer altar in the starting room and fill up your prayer points from it.",
    "67": "Throw an Explosive Scarab Akh at Amascut, the Devourer.",
    "68": "Defeat Astellarn while at least two pulsars are still active.",
    "69": "Upgrade Zorgoth's ring by completing rituals at the Ungael ritual site.",
    "70": "Pass the guards guarding the Wilderness entrance.",
    "71": "Pray at the Seers' Village altar.",
    "72": "Complete this quest.",
    "73": "Defeat the Arch-Glacor. (X/5)",
    "74": "Defeat the Arch-Glacor. (X/10)",
    "75": "Defeat the Arch-Glacor. (X/25)",
    "76": "Defeat the Arch-Glacor. (X/50)",
    "77": "Defeat the Arch-Glacor. (X/75)",
    "78": "Defeat the Arch-Glacor. (X/100)",
    "79": "Work with the blast furnace foreman (in Keldagrim) to obtain a pickaxe of earth and song.",
    "80": "Defeat the Arch-Glacor at 50% enrage. (X/50)",
    "81": "Defeat the Arch-Glacor at 100% enrage. (X/100)",
    "82": "Defeat the Arch-Glacor at 250% enrage. (X/250)",
    "83": "Defeat the Arch-Glacor at 500% enrage. (X/500)",
    "84": "Defeat the Arch-Glacor at 750% enrage. (X/750)",
    "85": "Defeat the Arch-Glacor at 1,000% enrage. (X/1000)",
    "86": "Defeat the Arch-Glacor at 2,000% enrage.",
    "87": "Activate the Sorrow prayer over the River Noumenon.",
    "88": "Complete this quest.",
    "89": "Cast the String Jewellery spell while standing at the furnace in Falador.",
    "90": "Solve this mystery.",
    "91": "Collect 250 or more tears from a single entry in Tears of Guthix.",
    "92": "Complete this quest.",
    "93": "Pick a papaya or coconut from the fruit tree patch near Tree Gnome Village.",
    "94": "Steal from each of the listed types of merchant stalls.",
    "95": "Craft 100 earth runes simultaneously without aid from an explorer's ring, pouches or familiars.",
    "96": "Find the amazing viewpoint overlooking the City of Um that will give you hours of enjoyment.",
    "97": "Enter the unicorn pen in Ardougne Zoo using the fairy rings.",
    "98": "Complete this quest.",
    "99": "Talk to the wizard Avalani within a clan citadel.",
    "100": "Win a Pest Control game after repairing all barricades to full.",
    "101": "Play the Holy Cithara while standing in the Citharede Abbey.",
    "102": "Find every ancient aviansie spirit at Stormguard.",
    "103": "Upgrade your plank box to hold 100 of each plank.",
    "104": "Unlock the asylum gate and complete the shortcut to the abyssal portal.",
    "105": "Have an abyssal titan familiar hold essence for you while runecrafting at Ourania Altar.",
    "106": "Complete a Daemonheim dungeon while you have one of the gorajo cards active.",
    "107": "Defeat Araxxor and Araxxi while at most 10% of the total acid remains in the pool after taking the Acid path during phase 2.",
    "108": "View the stock in Razmire Builders' Merchants shop.",
    "109": "Upgrade a piece of Death Skull or Deathwarden equipment to tier 50.",
    "110": "Fully enchant your broomstick after the 'Swept Away' quest.",
    "111": "Claim ancient bones from Father Aereck after 'The Restless Ghost'.",
    "112": "Defeat Barrows: Rise of the Six without anyone being hit by Verac's 'Deathcopter' attack.",
    "113": "Unlock the Closure's robes cosmetic override outfit after 'Once Upon a Time in Gielinor'.",
    "114": "Find and read Elidinis' memoir.",
    "115": "Complete this quest.",
    "116": "Find and read the Aged Journal in Daemonheim.",
    "117": "Unlock the agile top and leg rewards from advanced Agility courses.",
    "118": "Unlock the Agility pet.",
    "119": "Reach level 5 in the Agility skill.",
    "120": "Reach level 10 in the Agility skill.",
    "121": "Reach level 20 in the Agility skill.",
    "122": "Reach level 30 in the Agility skill.",
    "123": "Reach level 40 in the Agility skill.",
    "124": "Reach level 50 in the Agility skill.",
    "125": "Reach level 60 in the Agility skill.",
    "126": "Reach level 70 in the Agility skill.",
    "127": "Reach level 80 in the Agility skill.",
    "128": "Reach level 90 in the Agility skill.",
    "129": "Reach level 92 in the Agility skill.",
    "130": "Reach level 99 in the Agility skill.",
    "131": "Reach virtual level 110 in the Agility skill.",
    "132": "Reach virtual level 120 in the Agility skill.",
    "133": "Unlock the Ahrim bobblehead from Rise of the Six.",
    "134": "Defeat Amascut, the Devourer in enrage mode without anyone taking damage from Gorilla Akh and without reflecting damage from Modest Crocodiles.",
    "135": "Activate the lodestone in Al Kharid.",
    "136": "Cast High-level Alchemy on a magic shortbow in Seers' Village bank.",
    "137": "Kill a 'rum'-pumped crab in the 'Rum'geon on Braindeath Island.",
    "138": "Unlock all Rogue Trader merchandise.",
    "139": "Defeat Kree'arra after allowing him to push you from one wall to another with his wing knockback. Can only be completed in a solo instance.",
    "140": "Recover the Grand Library's collection of valuable and unique insects.",
    "141": "Complete this quest.",
    "142": "Fully upgrade the wicked hood.",
    "143": "Mine one of each of the listed ores. (X/12)",
    "144": "Defeat the Har-Aken without using any crystals within the fight.",
    "145": "Complete all Court Cases and claim a gavel and the 'the Detective' title from the courthouse clerk.",
    "146": "Sell a pyramid top to Simon.",
    "147": "Defeat all four images of Yakamaru within ten seconds of one another.",
    "148": "Defeat Amascut, the Devourer at 1000% or higher enrage while every player is hit by each 'Crushing Soul' attack.",
    "149": "Catch and cook a bass in Catherby.",
    "150": "Unlock the energy-gathering scrimshaw scroll from Waiko ports reward shop.",
    "151": "Unlock all the Prawn Perks from your Aquarium. (X/6)",
    "152": "Make a rune crossbow from scratch, performing each step within either Witchaven or Yanille.",
    "153": "Buy Zanik the Alms of Death.",
    "154": "Defeat Araxxi. (X/5)",
    "155": "Defeat Araxxi. (X/10)",
    "156": "Defeat Araxxi. (X/25)",
    "157": "Defeat Araxxi. (X/50)",
    "158": "Defeat Araxxi. (X/75)",
    "159": "Defeat Araxxi. (X/100)",
    "160": "Complete this quest.",
    "161": "Play a round of Great Orb Project on each different altar map.",
    "162": "Craft at least one of each type of rune, on their respective altars. (X/26)",
    "163": "Use the altar in the White Knights' Castle to switch curses off, while you have Turmoil active.",
    "164": "Have every alteration active at once.",
    "165": "Try to obtain an anti-dragonbreath shield from Duke Horacio.",
    "166": "Get a gift from the stray dog after he moves into Fort Forinthry.",
    "167": "Place souls in every spot in your slayer dungeon inside the sunken pyramid.",
    "168": "Defeat Amascut, the Devourer. (X/1)",
    "169": "Defeat Amascut, the Devourer at 1000% or higher enrage in a team size of three or fewer.",
    "170": "Defeat Amascut, the Devourer at 500% or higher enrage in less than 10:00.",
    "171": "Defeat Amascut, the Devourer at 2000% or higher enrage in less than 07:51.",
    "172": "Defeat Amascut, the Devourer at 1000% or higher enrage in less than 07:51.",
    "173": "Defeat Amascut, the Devourer at 2000% enrage while completing the listed achievements.",
    "174": "Defeat Amascut, the Devourer at 2000% enrage while completing the listed achievements.",
    "175": "Unlock the Amaskitty pet from Amascut, the Devourer.",
    "176": "Defeat the Ambassador. (X/5)",
    "177": "Defeat the Ambassador. (X/10)",
    "178": "Defeat the Ambassador. (X/25)",
    "179": "Defeat the Ambassador. (X/50)",
    "180": "Defeat the Ambassador. (X/75)",
    "181": "Defeat the Ambassador. (X/100)",
    "182": "Defeat the Ambassador solo. (X/5)",
    "183": "Defeat the Ambassador solo. (X/10)",
    "184": "Defeat the Ambassador solo. (X/25)",
    "185": "Defeat the Ambassador solo. (X/50)",
    "186": "Defeat the Ambassador solo. (X/75)",
    "187": "Defeat the Ambassador solo. (X/100)",
    "188": "Unlock the Ambi pet from the Ambassador in the Shadow Reef.",
    "189": "Defeat every miniboss inside the Temple of Aminishi.",
    "190": "Buy a Farming amulet from Sarah on the farm north of Port Sarim.",
    "191": "Purchase a halberd from the Tyras Camp, then use it to kill an elf in the Elf Camp.",
    "192": "Create an expansive essence pouch. Start by buying a hungry hood from Wizard Rinsit's Runecrafting Shop.",
    "193": "Attempt to cut a log from the teak tree near the Ruins of Uzer.",
    "194": "Activate the lodestone in Anachronia.",
    "195": "Complete this quest.",
    "196": "Activate all tortle portals on The Islands That Once Were Turtles. (X/3)",
    "197": "Study an 'ancient gizmos' blueprint (tradeable or untradeable).",
    "198": "Study an 'ancient tools' blueprint (tradeable or untradeable).",
    "199": "Study an 'XP capacitor' blueprint (tradeable or untradeable).",
    "200": "Use green charms to create each of the listed summoning pouches.",
    "201": "Complete a complexity 6 floor solo in under 6 minutes.",
    "202": "Catch a pike in the river to the east of Lumbridge Castle.",
    "203": "Kill a ghostly troll with Necromancy in the cave entrance to Trollgrav.",
    "204": "Return the wedding ring after 'The Light Within'.",
    "205": "Have Durzag deal the killing blow to both Tuz and Krar.",
    "206": "Complete this quest.",
    "207": "Cure 100 animals of their ailments. (X/100)",
    "208": "Fully upgrade the cramulet. (X/4)",
    "209": "Wear the ankh and the Scabaras mask while in the desert.",
    "210": "Earn 'the Annihilator' title by fighting all four nihil at once.",
    "211": "Kill elite profane scabarites with the primed keris equipped to upgrade it after 'Beneath Scabaras' Sands'. (X/200)",
    "212": "Complete this quest.",
    "213": "Spin five bowstrings.",
    "214": "Defeat Telos, the Warden at 100% or higher enrage without being hit by an anima-golem.",
    "215": "Defeat the King Black Dragon without using dragonfire protection to mitigate his attacks",
    "216": "Cook 1 of each type of fish.",
    "217": "Claim Professor Oddenstein's extra rewards after 'Ernest the Chicken'.",
    "218": "Activate all portals within the citadel.",
    "219": "Unblock the hollow log and tunnel shortcut after 'Fairy Tale III'.",
    "220": "Escape Kharid-et by boat.",
    "221": "Cook a spider on a stick.",
    "222": "Enter through the gates of the Arandar Pass while wearing only a full set of Mourner gear.",
    "223": "Defeat Araxxi. (X/1)",
    "224": "Defeat Araxxi solo in less than 05:00.",
    "225": "Defeat Araxxi solo in less than 03:00.",
    "226": "Defeat Araxxi solo in less than 01:42.",
    "227": "Chop down a magic tree in the Varrock Sewers resource dungeon.",
    "228": "Complete the Arc journal.",
    "229": "Beat Seiryu without anyone taking damage from the shadow tendrils.",
    "230": "Have the Ranging Guild judge congratulate you for acquiring over 1,000 archery tickets.",
    "231": "Defeat the Arch-Glacor. (X/1)",
    "232": "Defeat the Arch-Glacor in hard mode at 500% or higher enrage in less than 05:00.",
    "233": "Defeat the Arch-Glacor in hard mode at 3000% or higher enrage in less than 05:30.",
    "234": "Defeat the Arch-Glacor in hard mode at 1000% or higher enrage in less than 02:30.",
    "235": "Defeat the Arch-Glacor solo with all mechanics enabled in less than 03:00.",
    "236": "Unlock the Archaeology pet.",
    "237": "Reach level 5 in the Archaeology skill.",
    "238": "Reach level 10 in the Archaeology skill.",
    "239": "Reach level 20 in the Archaeology skill.",
    "240": "Reach level 30 in the Archaeology skill.",
    "241": "Reach level 40 in the Archaeology skill.",
    "242": "Reach level 50 in the Archaeology skill.",
    "243": "Reach level 60 in the Archaeology skill.",
    "244": "Reach level 70 in the Archaeology skill.",
    "245": "Reach level 80 in the Archaeology skill.",
    "246": "Reach level 90 in the Archaeology skill.",
    "247": "Reach level 92 in the Archaeology skill.",
    "248": "Reach level 99 in the Archaeology skill.",
    "249": "Reach level 110 in the Archaeology skill.",
    "250": "Reach level 113 in the Archaeology skill.",
    "251": "Reach level 120 in the Archaeology skill.",
    "252": "Activate the lodestone in Ardougne.",
    "253": "Cast the Ardougne Teleport spell.",
    "254": "Given by Doctor Orbon in Ardougne Church for completing all Easy Tasks in Ardougne.",
    "255": "Given by Aleck in Yanille for completing all Elite Tasks in Ardougne.",
    "256": "Given by Aleck in Yanille for completing all Hard Tasks in Ardougne.",
    "257": "Given by the town crier in East Ardougne's market for completing all Medium Tasks in Ardougne.",
    "258": "Burn a yew log on the east gatehouse of Lumbridge Castle.",
    "259": "Talk to the chief servant at the servants' guild to find out about servants for your house.",
    "260": "Kill a swordchick in the Tower of Life.",
    "261": "Defeat General Graardor in hard mode, solo, without being hit by damage reflected by his 'Graardor Protect' attack.",
    "262": "Gain access to the secret treasure room from 'Do No Evil'.",
    "263": "Obtained a collection of unique drops from TzKal-Zuk's challenge.",
    "264": "Add all valid keys to the steel key ring after 'One Small Favour'.",
    "265": "Defeat Zamorak, Lord of Chaos solo at 50% enrage.",
    "266": "Defeat Zamorak at 100% enrage in a solo encounter.",
    "267": "Defeat Zamorak at 250% enrage in a solo encounter.",
    "268": "Defeat Zamorak at 500% enrage in a solo encounter.",
    "269": "Defeat Zamorak at 750% enrage in a solo encounter.",
    "270": "Defeat Zamorak at 1,000% enrage in a solo encounter.",
    "271": "Defeat Zamorak, Lord of Chaos solo at 2,000% enrage.",
    "272": "Defeat the phoenix once, after 'In Pyre Need'.",
    "273": "Restored a collection of Armadylean artefacts.",
    "274": "Defeat each of the original Barrows Brothers, without leaving the area.",
    "275": "Unlock all hot-air balloon travel routes. (X/6)",
    "276": "Travel to Castle Wars by hot-air balloon.",
    "277": "Contribute all items to the collection.",
    "278": "Contribute all items to the collection.",
    "279": "Contribute all items to the collection.",
    "280": "Unlock the Artemis pet from completing Treasure Trails.",
    "281": "Use a catapult in Castle Wars after gaining the knowledge from the Catapult Construction quest.",
    "282": "Create a clay ring using the Draynor village pottery oven.",
    "283": "Complete this quest.",
    "284": "Unlock the Temple of Light teleport after 'Within the Light'.",
    "285": "Farm and mix the ingredients for a prayer renewal potion entirely in Morytania.",
    "286": "Gain access to the Contraband Yak Produce shop.",
    "287": "Craft blood runes at the Blood Altar.",
    "288": "Activate the lodestone in Ashdale.",
    "289": "Eagle-dive into a hay cart after completing Diamond in the Rough.",
    "290": "View the rewards in the Barbarian Assault tutorial.",
    "291": "Defeat Astellarn the First Celestial. (X/1)",
    "292": "Defeat Astellarn solo in less than 01:30.",
    "293": "Defeat Astellarn solo in less than 01:00.",
    "294": "Harvest a starbloom on Zolarea.",
    "295": "Craft at least 56 astral runes simultaneously, without using pouches or familiars.",
    "296": "Open all chests and crack all safes in the Asuran Arsenal Heist before searching the rare chest.",
    "297": "Search the rare chest in the Asuran Arsenal Heist in 6 minutes or less.",
    "298": "Search the rare chest in the Asuran Arsenal Heist without being caught by The Keeper or hit by traps.",
    "299": "Teleport to the Ranging Guild.",
    "300": "Get a pet fish from Harry.",
    "301": "Craft 56 nature runes simultaneously, without using pouches or familiars.",
    "302": "Craft some nature runes.",
    "303": "Solve this mystery.",
    "304": "Unlock the Attack pet.",
    "305": "Reach level 5 in the Attack skill.",
    "306": "Reach level 10 in the Attack skill.",
    "307": "Reach level 20 in the Attack skill.",
    "308": "Reach level 30 in the Attack skill.",
    "309": "Reach level 40 in the Attack skill.",
    "310": "Reach level 50 in the Attack skill.",
    "311": "Reach level 60 in the Attack skill.",
    "312": "Reach level 70 in the Attack skill.",
    "313": "Reach level 80 in the Attack skill.",
    "314": "Reach level 90 in the Attack skill.",
    "315": "Reach level 92 in the Attack skill.",
    "316": "Reach level 99 in the Attack skill.",
    "317": "Reach virtual level 110 in the Attack skill.",
    "318": "Reach virtual level 120 in the Attack skill.",
    "319": "Defeat Kerapac in hard mode. (X/5)",
    "320": "Defeat Kerapac in hard mode. (X/10)",
    "321": "Defeat Kerapac in hard mode. (X/25)",
    "322": "Defeat Kerapac in hard mode. (X/50)",
    "323": "Defeat Kerapac in hard mode. (X/75)",
    "324": "Defeat Kerapac in hard mode. (X/100)",
    "325": "Unlock the mentioned auras from War's store.",
    "326": "Unlock the Ava pet from the Twin Furies in the Heart of Gielinor.",
    "327": "Defeat the Twin Furies solo without being hit by Avaryss' 'Surge' attack.",
    "328": "Travel to Ardougne via the port near Brimhaven.",
    "329": "Travel to the fairy ring near the Kalphite Lair.",
    "330": "Use Balmung to kill a dagannoth.",
    "331": "Speak to Azacorax after 'Rune Memories' and gain Magic or Prayer XP.",
    "332": "Complete the Azdaran document.",
    "333": "Complete this quest.",
    "334": "Play and retune each of the harps in the Ithell Harmonium.",
    "335": "Make an overload potion within The Last Call in the City of Um.",
    "336": "Unlock the Baby Osseous pet from Osseous.",
    "337": "Discover the hidden wall in the dungeon below the volcano.",
    "338": "Throw some money into the oasis.",
    "339": "Complete this quest.",
    "340": "Complete this quest.",
    "341": "Defeat Vermyx, Brood Mother without being hit by her 'Wyrmfire' attack.",
    "342": "Successfully breed an EVIL chicken.",
    "343": "Find and cast the Low alchemy spell on a piece of polished TokKul in TzKal-Zuk's arena.",
    "344": "Purchase the herb bag and the herb bag upgrade from the Herby Werby reward shop.",
    "345": "Unlock the Bagra pet from Orikalka.",
    "346": "Be the first player to find a crashed star.",
    "347": "Enchant each of the listed crossbow bolts.",
    "348": "Solve a lockbox puzzle.",
    "349": "Activate the lodestone in the Bandit Camp.",
    "350": "Recover all 14 of Bandos's memories on Yu'biusk.",
    "351": "Restored a collection of Bandosian artefacts.",
    "352": "Unlock the spell: Tune Banite Ore.",
    "353": "Mine banite ore using a bane pickaxe +4 while wearing a full set of bane armour +4 and listening to the music track 'Bane of Summer'.",
    "354": "Help Tiny Zemouregal to deface the three paintings of his master in the palace's heart vault.",
    "355": "Find all hidden treasure from the 'Making History' quest. (X/11)",
    "356": "Summon an ibis in Port Sarim's fishing store.",
    "357": "Complete this miniquest.",
    "358": "Complete barbarian firemaking training with Otto, at his grotto west of Baxtorian Falls.",
    "359": "Complete barbarian fishing training with Otto, at his grotto west of Baxtorian Falls.",
    "360": "Complete barbarian herblore training with Otto, at his grotto west of Baxtorian Falls.",
    "361": "Complete barbarian smithing training with Otto, at his grotto west of Baxtorian Falls.",
    "362": "View the Hunter equipment in Aleck's shop in Yanille.",
    "363": "Obtain some bark from hollow trees.",
    "364": "Defeat a Dagannoth King solo whilst wearing full yak-hide armour and a Fremennik round shield.",
    "365": "Adopt a baby yak.",
    "366": "Defeat the empowered Barrows Brothers. (X/5)",
    "367": "Defeat the empowered Barrows Brothers. (X/10)",
    "368": "Defeat the empowered Barrows Brothers. (X/25)",
    "369": "Defeat the empowered Barrows Brothers. (X/50)",
    "370": "Defeat the empowered Barrows Brothers. (X/75)",
    "371": "Defeat the empowered Barrows Brothers. (X/100)",
    "372": "Obtained a collection of unique drops from the Barrows Brothers.",
    "373": "Defeat Barrows: Rise of the Six while completing the listed achievements.",
    "374": "Defeat Barrows: Rise of the Six solo.",
    "375": "Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 01:00.",
    "376": "Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 00:18.",
    "377": "Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 00:06.",
    "378": "Unlock the Barry pet from Araxxi.",
    "379": "Upgrade a piece of Death Skull or Deathwarden equipment to tier 20.",
    "380": "Complete this quest.",
    "381": "Craft an air battlestaff.",
    "382": "Complete this quest.",
    "383": "Collect 5 seaweed from anywhere on Karamja.",
    "384": "Earn a total amount of 1,000 beans. (X/1,000)",
    "385": "Earn a total amount of 10,000 beans. (X/10,000)",
    "386": "Earn a total amount of 100,000 beans. (X/100,000)",
    "387": "Earn a total amount of 1,000,000 beans. (X/1,000,000)",
    "388": "Purchase the following upgrades from the farmers' market reward shop.",
    "389": "Purchase the following upgrades from the Anachronia farmers' market reward shop.",
    "390": "Defeat Beastmaster Durzag. (X/1)",
    "391": "Defeat Beastmaster Durzag in a team of 2 or fewer.",
    "392": "Defeat Beastmaster Durzag solo.",
    "393": "Defeat Beastmaster Durzag in less than 01:45.",
    "394": "Defeat Beastmaster Durzag in less than 00:27.",
    "395": "Defeat Beastmaster Durzag in less than 00:45.",
    "396": "Use a meat tenderiser on a super cow.",
    "397": "Defeat an Iorwerth warrior while under the influence of the Iorwerth prayer altar.",
    "398": "Obtained a collection of unique drops from Zamorak, Lord of Chaos.",
    "399": "Defeat the Kalphite King in a team of 4 or fewer without anyone dying to a 'Beetlejuice' attack.",
    "400": "Defeat TzKal-Zuk in hard mode in a single run without letting TzekHaar-Aken submerge in wave 17.",
    "401": "Feed a survivor in the Temple Trekking scenario using only great gunkan or great maki to progress.",
    "402": "Gather a total of 1,000 resources from Archaeology, Fishing, Mining or Woodcutting. (X/1,000)",
    "403": "Find all Behemoth notes.",
    "404": "Smelt a steel bar in the furnace in Lumbridge.",
    "405": "Complete this quest.",
    "406": "Complete this quest.",
    "407": "Find all locations in Benedict's World Tour and receive the XP lamp.",
    "408": "Find the first 9 items in Benedict's World Tour and receive the XP lamp.",
    "409": "Discover all the Arc berries.",
    "410": "Defeat the Kalphite King after triggering his Immortality and then defeat him again.",
    "411": "Defeat Astellarn the First Celestial. (X/5)",
    "412": "Defeat Astellarn the First Celestial. (X/10)",
    "413": "Defeat Astellarn the First Celestial. (X/25)",
    "414": "Defeat Astellarn the First Celestial. (X/50)",
    "415": "Defeat Astellarn the First Celestial. (X/75)",
    "416": "Defeat Astellarn the First Celestial. (X/100)",
    "417": "Defeat Astellarn the First Celestial solo. (X/5)",
    "418": "Defeat Astellarn the First Celestial solo. (X/10)",
    "419": "Defeat Astellarn the First Celestial solo. (X/25)",
    "420": "Defeat Astellarn the First Celestial solo. (X/50)",
    "421": "Defeat Astellarn the First Celestial solo. (X/75)",
    "422": "Defeat Astellarn the First Celestial solo. (X/100)",
    "423": "Defeat Yakamaru with all but one member of the raid still poisoned.",
    "424": "Burn a Haunted Wood torch while wearing the Ring of fire.",
    "425": "Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Smash' attack.",
    "426": "Complete this quest.",
    "427": "Visit Draynor Village market.",
    "428": "Use the fairy ring in McGrubor's Wood.",
    "429": "Score 1,111 in a session of the Big Chinchompa minigame.",
    "430": "Complete this quest.",
    "431": "Successfully hunt a sabre-toothed kyatt.",
    "432": "After Extinction quest, 'eggs'plore Prehistoric Potterington's (sunny)-side-(up) hustle.",
    "433": "Complete this quest.",
    "434": "Construct a Tuska mask (mask parts are dropped by airut during their Slayer task).",
    "435": "Defeat Kree'arra. (X/5)",
    "436": "Defeat Kree'arra. (X/10)",
    "437": "Defeat Kree'arra. (X/25)",
    "438": "Defeat Kree'arra. (X/50)",
    "439": "Defeat Kree'arra. (X/75)",
    "440": "Defeat Kree'arra. (X/100)",
    "441": "Track all of the owls for Deryn.",
    "442": "Discover all the Arc birds.",
    "443": "Defeat Kree'arra in hard mode. (X/5)",
    "444": "Defeat Kree'arra in hard mode. (X/10)",
    "445": "Defeat Kree'arra in hard mode. (X/25)",
    "446": "Defeat Kree'arra in hard mode. (X/50)",
    "447": "Defeat Kree'arra in hard mode. (X/75)",
    "448": "Defeat Kree'arra in hard mode. (X/100)",
    "449": "Obtained a collection of unique drops from the Sanctum of Rebirth.",
    "450": "Complete this quest.",
    "451": "Unlock the Bisdi pet from the black stone dragon in the Dragonkin Laboratory.",
    "452": "Defeat the Black Stone Dragon. (X/1)",
    "453": "Defeat the Black Stone Dragon solo in less than 05:30.",
    "454": "Defeat the Black Stone Dragon solo in less than 04:00.",
    "455": "Defeat the Black Stone Dragon solo in less than 01:45.",
    "456": "Defeat the Black Stone Dragon solo in less than 02:15.",
    "457": "Obtained a collection of unique drops from the Queen Black Dragon.",
    "458": "Defeat Gregorovic solo without being hit by his 'Glaives' attack.",
    "459": "Cast Fire Blast at one of the goblins or giant spiders in the Lumbridge area (including the Lumbridge catacombs and swamp).",
    "460": "Defeat Vorago with only one person ever being the target of the 'Destroy Tank' attack during the 'Vitalis Bomb' stage.",
    "461": "Have a clay ring blessed by Father Aereck in Lumbridge's church.",
    "462": "Make Seiryu sneeze.",
    "463": "Defeat Solak, Guardian of the Grove without anyone using the 'Nature's Blessing' action ability.",
    "464": "Defeat Solak, Guardian of the Grove after dealing with all eruptions within 6s of each other.",
    "465": "Claim Smithing XP from Ramarno after 'Defender of Varrock'.",
    "466": "Light a bullseye lantern in the chemist's.",
    "467": "Attempt to steal blood runes from the chest in the chaos druid tower's dungeon.",
    "468": "Complete this quest.",
    "469": "Obtain hidden runes from Meiyerditch laboratory and blood altar ruins. (X/2)",
    "470": "Using either a Silver Sickle or the Ivandis Flail, grow some fungus in the swamp using Bloom.",
    "471": "Drink a super invention potion.",
    "472": "Get Gwir in Lletya to remind you about your previous adventures in the elven lands.",
    "473": "Talk to a boater while wearing a boater.",
    "474": "Defeat Nex, Angel of Death in a team of 7 or fewer after placing each 'Mark of the Elements' in the center of the arena.",
    "475": "Unlock the Bombi pet from Vorago.",
    "476": "Defeat Verak Lith without being hit by their 'Black Dragon Dive Bomb' attack.",
    "477": "Defeat the Skeletal Horror whilst wielding Zanik's crossbow and using bone bolts.",
    "478": "Unlock the bonecrusher upgrade from Waiko reward shop.",
    "479": "Use the defensive ability Reflect while the Lesser Bone Shield incantation is active.",
    "480": "Have all deep sea boosts active at the same time.",
    "481": "Enter the Combat Training Camp north of West Ardougne.",
    "482": "Complete this miniquest.",
    "483": "Complete this miniquest.",
    "484": "Complete this miniquest.",
    "485": "Upgrade the Botanist's bench in Fort Forinthry to Tier 3.",
    "486": "Defeat the Twin Furies in hard mode, solo, without being hit by their 'Lava Bomb' attack.",
    "487": "Create a yew shieldbow from scratch in the elven lands. (X/5)",
    "488": "Box-trap a monkey on Karamja.",
    "489": "Wear a bracelet of clay while mining soft clay in the Ithell district of Prifddinas.",
    "490": "Recharge a combat bracelet or a skills necklace at the Legends' Guild.",
    "491": "Telegrab the pickled brain on a table in the Hair of the Dog.",
    "492": "Defeat Nex. (X/5)",
    "493": "Defeat Nex. (X/10)",
    "494": "Defeat Nex. (X/25)",
    "495": "Defeat Nex. (X/50)",
    "496": "Defeat Nex. (X/75)",
    "497": "Defeat Nex. (X/100)",
    "498": "Attempt to picklock a certain door east of the gem stall in Ardougne's marketplace.",
    "499": "Solve this mystery.",
    "500": "Fly across Stormguard harnessing something powerful.",
    "501": "Complete all the unabridged Fremennik Sagas.",
    "502": "Defeat the Twin Furies using fury blades. Can only be completed in a solo instance.",
    "503": "Kill a cave crawler in the Fremennik Slayer Dungeon.",
    "504": "Defeat Vorago without anyone being hit by any falling rocks during the 'Ceiling Collapse' stage.",
    "505": "Complete this quest.",
    "506": "Complete this quest.",
    "507": "Defeat Verak Lith without anyone dispersing their damage into a pile of eggs.",
    "508": "Defeat the first seven Barrows Brothers, including Akrisae.",
    "509": "Claim the rewards from all three Gower brothers after 'Gower Quest'.",
    "510": "Defeat each of the Barrows Brothers, dealing the killing blow with their own weapon.",
    "511": "Defeat Rise of the Six on six different occasions, leaving a different brother to last.",
    "512": "Open Uglug's Stuffsies store by selling him Relicym's balm.",
    "513": "Defeat the Kalphite Queen. (X/5)",
    "514": "Defeat the Kalphite Queen. (X/10)",
    "515": "Defeat the Kalphite Queen. (X/25)",
    "516": "Defeat the Kalphite Queen. (X/50)",
    "517": "Defeat the Kalphite Queen. (X/75)",
    "518": "Defeat the Kalphite Queen. (X/100)",
    "519": "Defeat the Kalphite King. (X/5)",
    "520": "Defeat the Kalphite King. (X/10)",
    "521": "Defeat the Kalphite King. (X/25)",
    "522": "Defeat the Kalphite King. (X/50)",
    "523": "Defeat the Kalphite King. (X/75)",
    "524": "Defeat the Kalphite King. (X/100)",
    "525": "Find and read the High Priest of Scabaras' notes.",
    "526": "Build all of the Treasure Trail hidey-holes. You can find a complete list of hidey-holes at the noticeboard by Zaida.",
    "527": "Create an amulet of strength, performing each step in Lumbridge. (X/7)",
    "528": "Get a bullseye in the Last Call.",
    "529": "Fill five pots with flour from the Sinclair Mansion.",
    "530": "Defeat the Twin Furies solo without dealing damage during their channelled bomb attack.",
    "531": "Pick poison ivy from your bush farming patch in Varrock.",
    "532": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Burrow' attacks.",
    "533": "Activate the lodestone in Burthorpe.",
    "534": "Manually bury or scatter each of the listed bones and ashes.",
    "535": "Unlock a boon.",
    "536": "Claim Thieving XP after 'Buyers and Cellars'.",
    "537": "Complete this quest.",
    "538": "Buy an ancient staff after 'Desert Treasure'.",
    "539": "Claim buckets of sand from Bert in Yanille.",
    "540": "Offer up three sets of bones to a sacrificial altar.",
    "541": "Complete this quest.",
    "542": "Unlock a level 40+ chest.",
    "543": "Swap to the Ancient spellbook at the Cadarn grimoire, then defeat a Cadarn elf whilst using the Ancient spellbook.",
    "544": "Defeat Kezalam, the Wanderer without being hit by her 'Soul Bomb' attack.",
    "545": "Defeat Vorago without anyone activating any of the magic and explosive bombs during the 'The End' stage.",
    "546": "Complete this quest.",
    "547": "Remove the effects of an aggression potion by drinking tea.",
    "548": "Non-ironman: | Loot supplies from a Wilderness Warbands camp. | Ironman: | Check a warband camp for supplies.",
    "549": "Light a campfire using standard logs in Lumbridge Swamp.",
    "550": "Complete a Morvran slayer assignment that has been both preferred and extended.",
    "551": "Find an unchecked egg in the pile of dinosaur eggs south of Anachronia dinosaur farm.",
    "552": "Kill a metal dragon in Brimhaven Dungeon.",
    "553": "Obtained a collection of unique drops from the Giant Mole.",
    "554": "Escape from the spider lair in Varrock's sewers with some red spider eggs.",
    "555": "Defeat Amascut, the Devourer at 500% enrage. (X/500)",
    "556": "Defeat Amascut, the Devourer at 750% enrage. (X/750)",
    "557": "Defeat Amascut, the Devourer at 1000% enrage. (X/1,000)",
    "558": "Defeat Amascut, the Devourer at 2000% enrage. (X/2,000)",
    "559": "Defeat Amascut, the Devourer at 4000% enrage. (X/4,000)",
    "560": "Defeat Kerapac, the bound without getting hit by his 'Lightning Strike' attack.",
    "561": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage without letting him use a special attack.",
    "562": "Defeat Zamorak, Lord of Chaos at 250% or higher enrage without letting him use a special attack.",
    "563": "Defeat Zamorak, Lord of Chaos at 500% or higher enrage without letting him use a special attack.",
    "564": "Activate the lodestone in Canifis.",
    "565": "Defeat Kerapac, the bound in hard mode, solo with at least 3 active time thread tears.",
    "566": "Loot 20 urns in a single run of Pyramid Plunder without disturbing a snake.",
    "567": "Return Lady Henryeta's necklace or open Ceril's money pouch after 'Carnillean Rising'.",
    "568": "Complete this quest.",
    "569": "Obtained a collection of all unique drops from medium clue scrolls.",
    "570": "Discover all the Arc castaways.",
    "571": "Throw a blissful shadow core into the Amlodd crater.",
    "572": "Kill a shadow in the Temple of Light with a shadow spell.",
    "573": "Visit your or another clan's citadel.",
    "574": "Do something to deal with New Varrock's stray cat problem.",
    "575": "Complete this quest.",
    "576": "Attempt to release a raw fish back into a fishing spot.",
    "577": "Non-ironman: | Catch a manta ray in the Fishing Trawler activity. | Ironman: | Successfully cook a rocktail on the Witchaven dock.",
    "578": "Activate the lodestone in Catherby.",
    "579": "Claim the XP from cave paintings and 5,000 coins from Explorer Jack.",
    "580": "Tell Sister Cecilia whether to leave or stay after 'One Piercing Note'.",
    "581": "Defeat a Tormented wraith.",
    "582": "Read the book acquired from Roberta outside the Everlight porcelain clay mine. (X/2)",
    "583": "Buy a black chainbody from Wayne's Chains, and try it on in the shop. (X/2)",
    "584": "Complete Maria's additional challenges and unlock all chests in the Gulvas mansion.",
    "585": "Get a Slayer task from Vannaka.",
    "586": "Hear Vorago's introduction dialogue.",
    "587": "Complete the Liberation of Mazcab raid in a single run without anyone dying, leaving or banking while completing the listed achievements.",
    "588": "Enter the Champions' Guild.",
    "589": "Defeat all champions in the Champions' Challenge.",
    "590": "Switch to another bind loadout.",
    "591": "Defeat the King Black Dragon while wearing black dragonhide in six equipment slots. Can only be completed in a solo instance.",
    "592": "Give your player-owned house a fancy stone or tropical wood finish at the Varrock estate agent.",
    "593": "Unlock the adrenaline crystal at War's Retreat.",
    "594": "Defeat the Chaos Elemental. (X/1)",
    "595": "Obtained a collection of unique drops from the Chaos Elemental.",
    "596": "Offer some bones on the Chaos Altar in level 12 Wilderness.",
    "597": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Charge' attacks.",
    "598": "Complete each of the listed summoning pouch achievements.",
    "599": "Take a trip on a charter ship to the Port Phasmatys dock.",
    "600": "Obtained a collection of unique drops from the Kalphite Queen.",
    "601": "Make one of each kind of cheesecake.",
    "602": "Complete this quest.",
    "603": "Unlock the Chick'arra pet from Kree'arra in the God Wars Dungeon.",
    "604": "Successfully breed a chicken with the Ravensworn trait.",
    "605": "Contribute all items to the collection.",
    "606": "Contribute all items to the collection.",
    "607": "Contribute all items to the collection.",
    "608": "Contribute all items to the collection.",
    "609": "Change your family crest to the Saradomin symbol.",
    "610": "Complete this quest.",
    "611": "Hit at least 4 magma golems at the same time with Tsunami.",
    "612": "Defeat the Arch-Glacor in hard mode for a 100 killstreak.",
    "613": "Defeat the Arch-Glacor in hard mode for a 200 killstreak.",
    "614": "Put Arrav (north-east of the mahjarrat ritual marker) to rest after 'Ritual of the Mahjarrat'.",
    "615": "Feed Ridgeley, the hairdresser's pet.",
    "616": "Successfully breed a chinchompa with the Ravensworn trait.",
    "617": "Unlock the ability to chip teleport tablets to Trollheim.",
    "618": "Craft your own snelm in Morytania.",
    "619": "Claim the post-quest rewards from 'The Death of Chivalry'.",
    "620": "Restore the cabbage patch after 'The Death of Chivalry'. (X/2)",
    "621": "Unlock Templar and Dulcin armour after 'The Death of Chivalry'.",
    "622": "Kill chompy birds. (X/4,000)",
    "623": "Unlock the firemaker's outfit from the circus.",
    "624": "View the main interface within a clan citadel.",
    "625": "Complete this quest.",
    "626": "Activate the lodestone in the City of Um.",
    "627": "Complete this miniquest.",
    "628": "Complete this miniquest.",
    "629": "Complete this miniquest.",
    "630": "Claim the medium XP lamp from Azzanadra after 'Heart of Stone'.",
    "631": "Claim the smithing lamp from Squire Asrol after 'Knight's Sword'.",
    "632": "Defeat Vindicta & Gorvek solo whilst having equipped a shield that provides protection against dragonfire.",
    "633": "Defeat Vorago without using any defensive abilities.",
    "634": "Claim a reward from Claus after doing him a favour.",
    "635": "Mine some clay from the clay rocks north-west of the Lumbridge flour mill.",
    "636": "Fully exhaust all gathering plots in a Stealing Creation match.",
    "637": "Defeat Raksha, the Shadow Colossus after entering phase 4 with no active shadow pools.",
    "638": "Obtained a collection of unique drops from Slayer monsters located within Senntisten.",
    "639": "Defeat Solak, Guardian of the Grove without anyone being cleansed by Merethiel.",
    "640": "Defeat Araxxor and Araxxi without anyone being hit by their 'Cleave' attack.",
    "641": "Defeat the Ambassador without destroying any sinister fragments.",
    "642": "Grapple up and then jump off Falador's north wall.",
    "643": "Complete this quest.",
    "644": "Receive the medium clue scroll from a monkey in your backpack.",
    "645": "Claim a free clue scroll from Zaida at the Grand Exchange.",
    "646": "Defeat Nex solo, without being hit by her 'Contain' and 'Ice Prison' attacks during her Ice phase.",
    "647": "Complete this quest.",
    "648": "Gather a memory of any tier.",
    "649": "Find all 5 Zamorakian notes, dropped by those dedicated to Zamorak.",
    "650": "Complete all collections for archaeological collectors.",
    "651": "Complete 1 unique collection for an archaeological collector. (X/1)",
    "652": "Complete 2 unique collections for archaeological collectors. (X/2)",
    "653": "Complete 5 unique collections for archaeological collectors. (X/5)",
    "654": "Complete 10 unique collections for archaeological collectors. (X/10)",
    "655": "Complete 15 unique collections for archaeological collectors. (X/15)",
    "656": "Complete 20 unique collections for archaeological collectors. (X/20)",
    "657": "Complete 25 unique collections for archaeological collectors. (X/25)",
    "658": "Complete 50 unique collections for archaeological collectors. (X/50)",
    "659": "Complete all of the listed combat achievements.",
    "660": "Complete all of the listed combat achievements.",
    "661": "Complete all of the listed combat achievements.",
    "662": "Complete all of the listed combat achievements.",
    "663": "Complete all of the listed combat achievements.",
    "664": "Complete all of the listed combat achievements.",
    "665": "Defeat Vorago, if you think you're hard enough. (X/5)",
    "666": "Defeat Vorago, if you think you're hard enough. (X/10)",
    "667": "Defeat Vorago, if you think you're hard enough. (X/25)",
    "668": "Defeat Vorago, if you think you're hard enough. (X/50)",
    "669": "Defeat Vorago, if you think you're hard enough. (X/75)",
    "670": "Defeat Vorago, if you think you're hard enough. (X/100)",
    "671": "Create an aggression potion from scratch whilst in the Wilderness.",
    "672": "Taunt the lesser demon in the Wizards' Tower.",
    "673": "Use a luminite injector in the Artisans' Workshop on world 70.",
    "674": "Defeat Vorago after being pushed close to the edge of the arena during the 'Finale' stage.",
    "675": "Use the Command Skeleton Warrior ability.",
    "676": "Unlock the Commander Miniana pet from Commander Zilyana in the God Wars Dungeon.",
    "677": "Defeat Commander Zilyana. (X/1)",
    "678": "Defeat Commander Zilyana in hard mode, solo, in less than 01:15.",
    "679": "Defeat Commander Zilyana in hard mode, solo, in less than 00:42.",
    "680": "Defeat Commander Zilyana solo in less than 01:00.",
    "681": "Defeat Commander Zilyana solo in less than 00:30.",
    "682": "Gather a total of 2,000 resources from Archaeology, Fishing, Mining or Woodcutting. (X/2,000)",
    "683": "Free Droalak after 'Making History'.",
    "684": "Fully level up all Temple Trekking companions.",
    "685": "Complete all these to be able to obtain the completionist cape. (X/100)",
    "686": "Mine concentrated gold in the Living Rock Caverns.",
    "687": "Defeat Rasial, the First Necromancer without moving for 45s after being hit by his 'Finger of Death' attack in phase 4.",
    "688": "Reach maximum reputation with all Heart of Gielinor factions.",
    "689": "Complete a full run of The Zamorakian undercity and defeat Zamorak. (X/1)",
    "690": "Achieve 1,250+ rank in the Conquest minigame.",
    "691": "Unlock the Constitution pet.",
    "692": "Reach level 15 in the Constitution skill.",
    "693": "Reach level 20 in the Constitution skill.",
    "694": "Reach level 30 in the Constitution skill.",
    "695": "Reach level 40 in the Constitution skill.",
    "696": "Reach level 50 in the Constitution skill.",
    "697": "Reach level 60 in the Constitution skill.",
    "698": "Reach level 70 in the Constitution skill.",
    "699": "Reach level 80 in the Constitution skill.",
    "700": "Reach level 90 in the Constitution skill.",
    "701": "Reach level 92 in the Constitution skill.",
    "702": "Reach level 99 in the Constitution skill.",
    "703": "Reach virtual level 110 in the Constitution skill.",
    "704": "Reach virtual level 120 in the Constitution skill.",
    "705": "Unlock the Construction pet.",
    "706": "Reach level 5 in the Construction skill.",
    "707": "Reach level 10 in the Construction skill.",
    "708": "Reach level 20 in the Construction skill.",
    "709": "Reach level 30 in the Construction skill.",
    "710": "Reach level 40 in the Construction skill.",
    "711": "Reach level 50 in the Construction skill.",
    "712": "Reach level 60 in the Construction skill.",
    "713": "Reach level 70 in the Construction skill.",
    "714": "Reach level 80 in the Construction skill.",
    "715": "Reach level 90 in the Construction skill.",
    "716": "Reach level 92 in the Construction skill.",
    "717": "Reach level 99 in the Construction skill.",
    "718": "Reach virtual level 110 in the Construction skill.",
    "719": "Reach virtual level 120 in the Construction skill.",
    "720": "Complete 1 construction contract.",
    "721": "Complete 10 construction contracts.",
    "722": "Complete 25 construction contracts.",
    "723": "Complete 50 construction contracts.",
    "724": "Complete 100 construction contracts.",
    "725": "Complete this quest.",
    "726": "Solve this mystery.",
    "727": "Complete one of Erskine's Wilderness slayer contracts.",
    "728": "Complete this quest.",
    "729": "Claim the cook's extra rewards after 'Cook's Assistant'.",
    "730": "Unlock the Cooking pet.",
    "731": "Reach level 5 in the Cooking skill.",
    "732": "Reach level 10 in the Cooking skill.",
    "733": "Reach level 20 in the Cooking skill.",
    "734": "Reach level 30 in the Cooking skill.",
    "735": "Reach level 40 in the Cooking skill.",
    "736": "Reach level 50 in the Cooking skill.",
    "737": "Reach level 60 in the Cooking skill.",
    "738": "Reach level 70 in the Cooking skill.",
    "739": "Reach level 80 in the Cooking skill.",
    "740": "Reach level 90 in the Cooking skill.",
    "741": "Reach level 92 in the Cooking skill.",
    "742": "Reach level 99 in the Cooking skill.",
    "743": "Reach virtual level 110 in the Cooking skill.",
    "744": "Reach virtual level 120 in the Cooking skill.",
    "745": "Defeat the Twin Furies solo without being hit by their 'Explosion' attack.",
    "746": "Watch a shouting match between the Fremennik isles' tower guards.",
    "747": "Unlock the ability to refresh ability cooldowns at the Altar of War Upgrade at War's Retreat.",
    "748": "Unlock all perks in Heist.",
    "749": "Unlock the Corbi pet from Rathis.",
    "750": "Defeat the Corporeal Beast without being hit by the Dark Energy Core. Can only be completed in a solo instance.",
    "751": "Defeat Durzag without killing Cormes.",
    "752": "Defeat the Corporeal Beast. (X/1)",
    "753": "Defeat the Corporeal Beast solo in less than 01:00.",
    "754": "Defeat the Corporeal Beast solo in less than 00:30.",
    "755": "Defeat the Corporeal Beast. (X/5)",
    "756": "Defeat the Corporeal Beast. (X/10)",
    "757": "Defeat the Corporeal Beast. (X/25)",
    "758": "Defeat the Corporeal Beast. (X/50)",
    "759": "Defeat the Corporeal Beast. (X/75)",
    "760": "Defeat the Corporeal Beast. (X/100)",
    "761": "Unlock the Corporeal Puppy pet.",
    "762": "Have a rest on TzKal-Zuk's seat after defeating him.",
    "763": "Fully upgrade the Thieves' Guild.",
    "764": "Defeat Telos, the Warden at 100% or higher enrage after taking the full damage of the virus in phase 5.",
    "765": "Claim the goblin cower shield.",
    "766": "Successfully breed a cow with the Ravensworn trait.",
    "767": "Defeat the Sanctum Guardian. (X/5)",
    "768": "Defeat the Sanctum Guardian. (X/10)",
    "769": "Defeat the Sanctum Guardian. (X/25)",
    "770": "Defeat the Sanctum Guardian. (X/50)",
    "771": "Defeat the Sanctum Guardian. (X/75)",
    "772": "Defeat the Sanctum Guardian. (X/100)",
    "773": "Defeat the Sanctum Guardian solo. (X/5)",
    "774": "Defeat the Sanctum Guardian solo. (X/10)",
    "775": "Defeat the Sanctum Guardian solo. (X/25)",
    "776": "Defeat the Sanctum Guardian solo. (X/50)",
    "777": "Defeat the Sanctum Guardian solo. (X/75)",
    "778": "Defeat the Sanctum Guardian solo. (X/100)",
    "779": "Fill an effigy with knowledge, then crack it open.",
    "780": "Fill and crack open at least one of each effigy.",
    "781": "Unlock the Crafting pet.",
    "782": "Reach level 5 in the Crafting skill.",
    "783": "Reach level 10 in the Crafting skill.",
    "784": "Reach level 20 in the Crafting skill.",
    "785": "Reach level 30 in the Crafting skill.",
    "786": "Reach level 40 in the Crafting skill.",
    "787": "Reach level 50 in the Crafting skill.",
    "788": "Reach level 60 in the Crafting skill.",
    "789": "Reach level 70 in the Crafting skill.",
    "790": "Reach level 80 in the Crafting skill.",
    "791": "Reach level 90 in the Crafting skill.",
    "792": "Reach level 92 in the Crafting skill.",
    "793": "Reach level 99 in the Crafting skill.",
    "794": "Reach level 110 in the Crafting skill.",
    "795": "Reach virtual level 120 in the Crafting skill.",
    "796": "Unlock the ability to runecraft masterwork 2h staves by making and upgrading to +5 a full set of eternal magic weaponry. (X/9)",
    "797": "Unlocked the secret door between Crandor and Karamja.",
    "798": "Finish a game of Werewolf Skullball.",
    "799": "Defeat the Sanctum Guardian with exactly 10 crassians still alive when she dies.",
    "800": "Defeat the Crassian Leviathan. (X/1)",
    "801": "Defeat Crassian Leviathan solo in less than 02:30.",
    "802": "Defeat Crassian Leviathan solo in less than 01:30.",
    "803": "Disintegrate 12 crassian ritual keepers simultaneously during the Ambassador encounter.",
    "804": "Kill a unicow in the Tower of Life.",
    "805": "Complete this quest.",
    "806": "Complete this quest.",
    "807": "Defeat Croesus. (X/1)",
    "808": "Defeat the Magister. (X/5)",
    "809": "Defeat the Magister. (X/10)",
    "810": "Defeat the Magister. (X/25)",
    "811": "Defeat the Magister. (X/50)",
    "812": "Defeat the Magister. (X/75)",
    "813": "Defeat the Magister. (X/100)",
    "814": "Cook a shark over a sulphur pit.",
    "815": "Cry after harvesting a Lactarius mushroom in the Arc.",
    "816": "Solve this mystery.",
    "817": "Deliver a serving of tangled toad's legs to Longramble during or after 'The Path of Glouphrie'.",
    "818": "Defeat Solak, Guardian of the Grove after defeating his Blight afflicted core in a single exposure.",
    "819": "Defeat Pthentraken solo after mitigating her 'Converging Lightning' attack using insulated boots.",
    "820": "Complete this quest.",
    "821": "Complete this miniquest.",
    "822": "Unlock the ancient curses by reading the ancient hymnal given to you by Azzanadra.",
    "823": "Acquire knowledge from the listed ancient blueprints.",
    "824": "Given by Drangund, the Dungeoneering Tutor, in the camp for completing all Easy Tasks in Daemonheim.",
    "825": "Given by Thok in the camp for completing all Elite Tasks in Daemonheim.",
    "826": "Given by Talsar in the camp for completing all Hard Tasks in Daemonheim.",
    "827": "Given by Marmaros, the Rewards Trader, in the camp for completing all Medium Tasks in Daemonheim.",
    "828": "Claim the malleus daemoniorum.",
    "829": "Claim the XP reward from Daero following Monkey Madness.",
    "830": "Defeat any of the Dagannoth Kings. (X/5)",
    "831": "Defeat any of the Dagannoth Kings. (X/10)",
    "832": "Defeat any of the Dagannoth Kings. (X/25)",
    "833": "Defeat any of the Dagannoth Kings. (X/50)",
    "834": "Defeat any of the Dagannoth Kings. (X/75)",
    "835": "Defeat any of the Dagannoth Kings. (X/100)",
    "836": "Defeat any of the Dagannoth Kings. (X/1)",
    "837": "Defeat the Dagannoth Supreme solo with each different colour variation of Balmung.",
    "838": "Solve this mystery.",
    "839": "Complete a daily challenge 10 days in a row. (X/10)",
    "840": "Complete this miniquest.",
    "841": "Use the Finger of Death ability while having 6 stacks of Necrosis to avoid draining any adrenaline.",
    "842": "Enter the Menaphos Slayer Dungeon.",
    "843": "At the Loarnab museum exhibit, re-enact an event from your own history.",
    "844": "Collect the following 'lore' books from the Infernal Source.",
    "845": "Help the Archivist recover all core memory data in the Hall of Memories.",
    "846": "Complete this quest.",
    "847": "Defeat Yakamaru with one durable jellyfish and one reflecting jellyfish still alive.",
    "848": "Defeat Durzag without opening any of the charger cages in the arena walls.",
    "849": "Complete this quest.",
    "850": "Hunt the Thalassus until it flees for good. (X/11)",
    "851": "Complete this quest.",
    "852": "Kill a deathwing in the dungeon under the Kharazi Jungle.",
    "853": "Complete this quest.",
    "854": "Defeat Nakatra, Devourer Eternal without letting any Corrupted scarab healer reach her or Volatile scarab akh explode.",
    "855": "Unlock all permanent effects from Death's Store. (X/9)",
    "856": "Craft an entire set of armour and weapons worthy of a Death Lotus assassin.",
    "857": "Complete this quest.",
    "858": "Complete this quest.",
    "859": "Discover all the mahjarrat deathstones on Freneskae.",
    "860": "Solve this mystery.",
    "861": "Solve this mystery.",
    "862": "Defeat Amascut, the Devourer at 1000% or higher enrage without anyone being hit by her 'Empowered Soulfire', 'Devourer's Shockwave' and 'Devourer's Hieroglyphs' attacks.",
    "863": "Claim the XP reward after 'Blood Runs Deep'.",
    "864": "Kill three dagannoths in the first layer of Waterbirth Island's dungeon.",
    "865": "Unlock the Defence pet.",
    "866": "Reach level 5 in the Defence skill.",
    "867": "Reach level 10 in the Defence skill.",
    "868": "Reach level 20 in the Defence skill.",
    "869": "Reach level 30 in the Defence skill.",
    "870": "Reach level 40 in the Defence skill.",
    "871": "Reach level 50 in the Defence skill.",
    "872": "Reach level 60 in the Defence skill.",
    "873": "Reach level 70 in the Defence skill.",
    "874": "Reach level 80 in the Defence skill.",
    "875": "Reach level 90 in the Defence skill.",
    "876": "Reach level 92 in the Defence skill.",
    "877": "Reach level 99 in the Defence skill.",
    "878": "Reach virtual level 110 in the Defence skill.",
    "879": "Reach virtual level 120 in the Defence skill.",
    "880": "Complete this quest.",
    "881": "Defeat Kerapac, the bound in hard mode without being hit by his 'Lightning Strike' attack.",
    "882": "Defeat Yor'Ger the Deceiver while on a Kal'gerion demon slayer task.",
    "883": "Complete this quest.",
    "884": "Test the structural integrity of the gargoyle at the Infernal Source.",
    "885": "Defeat the Crassian Leviathan. (X/5)",
    "886": "Defeat the Crassian Leviathan. (X/10)",
    "887": "Defeat the Crassian Leviathan. (X/25)",
    "888": "Defeat the Crassian Leviathan. (X/50)",
    "889": "Defeat the Crassian Leviathan. (X/75)",
    "890": "Defeat the Crassian Leviathan. (X/100)",
    "891": "Defeat the Crassian Leviathan solo. (X/5)",
    "892": "Defeat the Crassian Leviathan solo. (X/10)",
    "893": "Defeat the Crassian Leviathan solo. (X/25)",
    "894": "Defeat the Crassian Leviathan solo. (X/50)",
    "895": "Defeat the Crassian Leviathan solo. (X/75)",
    "896": "Defeat the Crassian Leviathan solo. (X/100)",
    "897": "Complete an abandoned floor on any complexity, solo.",
    "898": "Defeat any of the Ascension Legiones. (X/5)",
    "899": "Defeat any of the Ascension Legiones. (X/10)",
    "900": "Defeat any of the Ascension Legiones. (X/25)",
    "901": "Defeat any of the Ascension Legiones. (X/50)",
    "902": "Defeat any of the Ascension Legiones. (X/75)",
    "903": "Defeat any of the Ascension Legiones. (X/100)",
    "904": "Given by Grand Vizier Hassan in either Al Kharid Palace or Menaphos Merchant District for completing all Easy Tasks in the Kharidian desert.",
    "905": "Given by the Golem in Uzer for completing all Elite Tasks in the Kharidian desert.",
    "906": "Given by Hakeem the Mayor in Pollnivneach for completing all Hard Tasks in the Kharidian desert.",
    "907": "Given by Zahur in Nardah for completing all Medium Tasks in the Kharidian desert.",
    "908": "Complete this miniquest.",
    "909": "Complete this quest.",
    "910": "Complete this quest.",
    "911": "Complete this quest.",
    "912": "Complete this quest.",
    "913": "Kill Tarn Razorlor (or visit his lair if he's already dead).",
    "914": "Complete this quest.",
    "915": "Defeat Taraket the Necromancer while the bloated monstrosity is still alive.",
    "916": "Unlock the Dharok bobblehead from Rise of the Six.",
    "917": "Dial to the fairy ring west of Varrock.",
    "918": "Complete this quest.",
    "919": "Find Uraeus and Aten in the Kalphite Nursery after 'Diamond in the Rough'.",
    "920": "Find the clan journal pages from the Hefin Agility Course in Prifddinas.",
    "921": "Discover and read all five journals of The Magister.",
    "922": "Find all five God Wars journals.",
    "923": "Defeat Nex, Angel of Death in a team of 7 or fewer without allowing any of the 'Unstable Smoke' crystals to explode.",
    "924": "Defeat the Queen Black Dragon after surviving a full time stop special attack.",
    "925": "Defeat Osseous solo without being stunned by her 'Roar' attack.",
    "926": "Unlock the Diddyzag pet from Beastmaster Durzag in the Liberation of Mazcab.",
    "927": "Harness the power of the infernal d% dice.",
    "928": "Die by the blade!",
    "929": "Dig and retrieve a clue box using a fetch casket scroll and a meerkat familiar.",
    "930": "Complete this Special quest.",
    "931": "Complete this quest.",
    "932": "Complete this quest.",
    "933": "Complete this quest.",
    "934": "Complete this quest.",
    "935": "Complete this quest.",
    "936": "Take down each dinosaur in Big Game Hunter.",
    "937": "Take the boat to Entrana.",
    "938": "Do a dance in the impling collector's house with at least ten other implings present.",
    "939": "Complete this quest.",
    "940": "Claim all XP chests during or after 'Dishonour among Thieves'.",
    "941": "Claim all loot chests after 'Dishonour among Thieves'.",
    "942": "Kill a werewolf in its human form using the wolfbane dagger whilst in Canifis.",
    "943": "Defeat Vanstrom Klause in the Dominion Tower whilst wielding a reforged Sunspear and full set of House Drakan robes.",
    "944": "Claim the one-time Divination XP from a distorted engrammeter.",
    "945": "Unlock the Divination pet.",
    "946": "Reach level 5 in the Divination skill.",
    "947": "Reach level 10 in the Divination skill.",
    "948": "Reach level 20 in the Divination skill.",
    "949": "Reach level 30 in the Divination skill.",
    "950": "Reach level 40 in the Divination skill.",
    "951": "Reach level 50 in the Divination skill.",
    "952": "Reach level 60 in the Divination skill.",
    "953": "Reach level 70 in the Divination skill.",
    "954": "Reach level 80 in the Divination skill.",
    "955": "Reach level 90 in the Divination skill.",
    "956": "Reach level 92 in the Divination skill.",
    "957": "Reach level 99 in the Divination skill.",
    "958": "Reach virtual level 110 in the Divination skill.",
    "959": "Reach virtual level 120 in the Divination skill.",
    "960": "Complete the 10 Divination achievements and claim your reward.",
    "961": "Find an elite clue scroll in your player-owned house aquarium.",
    "962": "Complete the Dominion journal.",
    "963": "Claim the elite clue scroll using Ava's alerter from 'Do No Evil'.",
    "964": "Complete this quest.",
    "965": "Defeat Nex, Angel of Death in a team of 7 or fewer without letting any reavers be absorbed.",
    "966": "Smith some blurite crossbow limbs on Thurgo's anvil.",
    "967": "Rest whilst listening to the Dead Beats in the City of Um.",
    "968": "Get caught by each of the big game creatures once.",
    "969": "Enter Al Kharid via its west gate.",
    "970": "Give a bone to one of Varrock's stray dogs (or to your pet stray dog if you have one).",
    "971": "Mine some iron ore in the mining spot south-west of Varrock.",
    "972": "Unlock the memory-crushing scrimshaw scroll from the Waiko ports reward shop.",
    "973": "Buy a skewered kebab from the Poison Arrow pub.",
    "974": "Find and read all five miner's journals and the diary of Jebediah Omnis.",
    "975": "Defeat Zemouregal & Vorkath in hard mode without using the ballista.",
    "976": "Defeat every miniboss inside the Zamorakian Undercity.",
    "977": "Defeat Raksha, the Shadow Colossus without letting him use his 'Tail Sweep' attack in phase 4.",
    "978": "Defeat Verak Lith after using the correct protection prayer against all of his 'Spire' attacks.",
    "979": "Deposit a ritual focus object into the focus storage at the City of Um ritual site.",
    "980": "Defeat Zemouregal & Vorkath without triggering the optional rituals.",
    "981": "Complete a Burgh de Rott Ramble.",
    "982": "Use any of the magic carpets in the desert.",
    "983": "Loot a chest in the magic axe hut in the deep Wilderness.",
    "984": "Eat food and then drink a Saradomin brew less than a second apart.",
    "985": "Defeat Nex, Angel of Death in a team of 7 or fewer without anyone activating the 'Unstable Smoke' crystal.",
    "986": "Speak with the Doomsayer about the Warning System.",
    "987": "Complete this miniquest.",
    "988": "Complete this miniquest.",
    "989": "Complete this miniquest.",
    "990": "Complete this miniquest.",
    "991": "Complete this miniquest.",
    "992": "Complete this miniquest.",
    "993": "Complete this miniquest.",
    "994": "Complete this miniquest.",
    "995": "Defeat Kree'arra solo after defeating all of his lieutenants twice.",
    "996": "Have the apothecary in Varrock make you a strength potion.",
    "997": "Dispel 6 ritual disturbances within a single ritual.",
    "998": "Catch a Black Salamander near the Boneyard.",
    "999": "Defeat a zombie in the sewers under the jailhouse.",
    "1000": "Discover all of the listed potion recipes.",
    "1001": "Kill a dust devil in the Smoke Dungeon.",
    "1002": "Collect the following lore books from bosses inside the Dragonkin Laboratory.",
    "1003": "Complete this quest.",
    "1004": "Defeat Verak Lith while ensuring every ricocheted attack is absorbed and dispersed into a pile of eggs.",
    "1005": "Find and return Naressa's journal to her.",
    "1006": "Restored at least one of each dragonkin artefact.",
    "1007": "Complete all of the listed achievements.",
    "1008": "Find and read the adamant dragon journals.",
    "1009": "Obtained a collection of unique drops from the Dragonkin Laboratory elite dungeon.",
    "1010": "Kill a dragonstone dragon, while wearing the dragonstone armour and dragonstone jewellery, using dragonstone bolts, with an inventory full of dragonstones.",
    "1011": "Successfully breed a dragon with the Ravensworn trait.",
    "1012": "Discover all invention blueprints.",
    "1013": "Free the remaining spirits around above-ground Daemonheim after 'Remains of the Necrolord'.",
    "1014": "Activate the lodestone in Draynor.",
    "1015": "Complete this quest.",
    "1016": "Start a research contract with a full team of consultants.",
    "1017": "Wear rockshell, spined or skeletal armour and have the locals use an honorific with your Fremennik name.",
    "1018": "Upgrade a set of Death Skull and Deathwarden equipment to tier 20.",
    "1019": "Upgrade a set of Death Skull and Deathwarden equipment to tier 30.",
    "1020": "Upgrade a set of Death Skull and Deathwarden equipment to tier 40.",
    "1021": "Upgrade a set of Death Skull and Deathwarden equipment to tier 50.",
    "1022": "Upgrade a set of Death Skull and Deathwarden equipment to tier 60.",
    "1023": "Boost your Magic level with a self-made tier 2+ potion (from seed).",
    "1024": "Navigate the Underground Pass, using the thieving shortcuts and talking to Klank on the way through about his gloves. (X/2)",
    "1025": "Cook a karambwan thoroughly.",
    "1026": "Complete this quest.",
    "1027": "Defeat Vorago without anyone hiding behind a waterfall during stage 4.",
    "1028": "Defeat Araxxor and Araxxi while at least 40% (Duo: 80%) of the total acid remains in the pool after taking the Acid path during phase 2.",
    "1029": "Complete this quest.",
    "1030": "Find a lost star sprite on Zolarea.",
    "1031": "Kill something on the Khazard Battlefield.",
    "1032": "Fully upgrade the magic roles on your ring of kinship.",
    "1033": "Fully upgrade the ranged roles on your ring of kinship.",
    "1034": "Fully upgrade the skiller roles on your ring of kinship.",
    "1035": "Fully upgrade the melee roles on your ring of kinship.",
    "1036": "Fully upgrade your ring of kinship.",
    "1037": "Unlock the Dungeoneering pet.",
    "1038": "Reach level 5 in the Dungeoneering skill.",
    "1039": "Reach level 10 in the Dungeoneering skill.",
    "1040": "Reach level 20 in the Dungeoneering skill.",
    "1041": "Reach level 30 in the Dungeoneering skill.",
    "1042": "Reach level 40 in the Dungeoneering skill.",
    "1043": "Reach level 50 in the Dungeoneering skill.",
    "1044": "Reach level 60 in the Dungeoneering skill.",
    "1045": "Reach level 70 in the Dungeoneering skill.",
    "1046": "Reach level 80 in the Dungeoneering skill.",
    "1047": "Reach level 90 in the Dungeoneering skill.",
    "1048": "Reach level 92 in the Dungeoneering skill.",
    "1049": "Reach level 99 in the Dungeoneering skill.",
    "1050": "Reach level 110 in the Dungeoneering skill.",
    "1051": "Reach level 113 in the Dungeoneering skill.",
    "1052": "Reach level 120 in the Dungeoneering skill.",
    "1053": "Visit the isle of Crandor via the dungeon below the volcano.",
    "1054": "Update the Dragonkin Primer with murals in Brimhaven Dungeon and Mount Firewake.",
    "1055": "Complete this quest.",
    "1056": "Teleport to the City of Um using the City of Um Teleport incantation.",
    "1057": "Complete the Ranch Out of Time breeding log.",
    "1058": "Complete the breeding log.",
    "1059": "Complete this quest.",
    "1060": "Complete this quest.",
    "1061": "Activate the lodestone at Eagles' Peak.",
    "1062": "Cast the Lumbridge Teleport spell (not the Home Teleport spell).",
    "1063": "Complete story voyages of the Architect, Chef and Trapper.",
    "1064": "Complete story voyages of the Tengu, Memory and Exile.",
    "1065": "Complete story voyages of the Biologist, Missionary and Convict.",
    "1066": "Complete story voyages of the Whaler, Occultist and Assassin.",
    "1067": "Explore the Eastern Lands as far as the Shield from your port. Distance travelled: (X/4,100,000)",
    "1068": "Bake a pie using Magic.",
    "1069": "Contribute all items to the collection.",
    "1070": "Contribute all items to the collection.",
    "1071": "Contribute all items to the collection.",
    "1072": "Contribute all items to the collection.",
    "1073": "Contribute all items to the collection.",
    "1074": "Heal yourself using Resonance against Alanogard the Black while wielding a black dragonhide shield.",
    "1075": "Complete this quest.",
    "1076": "Activate the lodestone in Edgeville.",
    "1077": "Unlock the Elidinis pet from the Gate of Elidinis.",
    "1078": "Fully unlock all eagle transport routes.",
    "1079": "Hand in a total of 1,000 effigy materials to Vicendithas. (X/1,000)",
    "1080": "Help Ben the ancient zygomite near the mystical tree south of the Anachronia dinosaur farm.",
    "1081": "Cook Thalmund's favourite dish within Thalmund's forge.",
    "1082": "Defeat the Emberbound Soul while having the chronicle attraction curse active.",
    "1083": "Earn the Wisdom of Anima fletching perk for all the Elder God arrow types.",
    "1084": "Defeat the Chaos Elemental. (X/5)",
    "1085": "Defeat the Chaos Elemental. (X/10)",
    "1086": "Defeat the Chaos Elemental. (X/25)",
    "1087": "Defeat the Chaos Elemental. (X/50)",
    "1088": "Defeat the Chaos Elemental. (X/75)",
    "1089": "Defeat the Chaos Elemental. (X/100)",
    "1090": "Complete this quest.",
    "1091": "Complete this quest.",
    "1092": "Complete this quest.",
    "1093": "Complete this quest.",
    "1094": "Heal an elemental wizard by casting an appropriate elemental spell on him.",
    "1095": "Defeat every miniboss inside the Dragonkin Laboratory.",
    "1096": "Unlock the Ellie pet.",
    "1097": "Obtain the titles of the elven clans.",
    "1098": "Solve this mystery.",
    "1099": "Solve this mystery.",
    "1100": "Complete this quest.",
    "1101": "Fill a waterskin from the fountain in Enakhra's Temple.",
    "1102": "Use Meteor Strike on all dinosaurs.",
    "1103": "Kill an adult black unicorn.",
    "1104": "Siphon all of the different types of energy nodes in the Runespan.",
    "1105": "Convert a memory, or an enriched memory, into energy.",
    "1106": "Use the hot-air balloon to travel from Varrock to somewhere else.",
    "1107": "Complete this quest.",
    "1108": "Purchase the Mad Ramblings.",
    "1109": "Gather an enriched memory of any type.",
    "1110": "Complete this miniquest.",
    "1111": "Watch the 'While Guthix Sleeps' epilogue and claim the XP reward.",
    "1112": "Complete all Sagas with 100%.",
    "1113": "Complete this quest.",
    "1114": "Have Aubury teleport you to the Rune Essence mine.",
    "1115": "Defeat Nakatra, Devourer Eternal. (X/5)",
    "1116": "Defeat Nakatra, Devourer Eternal. (X/10)",
    "1117": "Defeat Nakatra, Devourer Eternal. (X/25)",
    "1118": "Defeat Nakatra, Devourer Eternal. (X/50)",
    "1119": "Defeat Nakatra, Devourer Eternal. (X/75)",
    "1120": "Defeat Nakatra, Devourer Eternal. (X/100)",
    "1121": "Hand in a magical zygomite called Trevor with the Loyal trait to Granny P.",
    "1122": "Mine some coal in the mining spot south-west of Lumbridge Swamp.",
    "1123": "Increase the capacity of your ore box by mining 100 of each of the listed ores.",
    "1124": "Increase the capacity of your ore box by mining 100 of each of the listed ores. (X/10)",
    "1125": "Increase the capacity of your wood box by cutting eternal magic logs. (X/100)",
    "1126": "Increase the capacity of your wood box by cutting 100 of each of the listed logs. (X/10)",
    "1127": "Complete this quest.",
    "1128": "Defeat Zemouregal & Vorkath in hard mode. (X/5)",
    "1129": "Defeat Zemouregal & Vorkath in hard mode. (X/10)",
    "1130": "Defeat Zemouregal & Vorkath in hard mode. (X/25)",
    "1131": "Defeat Zemouregal & Vorkath in hard mode. (X/50)",
    "1132": "Defeat Zemouregal & Vorkath in hard mode. (X/75)",
    "1133": "Defeat Zemouregal & Vorkath in hard mode. (X/100)",
    "1134": "Find out about the history of the Wilderness from Vala.",
    "1135": "Complete a hardmode flawless run by defeating TzKal-Zuk in a single attempt after completing all of his challenges.",
    "1136": "Obtained a collection of unique drops from the Kalphite King.",
    "1137": "Claim and use the 'Fate of the Gods' XP lamps from Azzanadra and Wahisietel.",
    "1138": "Gather a total of 10,000 resources from Archaeology, Fishing, Mining or Woodcutting. (X/10,000)",
    "1139": "Find and read the explorer's notes in the Keldagrim library.",
    "1140": "Complete this quest.",
    "1141": "Defeat the Rex Matriarchs, Pthentraken, Orikalka, and Rathis, all within 5 seconds of each other. Can only be completed in a solo instance.",
    "1142": "Exchange pizazz points at the Mage Training Arena.",
    "1143": "Complete this miniquest.",
    "1144": "Complete this quest.",
    "1145": "Complete this quest.",
    "1146": "Discover what the Wise Old Man is watching through his telescope.",
    "1147": "Defeat Flesh-hatcher Mhekarnahz. (X/5)",
    "1148": "Defeat Flesh-hatcher Mhekarnahz. (X/10)",
    "1149": "Defeat Flesh-hatcher Mhekarnahz. (X/25)",
    "1150": "Defeat Flesh-hatcher Mhekarnahz. (X/50)",
    "1151": "Defeat Flesh-hatcher Mhekarnahz. (X/75)",
    "1152": "Defeat Flesh-hatcher Mhekarnahz. (X/100)",
    "1153": "Solve this mystery.",
    "1154": "Talk to the battlemaster of a clan citadel.",
    "1155": "Teleport to the fairy ring in the Poison Waste.",
    "1156": "Use a fairy ring to appear on a mountaintop, near the windswept tree.",
    "1157": "Activate the lodestone in Falador.",
    "1158": "Given by Redbeard Frank in Port Sarim for completing all Easy Tasks in Falador.",
    "1159": "Given by Sir Vyvin's squire in Falador Castle for completing all Elite Tasks in Falador.",
    "1160": "Given by Sir Vyvin's squire in Falador Castle for completing all Hard Tasks in Falador.",
    "1161": "Given by the chemist in Rimmington for completing all Medium Tasks in Falador.",
    "1162": "Solve this mystery.",
    "1163": "Obtained a collection of unique drops from Nex, Angel of Death.",
    "1164": "Solve this mystery.",
    "1165": "Use the gnome glider to travel to Karamja.",
    "1166": "Use a familiar to make a maple fire within Seers' Village.",
    "1167": "Obtained a collection of unique drops from the Barrows Brothers: Rise of the Six.",
    "1168": "Complete this quest.",
    "1169": "Reconnect the Prifddinas spirit tree with her brethren.",
    "1170": "Discover your family crest from Sir Renitee.",
    "1171": "Earn the title 'The Famous' by completing Morvran's Slayer challenge.",
    "1172": "Interact with the deep sea treasure turtle.",
    "1173": "Complete one of each of the Wilderness flash events at least once.",
    "1174": "Unlock the Farming pet.",
    "1175": "Reach level 5 in the Farming skill.",
    "1176": "Reach level 10 in the Farming skill.",
    "1177": "Reach level 20 in the Farming skill.",
    "1178": "Reach level 30 in the Farming skill.",
    "1179": "Reach level 40 in the Farming skill.",
    "1180": "Reach level 50 in the Farming skill.",
    "1181": "Reach level 60 in the Farming skill.",
    "1182": "Reach level 70 in the Farming skill.",
    "1183": "Reach level 80 in the Farming skill.",
    "1184": "Reach level 90 in the Farming skill.",
    "1185": "Reach level 92 in the Farming skill.",
    "1186": "Reach level 99 in the Farming skill.",
    "1187": "Reach level 110 in the Farming skill.",
    "1188": "Reach level 113 in the Farming skill.",
    "1189": "Reach level 120 in the Farming skill.",
    "1190": "Wear a full suit of any tier 1 armour (helm, body, legs, boots, gloves).",
    "1191": "Defeat Avaryss and Nymora. (X/5)",
    "1192": "Defeat Avaryss and Nymora. (X/10)",
    "1193": "Defeat Avaryss and Nymora. (X/25)",
    "1194": "Defeat Avaryss and Nymora. (X/50)",
    "1195": "Defeat Avaryss and Nymora. (X/75)",
    "1196": "Defeat Avaryss and Nymora. (X/100)",
    "1197": "Ride an eagle to the desert.",
    "1198": "Double surge in space.",
    "1199": "Get a cat training medal from Gertrude.",
    "1200": "Complete this quest.",
    "1201": "Complete this miniquest.",
    "1202": "Catch a fish at the Fishing Platform using either a net or rod.",
    "1203": "Defeat Rathis solo after stopping her from healing during her 'Poison absorption' attack.",
    "1204": "Defeat the King Black Dragon while using dragonfire protection to mitigate his attacks.",
    "1205": "Bring your star sprite back to their house.",
    "1206": "Restore the Grand Library's register of notable cat citizens of Menaphos.",
    "1207": "Obtained a collection of unique drops from Slayer monsters located within Morytania.",
    "1208": "Unlock the upgrade to the ferocious ring so it can be used in Morvran's arena.",
    "1209": "Craft a soul rune at the soul altar with a soul cape equipped.",
    "1210": "Help Salusan the ilujanka near the mystical tree on the west coast of Anachronia.",
    "1211": "Complete this quest.",
    "1212": "Unlock the second attunable portal at War's Retreat.",
    "1213": "Fill all of the Treasure Trail hidey-holes. You can find a complete list of hidey-holes at the noticeboard by Zaida.",
    "1214": "Fill a bucket from the pump north of the Falador's west bank.",
    "1215": "Open the chest in the Lava Maze with a muddy key.",
    "1216": "Get 5,000 total kills and kill each boss 100 times. (X/55)",
    "1217": "Complete this miniquest.",
    "1218": "Unlock all ferry points in the City of Um. (X/5)",
    "1219": "Complete this miniquest.",
    "1220": "Mix a Guthix Balance potion while in Morytania.",
    "1221": "Personally defeat Vorago with the Maul of Omens.",
    "1222": "Access the fourth room of the player-owned slayer dungeon.",
    "1223": "Craft a fire rune at the fire altar.",
    "1224": "Unlock the Firemaking pet.",
    "1225": "Reach level 5 in the Firemaking skill.",
    "1226": "Reach level 10 in the Firemaking skill.",
    "1227": "Reach level 20 in the Firemaking skill.",
    "1228": "Reach level 30 in the Firemaking skill.",
    "1229": "Reach level 40 in the Firemaking skill.",
    "1230": "Reach level 50 in the Firemaking skill.",
    "1231": "Reach level 60 in the Firemaking skill.",
    "1232": "Reach level 70 in the Firemaking skill.",
    "1233": "Reach level 80 in the Firemaking skill.",
    "1234": "Reach level 90 in the Firemaking skill.",
    "1235": "Reach level 92 in the Firemaking skill.",
    "1236": "Reach level 99 in the Firemaking skill. (Where arson is its own reward.)",
    "1237": "Reach level 110 in the Firemaking skill.",
    "1238": "Reach virtual level 120 in the Firemaking skill.",
    "1239": "Light the campfire and find exotic herbs and seeds after 'Fairy Tale III'.",
    "1240": "Obtained a collection of unique drops from TzTok-Jad and Har-Aken.",
    "1241": "Kill an ice strykewyrm (you do not need to be assigned these as your slayer target to complete this Task).",
    "1242": "Catch a tuna without a harpoon.",
    "1243": "Unlock the Fishing pet.",
    "1244": "Reach level 5 in the Fishing skill.",
    "1245": "Reach level 10 in the Fishing skill.",
    "1246": "Reach level 20 in the Fishing skill.",
    "1247": "Reach level 30 in the Fishing skill.",
    "1248": "Reach level 40 in the Fishing skill.",
    "1249": "Reach level 50 in the Fishing skill.",
    "1250": "Reach level 60 in the Fishing skill.",
    "1251": "Reach level 70 in the Fishing skill.",
    "1252": "Reach level 80 in the Fishing skill.",
    "1253": "Reach level 90 in the Fishing skill.",
    "1254": "Reach level 92 in the Fishing skill.",
    "1255": "Reach level 99 in the Fishing skill.",
    "1256": "Reach virtual level 110 in the Fishing skill.",
    "1257": "Reach virtual level 120 in the Fishing skill.",
    "1258": "Complete this quest.",
    "1259": "Catch a fish in the Ports District.",
    "1260": "Sample all of the listed fish dishes.",
    "1261": "Defeat General Graardor using only your fists. Can only be completed in a solo instance.",
    "1262": "Cast the Bones to bananas spell on some bones within Senntisten.",
    "1263": "Pick 5 bananas from the plantation located east of the volcano.",
    "1264": "Earn 5 credits from a construction contract.",
    "1265": "Obtained a collection of unique drops from General Graardor.",
    "1266": "Complete this miniquest.",
    "1267": "Use a Flamtaer hammer to help fix the Shades of Mort'ton temple.",
    "1268": "Complete one of each of the original thirteen Wilderness flash events at least once.",
    "1269": "Complete this miniquest.",
    "1270": "Become the champion of the Fight Pit.",
    "1271": "Use the Sinclair Mansion to Fremennik Province Agility shortcut.",
    "1272": "Complete this miniquest.",
    "1273": "Defeat Flesh-hatcher Mhekarnahz. (X/1)",
    "1274": "Unlock the Flesh-hatchling Mhekarnahz pet from Flesh-hatcher Mhekarnahz.",
    "1275": "Unlock the ability to fletch masterwork bows by making and upgrading to Mk. 5 a full set of primal/eternal magic ranged weaponry. (X/10)",
    "1276": "Unlock the Fletching pet.",
    "1277": "Reach level 5 in the Fletching skill.",
    "1278": "Reach level 10 in the Fletching skill.",
    "1279": "Reach level 20 in the Fletching skill.",
    "1280": "Reach level 30 in the Fletching skill.",
    "1281": "Reach level 40 in the Fletching skill.",
    "1282": "Reach level 50 in the Fletching skill.",
    "1283": "Reach level 60 in the Fletching skill.",
    "1284": "Reach level 70 in the Fletching skill.",
    "1285": "Reach level 80 in the Fletching skill.",
    "1286": "Reach level 90 in the Fletching skill.",
    "1287": "Reach level 92 in the Fletching skill.",
    "1288": "Reach level 99 in the Fletching skill.",
    "1289": "Reach level 110 in the Fletching skill.",
    "1290": "Reach virtual level 120 in the Fletching skill.",
    "1291": "Satiate Spicy Flower's appetite for spicy flowers.",
    "1292": "Convince Flippers McGraw in the Port Sarim pub to join your crew.",
    "1293": "Defeat TzKal-Zuk in hard mode in a single run after defeating all Igneous minions in reverse order during his 'Infernal Rain' attack in wave 18.",
    "1294": "Defeat Queen Black Dragon after killing 30 grotworms during the fight. Can only be completed in a solo instance.",
    "1295": "Defeat Raksha, the Shadow Colossus after using the correct protection prayer against all of his basic attacks.",
    "1296": "Convince Velrak the Explorer to escape Taverley Dungeon.",
    "1297": "Solve the mystery of the Golden Path.",
    "1298": "Find out the outcome of the research continued by Vicendithas.",
    "1299": "Defeat Telos, the Warden at 100% or higher enrage after charging and using all fonts in phase 5.",
    "1300": "Defeat Telos, the Warden at 1000% or higher enrage after charging and using all fonts in phase 5.",
    "1301": "Catch and cook a ghostly sole in the City of Um.",
    "1302": "Catch a golden warbler.",
    "1303": "Use the shortcut under the wall, north-west of the Grand Exchange.",
    "1304": "Return Mabel's ring and chop down the guard's tree.",
    "1305": "Complete Forcae's journal. (X/10)",
    "1306": "Defeat Masuta the Ascended without any stacks of the calm waters effect.",
    "1307": "Complete this miniquest.",
    "1308": "Solve this mystery.",
    "1309": "Complete this quest.",
    "1310": "Complete this quest.",
    "1311": "Upgrade the workshop in Fort Forinthry to Tier 3.",
    "1312": "Activate the lodestone at Fort Forinthry.",
    "1313": "Upgrade the kitchen in Fort Forinthry to Tier 3.",
    "1314": "Upgrade the guardhouse in Fort Forinthry to Tier 3.",
    "1315": "Restore and boost your prayer points at the altar in the Nature Grotto.",
    "1316": "Complete this miniquest.",
    "1317": "Upgrade the townhall in Fort Forinthry to Tier 3.",
    "1318": "Defeat all 4 black hands, within 10 seconds after defeating the first, during the Black Stone Dragon fight.",
    "1319": "Unlock all four seasonal variation music tracks (possibly using the seasonaliser).",
    "1320": "Defeat Amascut, the Devourer after intercepting her attack on all four of the Menaphite altars at once in phase 5.",
    "1321": "Solve this mystery.",
    "1322": "Claim 1,940 coins from Fred the Farmer after the 'Sheep Shearer' miniquest.",
    "1323": "Tell Faisal the Barman that Traitorous Hesham's drink was poisoned.",
    "1324": "Defeat Gregorovic solo without allowing him to absorb any spirits.",
    "1325": "Solve this mystery.",
    "1326": "Defeat Vorago without Vorago moving and without anyone moving during the 'Vitalis' stage.",
    "1327": "Fish shark barehanded off the Burgh de Rott dock.",
    "1328": "Learn the history of the Fremennik and outerlanders from Chieftain Brundt.",
    "1329": "Activate the lodestone in the Fremennik Province.",
    "1330": "Given by the council workman on the bridge south of Rellekka for completing all Easy Tasks in the Fremennik Province.",
    "1331": "Given by Advisor Ghrim in Miscellania for completing all Elite Tasks in the Fremennik Province.",
    "1332": "Given by Advisor Ghrim in Miscellania for completing all Hard Tasks in the Fremennik Province.",
    "1333": "Given by Yrsa in Rellekka for completing all Medium Tasks in the Fremennik Province.",
    "1334": "Make cheese in the dairy churn in Rellekka.",
    "1335": "Obtain the highest boost available in the 'Fishing Frenzy' activity.",
    "1336": "Speak to Amascut, the Devourer while you have a cat follower once she's been defeated.",
    "1337": "Engage in all of Thalmund's conversations.",
    "1338": "Mine 10 crashed stars.",
    "1339": "Obtained a collection of unique drops from Araxxi.",
    "1340": "Swish a sweet hoop at Everlight.",
    "1341": "Fully upgrade the penguin spy device by tracking penguin spies around the world.",
    "1342": "Complete this miniquest.",
    "1343": "Feed Frito her favourite fruit.",
    "1344": "Craft a fruit basket using the loom at the farm north of Port Sarim.",
    "1345": "Fill up Luthas' crate near the Musa Point plantation with bananas and receive 30 coins for your work.",
    "1346": "Use the fishing spots north of the banana plantation.",
    "1347": "Cast the High alchemy spell on a bar of obsidian in TzKal-Zuk's arena.",
    "1348": "Defeat TzKal-Zuk in hard mode in a single run without moving after attacking the 'Conduit of Ful' in wave 18.",
    "1349": "Harvest bittercap mushrooms in the farming patch near Canifis.",
    "1350": "Complete this quest.",
    "1351": "Adventure down a shifting tomb and successfully escape. (X/1)",
    "1352": "Adventure down 10 shifting tombs and successfully escape.(X/10)",
    "1353": "Adventure down 50 shifting tombs and successfully escape. (X/50)",
    "1354": "Adventure down 100 shifting tombs and successfully escape. (X/100)",
    "1355": "Adventure down 200 shifting tombs and successfully escape. (X/200)",
    "1356": "Obtained a collection of unique drops from Gregorovic.",
    "1357": "Complete each of the listed agility courses at least once.",
    "1358": "Complete this quest.",
    "1359": "Defeat Vorago without anyone being hit by a Gas Cloud attack during the 'Green Bomb' stage.",
    "1360": "Enter through the western gate of Port Phasmatys.",
    "1361": "Unlock the General Awwdor pet from General Graardor in the God Wars Dungeon.",
    "1362": "Contribute all items to the collection.",
    "1363": "Contribute all items to the collection.",
    "1364": "Contribute all items to the collection.",
    "1365": "Defeat General Graardor in hard mode. (X/5)",
    "1366": "Defeat General Graardor in hard mode. (X/10)",
    "1367": "Defeat General Graardor in hard mode. (X/25)",
    "1368": "Defeat General Graardor in hard mode. (X/50)",
    "1369": "Defeat General Graardor in hard mode. (X/75)",
    "1370": "Defeat General Graardor in hard mode. (X/100)",
    "1371": "Defeat General Graardor. (X/1)",
    "1372": "Defeat General Graardor in hard mode, solo, in less than 00:45.",
    "1373": "Defeat General Graardor in hard mode, solo, in less than 00:24.",
    "1374": "Defeat General Graardor solo in less than 00:42.",
    "1375": "Defeat General Graardor solo in less than 00:15.",
    "1376": "Defeat General Graardor. (X/5)",
    "1377": "Defeat General Graardor. (X/10)",
    "1378": "Defeat General Graardor. (X/25)",
    "1379": "Defeat General Graardor. (X/50)",
    "1380": "Defeat General Graardor. (X/75)",
    "1381": "Defeat General Graardor. (X/100)",
    "1382": "Defeat General Graardor solo, while all of his bodyguards remain dead.",
    "1383": "Contribute all items to the collection.",
    "1384": "Contribute all items to the collection.",
    "1385": "Contribute all items to the collection.",
    "1386": "Complete this miniquest.",
    "1387": "Complete this quest.",
    "1388": "Use Forceful Backhand against a black hand during the Black Stone Dragon fight.",
    "1389": "Defeat the Crassian Leviathan after taking at least 30,000 damage from its sweep attack.",
    "1390": "Make a bouldabass & edicap potato from the raw ingredients and eat it in a boss fight.",
    "1391": "Fill up your tool belt.",
    "1392": "Defeat Vermyx, Brood Mother in hard mode. (X/5)",
    "1393": "Defeat Vermyx, Brood Mother in hard mode. (X/10)",
    "1394": "Defeat Vermyx, Brood Mother in hard mode. (X/25)",
    "1395": "Defeat Vermyx, Brood Mother in hard mode. (X/50)",
    "1396": "Defeat Vermyx, Brood Mother in hard mode. (X/75)",
    "1397": "Defeat Vermyx, Brood Mother in hard mode. (X/100)",
    "1398": "Have a monkey minder put you in Ardougne Zoo's monkey cage.",
    "1399": "Defeat the Crassian Leviathan without anyone being hit by its 'Head Sweep' attack.",
    "1400": "Catch a ghostly impling while wearing a full set of ghostly robes.",
    "1401": "Talk to someone on the wrong line through the ouija board.",
    "1402": "Complete this quest.",
    "1403": "Complete this miniquest.",
    "1404": "Defeat the Giant Mole. (X/1)",
    "1405": "Defeat the Giant Mole in hard mode, solo, in less than 05:00.",
    "1406": "Defeat the Giant Mole in hard mode, solo, in less than 06:00.",
    "1407": "Defeat the Giant Mole solo in less than 04:00.",
    "1408": "Defeat the Giant Mole solo in less than 05:00.",
    "1409": "Attempt to use a cannon on Zolarea.",
    "1410": "Have Ashuelot Reis permanently open the doors to Nex for you.",
    "1411": "Complete all of the listed food-related achievements.",
    "1412": "Unlock Sliske's gift and the sixth-age circuit upgrade.",
    "1413": "Contribute all items to the collection.",
    "1414": "Unlock the Gladys pet from the Arch-Glacor.",
    "1415": "Purchase the full Globetrotter outfit.",
    "1416": "Complete this quest.",
    "1417": "Get the Corporeal Beast to devour a variety of delicious familiars. Can only be completed in a solo instance. (X/7)",
    "1418": "Use any alteration glyph in a ritual.",
    "1419": "Sample all of the listed Gnome dishes.",
    "1420": "Exit Tirannwn through the Galarpos Mountains.",
    "1421": "Create a vial of combat potion from scratch in Nardah after killing a goat from the desert. (X/6)",
    "1422": "Complete this quest.",
    "1423": "Smith a bronze dagger from scratch within the Warforge.",
    "1424": "Fully repair the statue of Het.",
    "1425": "Visit an ancient war, which became unfrozen after hundreds of years.",
    "1426": "Defeat the four Generals in the God Wars Dungeon.",
    "1427": "Pray at Lumbridge church's altar with the Mystic Might prayer enabled.",
    "1428": "Complete Arod's wildlife reserve on Mazcab.",
    "1429": "Find all Mazcab stone fragments and take them to the ancient statue.",
    "1430": "Talk to Party Pete in the Party Room.",
    "1431": "Let the ship take on 8 leaks before patching them up fully and successfully completing Fishing Trawler.",
    "1432": "Ride a waka canoe from Lumbridge to the Wilderness whilst wearing a straw boater.",
    "1433": "Sail from East Ardougne to Karamja.",
    "1434": "Use gold charms to create each of the listed summoning pouches.",
    "1435": "Harvest some golden roses from a flower bush.",
    "1436": "Mine some gold from the rocks on the north-west peninsula of Karamja.",
    "1437": "Non-ironman: | Go out fishing on the Fishing Trawler. | Ironman: | Attempt to board the Fishing Trawler.",
    "1438": "Defeat Durzag with all gongs repaired but un-used.",
    "1439": "Catch five sharks in Catherby.",
    "1440": "Cook five sharks on the range north of Catherby bank using the cooking gauntlets.",
    "1441": "Defeat Corporeal Beast using only a bronze spear. Can only be completed in a solo instance.",
    "1442": "Knockback a Laboratory Slime.",
    "1443": "Receive thanks from Gorvek after defeating Croesus. (X/1)",
    "1444": "Use a combat familiar to help fight a boss using their standard attacks.",
    "1445": "Defeat Nakatra, Devourer Eternal in hard mode after defeating both Shadowsands gorilla akhs.",
    "1446": "Unlock the Vyrelord/Vyrelady title and reach maximum vyre reputation in Darkmeyer.",
    "1447": "Complete a big game encounter without stepping into the creature's vision ring.",
    "1448": "Obtained a collection of all unique drops from easy clue scrolls.",
    "1449": "Find the hidden pets in Menaphos.",
    "1450": "Unlock double Surge and double Escape ability upgrades.",
    "1451": "Have something planted and living in every farming patch.",
    "1452": "Drink 10 bowls of goulash after 'Swept Away'.",
    "1453": "Complete this quest.",
    "1454": "Buy a candle from the candle-maker.",
    "1455": "Steal a fish from Rellekka's market.",
    "1456": "Learn how many beans make five (complete the Player Owned Farm tutorial).",
    "1457": "Gain max reputation with the Farming Guild.",
    "1458": "Collect all 11 pages of the 'Grave Records' in the Sanctum of Rebirth.",
    "1459": "Without teleporting or using third party travel methods, run from Camp Tyras to Castle Drakan.",
    "1460": "Have over 490,000 charges in a jumbo generator in the Invention Guild.",
    "1461": "Pickpocket the master farmer north of Ardougne.",
    "1462": "Defeat Solak, Guardian of the Grove after letting all spore bombs hit the ground during his 'Earthen Seed' attack.",
    "1463": "Unlock the Greg pet from Gregorovic in the Heart of Gielinor.",
    "1464": "Defeat Gregorovic in hard mode. (X/5)",
    "1465": "Defeat Gregorovic in hard mode. (X/10)",
    "1466": "Defeat Gregorovic in hard mode. (X/25)",
    "1467": "Defeat Gregorovic in hard mode. (X/50)",
    "1468": "Defeat Gregorovic in hard mode. (X/75)",
    "1469": "Defeat Gregorovic in hard mode. (X/100)",
    "1470": "Defeat Gregorovic. (X/5)",
    "1471": "Defeat Gregorovic. (X/10)",
    "1472": "Defeat Gregorovic. (X/25)",
    "1473": "Defeat Gregorovic. (X/50)",
    "1474": "Defeat Gregorovic. (X/75)",
    "1475": "Defeat Gregorovic. (X/100)",
    "1476": "Defeat Gregorovic. (X/1)",
    "1477": "Defeat Gregorovic in hard mode in less than 02:30.",
    "1478": "Defeat Gregorovic in hard mode in less than 01:48.",
    "1479": "Defeat Gregorovic solo in less than 02:00.",
    "1480": "Defeat Gregorovic solo in less than 01:09.",
    "1481": "Defeat every miniboss inside the Shadow Reef.",
    "1482": "Complete this quest.",
    "1483": "Grind some flour in Lumbridge's mill.",
    "1484": "Obtain Grondaban's stalker notes from the stalker dungeon.",
    "1485": "Slay an entire cohort of Zamorak's most powerful minions by killing 144 demons in the Wilderness. (X/144)",
    "1486": "Defeat a New Varrock guard.",
    "1487": "Obtained a collection of unique drops from Slayer monsters located within Asgarnia & Misthalin.",
    "1488": "Complete this miniquest.",
    "1489": "Kill the warped gulega, but avoid his 1 lifepoint attack in a solo dungeon.",
    "1490": "Cook both variations of soup from the Arc region.",
    "1491": "Complete this quest.",
    "1492": "Engrave all of Dororan's jewellery.",
    "1493": "Unlock the Guthan bobblehead from Rise of the Six.",
    "1494": "Learn about Guthix's core memories in the Hall of Memories.",
    "1495": "Participate in the culling of an evil tree.",
    "1496": "Hit the Crassian Leviathan using Ice Barrage.",
    "1497": "Speak to Horacio, the Duke of Lumbridge.",
    "1498": "Defeat two Kalphite Guardians whilst fighting Kalphite Queen and then defeat her. Can only be completed in a solo instance.",
    "1499": "Solve this mystery.",
    "1500": "Defeat Barrows: Rise of the Six without anyone being hit by Torag's 'Whack' attack.",
    "1501": "Pickpocket one of New Varrock's many zombie inhabitants.",
    "1502": "Defeat the Black Stone Dragon without anyone being hit by her 'Grasping Hands' attack.",
    "1503": "Defeat the Ambassador without allowing him to heal from his 'Circle of Black Hands' attack.",
    "1504": "Obtain a new set of Family Crest gauntlets from Dimintheis.",
    "1505": "Attempt to purchase four candles from a candle seller.",
    "1506": "Help out the partygoers on the roof of the Last Call.",
    "1507": "Give five locals a glass of cider in the Forester's Arms.",
    "1508": "Defeat the Ambassador without anyone taking any damage from his 'Black Stone Flames' attack.",
    "1509": "Defeat the Har-Aken. (X/1)",
    "1510": "Defeat the Har-Aken in less than 40:00.",
    "1511": "Defeat the Har-Aken in less than 30:00.",
    "1512": "Defeat the Crassian Leviathan after allowing it to fully regenerate from below half health.",
    "1513": "Complete this miniquest.",
    "1514": "Obtained a collection of unique drops from Vorago.",
    "1515": "Earn the right to wear the title 'of Daemonheim'.",
    "1516": "Obtained a collection of unique drops from hard clue scrolls.",
    "1517": "Complete a full lap of the Wilderness agility course.",
    "1518": "Defeat the Har-Aken. (X/5)",
    "1519": "Defeat the Har-Aken. (X/10)",
    "1520": "Defeat the Har-Aken. (X/25)",
    "1521": "Defeat the Har-Aken. (X/50)",
    "1522": "Defeat the Har-Aken. (X/75)",
    "1523": "Defeat the Har-Aken. (X/100)",
    "1524": "Capture a charming moth.",
    "1525": "Make harralander tar in the Poison Waste using tar sourced in Tirannwn.",
    "1526": "Unlock the ability to trade noted artefacts with Simon Templeton.",
    "1527": "Complete this quest.",
    "1528": "Cook a chocolate cake from scratch in Lumbridge Castle's kitchen. (X/3)",
    "1529": "Complete this quest.",
    "1530": "Give a blueberry pie to Thalmund in the City of Um.",
    "1531": "Complete this miniquest.",
    "1532": "Defeat TzTok-Jad without killing any Yt-HurKot.",
    "1533": "Unlock the prayer 'Rapid Renewal' by purchasing the scroll of renewal from the Dungeoneering reward shop.",
    "1534": "Defeat Nakatra, Devourer Eternal in hard mode without letting her heal Nefthys, the Split Soul.",
    "1535": "Use the Rapid Renewal prayer for 1 minute within a dungeon.",
    "1536": "Defeat Vermyx, Brood Mother without letting any Corrupted scarab healer reach her.",
    "1537": "Defeat Nex solo, after allowing her to fully heal during her Blood phase.",
    "1538": "Defeat the four Generals in the Heart of Gielinor. (X/4)",
    "1539": "Complete this quest.",
    "1540": "Solve this mystery.",
    "1541": "Obtained a collection of unique drops from the Twin Furies.",
    "1542": "Complete this quest.",
    "1543": "Pray at the Elidinis statuette in Nardah.",
    "1544": "Defeat Zemouregal & Vorkath in hard mode without using any form of dragonfire protection.",
    "1545": "Obtain all the entries of Boric's Book of Metal by mining the listed ores or catalysts. (X/9)",
    "1546": "Take a shortcut on the Hefin Agility Course.",
    "1547": "Defeat Helwyr in hard mode. (X/5)",
    "1548": "Defeat Helwyr in hard mode. (X/10)",
    "1549": "Defeat Helwyr in hard mode. (X/25)",
    "1550": "Defeat Helwyr in hard mode. (X/50)",
    "1551": "Defeat Helwyr in hard mode. (X/75)",
    "1552": "Defeat Helwyr in hard mode. (X/100)",
    "1553": "Complete this miniquest.",
    "1554": "Defeat Helwyr. (X/1)",
    "1555": "Defeat Helwyr in hard mode in less than 02:30.",
    "1556": "Defeat Helwyr in hard mode in less than 01:30.",
    "1557": "Defeat Helwyr solo in less than 02:00.",
    "1558": "Defeat Helwyr solo in less than 00:45.",
    "1559": "Complete a Seren symbol.",
    "1560": "Claim a herald cape from the herald of Lumbridge.",
    "1561": "Harvest each of the listed herbs.",
    "1562": "Give Herbi Flax's diary to the Varrock apothecary.",
    "1563": "Unlock the Herblore pet.",
    "1564": "Reach level 5 in the Herblore skill.",
    "1565": "Reach level 10 in the Herblore skill.",
    "1566": "Reach level 20 in the Herblore skill.",
    "1567": "Reach level 30 in the Herblore skill.",
    "1568": "Reach level 40 in the Herblore skill.",
    "1569": "Reach level 50 in the Herblore skill.",
    "1570": "Reach level 60 in the Herblore skill.",
    "1571": "Reach level 70 in the Herblore skill.",
    "1572": "Reach level 80 in the Herblore skill.",
    "1573": "Reach level 90 in the Herblore skill.",
    "1574": "Reach level 92 in the Herblore skill.",
    "1575": "Reach level 99 in the Herblore skill.",
    "1576": "Reach level 110 in the Herblore skill.",
    "1577": "Reach level 113 in the Herblore skill.",
    "1578": "Reach level 120 in the Herblore skill.",
    "1579": "Defeat the Sanctum Guardian after being hit by her 'Water Spout' 10 times.",
    "1580": "Defeat the Sanctum Guardian without anyone being hit by her 'Water Spout' attack.",
    "1581": "Equip a Corrupted Slayer Helmet, upgraded with an ensouled spectral lens.",
    "1582": "Gain access to the secret treasure room from 'Diamond in the Rough'.",
    "1583": "Defeat Vorago in hard mode. (X/5)",
    "1584": "Defeat Vorago in hard mode. (X/10)",
    "1585": "Defeat Vorago in hard mode. (X/25)",
    "1586": "Defeat Vorago in hard mode. (X/50)",
    "1587": "Defeat Vorago in hard mode. (X/75)",
    "1588": "Defeat Vorago in hard mode. (X/100)",
    "1589": "Unlock the Herman pet from Hermod, the Spirit of War.",
    "1590": "Defeat Hermod, the Spirit of War solo in less than 03:15.",
    "1591": "Defeat Hermod, the Spirit of War solo in less than 00:45.",
    "1592": "Defeat Hermod, the Spirit of War. (X/1)",
    "1593": "Complete this miniquest.",
    "1594": "Complete all of the listed Beastmaster Durzag and Yakamaru achievements.",
    "1595": "Complete this quest.",
    "1596": "Find and read all four books about the heroes buried in Senntisten graveyard.",
    "1597": "Complete this quest.",
    "1598": "Acquire 100% sprite focus five times without losing focus of the time sprite.",
    "1599": "Mine some silver from the mining spot north of Al Kharid.",
    "1600": "Tan a zombie cowhide.",
    "1601": "Enter the Wilderness by any means.",
    "1602": "Find all Chronicles of Bilrach.",
    "1603": "Defeat the Black Stone Dragon without anyone being hit by her 'Gemstone Shards' attack.",
    "1604": "Defeat Vorago without allowing him to move forward in stage 5.",
    "1605": "View your bank in the Wilderness via one of the Wilderness cape sellers.",
    "1606": "Defeat Seiryu without anyone being hit by his 'Grasping Hands' attack.",
    "1607": "Complete this quest.",
    "1608": "Build your Player Lodge on Anachronia.",
    "1609": "Convince Armadyl to visit Stormguard.",
    "1610": "Remove pure or impure essence from a giant pouch at Ourania Altar.",
    "1611": "Feed one of each honeycomb to any animal on your farm. (X/10)",
    "1612": "Successfully breed a royal dragon.",
    "1613": "Craft all of Kili's equipment upgrades.",
    "1614": "Have Bal'Lak the Pummeller walk onto his own rifts in a solo dungeon.",
    "1615": "Complete this miniquest.",
    "1616": "Complete this quest.",
    "1617": "Use Vigroy and Hajedy's cart service.",
    "1618": "Smith an item that requires at least 60 Smithing without letting heat fall below high heat.",
    "1619": "Fire a pot in a pottery oven.",
    "1620": "Complete this quest.",
    "1621": "Defeat Vorago without anyone clearing his 'Destroy Tank' ability.",
    "1622": "Use a Greater Demon Mask on the Denizen of Infernus.",
    "1623": "Talk to one of the ghostly inhabitants of Kharid-et while wearing a full set of ghostly equipment.",
    "1624": "Show a full set of profound armour to Lanthus.",
    "1625": "Kill a mithril dragon.",
    "1626": "Obtained a collection of unique drops from the King Black Dragon.",
    "1627": "Solve this mystery.",
    "1628": "Attune your house portal to Kharyrll, or use yours if it has already been attuned.",
    "1629": "Defeat Nex, Angel of Death in a team of 7 or fewer without anyone damaging any of the blood reavers.",
    "1630": "Complete this quest.",
    "1631": "Complete this miniquest.",
    "1632": "Unlock the Hunter pet.",
    "1633": "Reach level 5 in the Hunter skill.",
    "1634": "Reach level 10 in the Hunter skill.",
    "1635": "Reach level 20 in the Hunter skill.",
    "1636": "Reach level 30 in the Hunter skill.",
    "1637": "Reach level 40 in the Hunter skill.",
    "1638": "Reach level 50 in the Hunter skill.",
    "1639": "Reach level 60 in the Hunter skill.",
    "1640": "Reach level 70 in the hunter skill.",
    "1641": "Reach level 80 in the Hunter skill.",
    "1642": "Reach level 90 in the Hunter skill.",
    "1643": "Reach level 92 in the Hunter skill.",
    "1644": "Reach level 99 in the Hunter skill.",
    "1645": "Reach virtual level 110 in the Hunter skill.",
    "1646": "Reach virtual level 120 in the Hunter skill.",
    "1647": "Trap a horned graahk.",
    "1648": "Find the hunting expert on the northern ice plains.",
    "1649": "Defeat the Crassian Leviathan without ever being stunned.",
    "1650": "Solve this mystery.",
    "1651": "Try to repower the war golem arm at Stormguard.",
    "1652": "Equip one item from a set of Barrows gear in the Barrows.",
    "1653": "Find 12 penguin spies and the polar bear in a single week and report your findings.",
    "1654": "Defeat any of the Rex Matriarchs. (X/5)",
    "1655": "Defeat any of the Rex Matriarchs. (X/10)",
    "1656": "Defeat any of the Rex Matriarchs. (X/25)",
    "1657": "Defeat any of the Rex Matriarchs. (X/50)",
    "1658": "Defeat any of the Rex Matriarchs. (X/75)",
    "1659": "Defeat any of the Rex Matriarchs. (X/100)",
    "1660": "Defeat the Magister after becoming 50% corrupted.",
    "1661": "Unlock all beacon keepers and fully unlock the beacon map.",
    "1662": "Use a telescope on Zolarea.",
    "1663": "Find the highest point in Seers' Village.",
    "1664": "Get a replacement amulet of ghostspeak from Father Urhney.",
    "1665": "Sample all of the listed stroopwafel flavours.",
    "1666": "Unlock Dig Site pendants.",
    "1667": "Defeat each of the six Legiones consecutively without leaving the Ascension dungeon.",
    "1668": "Clean up after cows 20 times. (X/20)",
    "1669": "Dial to the fairy ring on Mudskipper Point.",
    "1670": "Defeat Rasial, the First Necromancer without being hit by his 'Ghost Wall' attack.",
    "1671": "Craft some runes at Ourania Altar.",
    "1672": "Attempt to use the special dragonfire attack from a dragonfire shield on a dragon.",
    "1673": "Obtain personal stories from Edgeville regarding the destruction after 'The Ritual of the Mahjarrat'.",
    "1674": "Defeat the Twin Furies in hard mode, solo, after dealing damage to the Twin Furies using their 'Blue Lava Bomb' attack.",
    "1675": "Attempt to spectate on a match at the Dominion Tower.",
    "1676": "Cap out on red and crystal sandstone in a day. (Oo'glog, Sophanem, Ithell, Meilyr)",
    "1677": "Use a ritual dagger on the sacrificial altar in the Order of Dis cult area while wearing a full set of Dagon'hai robes.",
    "1678": "Surge a distance of one tile.",
    "1679": "Claim all rewards from the statue of Death after 'Missing, Presumed Death'.",
    "1680": "Get called a monster while trying to disassemble a living creature.",
    "1681": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage after killing the incorrect rune in phase 7 without anyone dying.",
    "1682": "Defeat TzTok-Jad after using the correct protection prayer against all of his basic attacks.",
    "1683": "Defeat TzKal-Zuk in hard mode in a single run without being hit by his 'Igneous Rain' attack.",
    "1684": "Cut a log from a mahogany tree.",
    "1685": "Chop down a magic tree grown in your tree patch in Falador Park.",
    "1686": "Defeat the Magister after hitting him with his 'Unstable Mixture' attack.",
    "1687": "Fish for all of the peas in Paddlington after 'Duck Quest'.",
    "1688": "Gain the Beast Mode title on a complexity 6 floor solo.",
    "1689": "Defeat Nex, Angel of Death in a team of 7 or fewer after defeating each of Nex's mages in phase 4.",
    "1690": "Defeat Pthentraken solo without being hit by her 'Converging Lightning' attack.",
    "1691": "Explore the tunnel from the cellar under the Hair of the Dog.",
    "1692": "Defeat Vorago after activating all of the magic and explosive bombs during the 'The End' stage.",
    "1693": "Teleport to the Wilderness using the lever in Ardougne.",
    "1694": "Eat an oomlie wrap.",
    "1695": "Use Pulverise on Masuta the Ascended at the same time he uses it.",
    "1696": "Cut a log from a teak tree.",
    "1697": "Defeat Amascut, the Devourer in enrage mode. (X/5)",
    "1698": "Defeat Amascut, the Devourer in enrage mode. (X/10)",
    "1699": "Defeat Amascut, the Devourer in enrage mode. (X/25)",
    "1700": "Defeat Amascut, the Devourer in enrage mode. (X/50)",
    "1701": "Defeat Amascut, the Devourer in enrage mode. (X/75)",
    "1702": "Defeat Amascut, the Devourer in enrage mode. (X/100)",
    "1703": "Aid Lord Amlodd in cleansing shadow cores.",
    "1704": "Use the rope swing to travel to the moss giant island north-west of Karamja.",
    "1705": "Dispel any ritual disturbance while performing a Necromancy ritual.",
    "1706": "In Nardah, make a super antifire flask - making both the flask and potion from scratch.",
    "1707": "Non-ironman: | Defeat the King Black Dragon with the Wilderness entrance's buff, dealing the most damage. | Ironman: | Defeat an instanced King Black Dragon after entering via the Wilderness artefact.",
    "1708": "Defeat Masuta the Descended while wielding Masuta's warspear.",
    "1709": "Defeat Orikalka solo after reducing the effects of her 'Frostbite' attack using 'Pyroclastic Shock'.",
    "1710": "Defeat Zemouregal & Vorkath in hard mode without allowing Zemouregal to stun you.",
    "1711": "Use a summoned hydra to regrow a tree in your patch in Falador Park.",
    "1712": "Complete all miniquests listed in the Quests interface. Does not include sagas.",
    "1713": "Cast the Superheat spell whilst helping out the mages defend against the Arch-Glacor.",
    "1714": "Defeat Quetzathog while wearing a black mask.",
    "1715": "Pickpocket a rogue in Rogues' Castle.",
    "1716": "Kill a disciple of Iban while using Iban's staff.",
    "1717": "Fly beyond the limits of Stormguard.",
    "1718": "Complete 25 chimp ice deliveries.",
    "1719": "Kill an ice giant in the Asgarnian Ice Dungeon.",
    "1720": "Freeze an enemy in the desert with Ice Burst.",
    "1721": "Loot the chest from the pyramid during or after 'Icthlarin's Little Helper'.",
    "1722": "Complete this quest.",
    "1723": "Defeat Nex, Angel of Death in a team of 7 or fewer without anyone taking damage from her 'Icicle Slam' attack.",
    "1724": "Defeat Kerapac, the bound in hard mode without using the 'Warp Time' action ability.",
    "1725": "Defeat Kerapac, the bound without using the 'Warp Time' action ability.",
    "1726": "Kill anything on the ground floor of the Slayer Tower.",
    "1727": "Upgrade a set of Deathwarden equipment to tier 70 Deathdealer equipment.",
    "1728": "Upgrade a set of Deathdealer equipment to tier 80.",
    "1729": "Upgrade a set of Deathdealer equipment to tier 90.",
    "1730": "Use blue charms to create each of the listed summoning pouches.",
    "1731": "Work with Thurgo (south of Port Sarim) to obtain an Imcando hatchet.",
    "1732": "Work with Thurgo (south of Port Sarim) to obtain an Imcando pickaxe.",
    "1733": "Heat a pair of unfinished elder rune boots to 100% heat using only the superheat item spell.",
    "1734": "Complete this quest.",
    "1735": "Collect one of each impling for Daffyd in Prifddinas.",
    "1736": "Create Char's most treasured symbol in her training cave.",
    "1737": "Complete this quest.",
    "1738": "Complete the Anachronia agility course in under 7 minutes.",
    "1739": "Talk to Pickle the cat once his kill count has hit double figures.",
    "1740": "Defeat Amascut, the Devourer in enrage mode without anyone defeating any Modest crocodile demons.",
    "1741": "Complete this quest.",
    "1742": "Defeat Kezalam, the Wanderer without being hit by her 'Sanctum Blast' attack.",
    "1743": "Complete a big game encounter without using movement abilities.",
    "1744": "Complete this miniquest.",
    "1745": "Complete this quest.",
    "1746": "Perform every core ritual.",
    "1747": "Complete this quest.",
    "1748": "Enter the courtyard of Draynor Mansion.",
    "1749": "Wear 4 bound items.",
    "1750": "Defeat Amascut, the Devourer at 1000% or higher enrage after depositing each of Tumeken's fragments when Amascut has less than 3 seconds until she uses her 'Devourer's Destruction' attack.",
    "1751": "Defeat Gregorovic solo without dealing any damage to his spirits.",
    "1752": "Defeat Raksha without activating 'Inner power'. Can only be completed in a solo instance.",
    "1753": "Obtained a collection of all unique drops from Nex, Angel of Death.",
    "1754": "Get Final Boss achievement, all boss pets and kill each boss in Hard mode 100 times. (X/85)",
    "1755": "Defeat the Ambassador without anyone allowing any of his unstable black holes to explode.",
    "1756": "Defeat the Ambassador after surviving explosions from 4 unstable black holes.",
    "1757": "Use the skull sceptre to teleport to Barbarian Village.",
    "1758": "Solve this mystery.",
    "1759": "Unlock the Invention pet.",
    "1760": "Reach level 5 in the Invention skill.",
    "1761": "Reach level 10 in the Invention skill.",
    "1762": "Reach level 20 in the Invention skill.",
    "1763": "Reach level 30 in the Invention skill.",
    "1764": "Reach level 40 in the Invention skill.",
    "1765": "Reach level 50 in the Invention skill.",
    "1766": "Reach level 60 in the Invention skill.",
    "1767": "Reach level 70 in the Invention skill.",
    "1768": "Reach level 80 in the Invention skill.",
    "1769": "Reach level 84 in the Invention skill.",
    "1770": "Reach level 90 in the Invention skill.",
    "1771": "Reach level 99 in the Invention skill.",
    "1772": "Reach level 102 in the Invention skill.",
    "1773": "Reach level 110 in the Invention skill.",
    "1774": "Reach level 120 in the Invention skill.",
    "1775": "Purchase all of the blueprints for the Invention Technology devices.",
    "1776": "Use a ring of kinship on a fire within a dungeon.",
    "1777": "Mine iron ore from the mining site south-west of Lumbridge Swamp.",
    "1778": "Return Bob's collar to him during or after 'Ritual of the Mahjarrat'.",
    "1779": "Crawl under Falador's south wall.",
    "1780": "Use the NPC Contact lunar spell to talk to someone on the toilet.",
    "1781": "Contribute all items to the collection.",
    "1782": "Contribute all items to the collection.",
    "1783": "Contribute all items to the collection.",
    "1784": "Contribute all items to the collection.",
    "1785": "Defeat Hanto while it is at least 4 tiles away from where it started.",
    "1786": "Use the grapple shortcut to get from the water obelisk island to Catherby beach.",
    "1787": "Plant some morchella mushrooms in the City of Um.",
    "1788": "Incinerate a log with your inferno adze, by cutting a tree in the Varrock Palace farming patch.",
    "1789": "Speak to Haig Halen after obtaining at least 50 Kudos.",
    "1790": "Kill a frogeel in the Tower of Life.",
    "1791": "Dye a cape pink using dye from Betty in Port Sarim.",
    "1792": "Unlock the ability to smith masterwork armour by making and upgrading to +5 a full set of elder rune armour.",
    "1793": "Unlock the ability to craft masterwork magic armour by making and upgrading to +5 a full set of starbloom armour. (X/5)",
    "1794": "Cut down a yew or magic tree that you grew in Falador Park.",
    "1795": "Unlock the ability to smith masterwork swords by making and upgrading to +5 a full set of primal armour.",
    "1796": "Cut down a tree in Lumbridge Swamp.",
    "1797": "Kill a jogre in the Pothole dungeon.",
    "1798": "Talk to Thormac the sorcerer about making mystic staves.",
    "1799": "Buy a snapdragon from Pirate Jackie the Fruit and create a super restore potion in Brimhaven.",
    "1800": "Make an admiral pie from scratch within Seers' Village/Catherby.",
    "1801": "Defeat Nakatra, Devourer Eternal without being sent to the Shadowsands more than once.",
    "1802": "Non-ironman: | Complete a dungeon in a team of more than 1. | Ironman: | Complete a medium, complexity 6 dungeon.",
    "1803": "Mine 200 stardust from a shooting star.",
    "1804": "Mine one of each of the listed ores.",
    "1805": "Catch a red salamander from the Hunter area outside of Ourania Altar.",
    "1806": "Complete all objectives solo in Shifting Tombs without using Surge, Escape or Bladed Dive.",
    "1807": "Kill a duck in Falador Park.",
    "1808": "Increase your reputation with the White Knights by killing a Black Knight.",
    "1809": "Teleport to Camelot.",
    "1810": "Cook a thin snail in Morytania.",
    "1811": "Kill Smoulders whilst using a waterfiend familiar.",
    "1812": "Create all 6 illuminated God Books after 'One Piercing Note'.",
    "1813": "Defeat the Magister without being hit by his 'Unstable Mixture' attack.",
    "1814": "Defeat Vorago without anyone moving during the 'Scopulus' stage once the Scopulus have spawned.",
    "1815": "Unlock the full power of the ivandis flail by burning vyre corpses in the Columbarium. (X/500)",
    "1816": "Trap a green salamander in the Haunted Woods.",
    "1817": "Collect all combat skilling pets. (X/10)",
    "1818": "Do a bit of everything in Menaphos and claim the cape of the palapa from Urluk.",
    "1819": "Collect all non-combat skilling pets. (X/19)",
    "1820": "Collect 3 combat skilling pets.",
    "1821": "Obtain all circus clothing from Balthazar Beauregard's Big Top Bonanza.",
    "1822": "Collect 5 non-combat skilling pets.",
    "1823": "Have Elsie tell you a story.",
    "1824": "Catch each of the listed Jadinkos.",
    "1825": "Free each of the baby dinosaurs from the jail cells within the Rex Matriarch lair.",
    "1826": "Return to the Submerged Statue at Entrana after 'One of a Kind' and 'Ritual of the Mahjarrat'.",
    "1827": "Catch a shark with bare hands on Jatizso.",
    "1828": "Complete this miniquest.",
    "1829": "Complete the listed achievements to gain access to Group Ironman Storage.",
    "1830": "At least one player must have collected a set of ironman armour from the Iron Enclave.",
    "1831": "At least one player must complete the quest 'Cooks assistant'.",
    "1832": "Reach a group total level of 40 x group size. | Group size 2: Achieve 80 total level across the group. | Group size 3: Achieve 120 total level across the group. | Group size 4: Achieve 160 total level across the group. | Group size 5: Achieve 200 total level across the group.",
    "1833": "Complete the listed achievements.",
    "1834": "At least one player must complete the quest 'Restless ghost'",
    "1835": "At least one player must complete the achievement 'The Provider of Misthalin'",
    "1836": "At least one player must complete the achievement 'The Scourge of Misthalin'",
    "1837": "Reach a group total level of 50 x group size. | Group size 2: Achieve 100 total level across the group. | Group size 3: Achieve 150 total level across the group. | Group size 4: Achieve 200 total level across the group. | Group size 5: Achieve 250 total level across the group.",
    "1838": "Reach a group total Quest Points of 5 x group size. | Group size 2: Achieve 10 total Quest Points across the group. | Group size 3: Achieve 15 total Quest Points across the group. | Group size 4: Achieve 20 total Quest Points across the group. | Group size 5: Achieve 25 total Quest Points across the group.",
    "1839": "Complete the listed achievements.",
    "1840": "At least one player must complete the achievement 'Lumbridge Set Tasks - Easy'",
    "1841": "At least one player must complete the quest 'Priest in Peril'",
    "1842": "At least one player must complete the achievement 'Slayer 10'",
    "1843": "Reach a group total level of 200 x group size. | Group size 2: Achieve 400 total level across the group. | Group size 3: Achieve 600 total level across the group. | Group size 4: Achieve 800 total level across the group. | Group size 5: Achieve 1,000 total level across the group.",
    "1844": "Reach a group total Quest Points of 20 x group size. | Group size 2: Achieve 40 total Quest Points across the group. | Group size 3: Achieve 60 total Quest Points across the group. | Group size 4: Achieve 80 total Quest Points across the group. | Group size 5: Achieve 100 total Quest Points across the group.",
    "1845": "Complete the listed achievements.",
    "1846": "At least one player must complete the quest 'Dragon Slayer'",
    "1847": "At least one player must complete the quest 'Icthlarin's Little Helper'",
    "1848": "At least one player must complete the achievement 'Novice Provisions Officer'",
    "1849": "Reach a group total level of 500 x group size. | Group size 2: Achieve 1,000 total level across the group. | Group size 3: Achieve 1,500 total level across the group. | Group size 4: Achieve 2,000 total level across the group. | Group size 5: Achieve 2,500 total level across the group.",
    "1850": "Reach a group total Quest Points of 40 x group size. | Group size 2: Achieve 80 total Quest Points across the group. | Group size 3: Achieve 120 total Quest Points across the group. | Group size 4: Achieve 160 total Quest Points across the group. | Group size 5: Achieve 200 total Quest Points across the group.",
    "1851": "At least one player must complete the achievement 'Wonderful Walls'",
    "1852": "Complete the listed achievements.",
    "1853": "At least one player must complete the achievement 'Ardougne Set Tasks - Easy'",
    "1854": "At least one player must complete the achievement 'Beginner Provisions Officer'",
    "1855": "At least one player must complete the achievement 'King Black Dragon'",
    "1856": "At least one player must complete the quest 'One Small Favour'",
    "1857": "Reach a group total level of 1,000 x group size. | Group size 2: Achieve 2,000 total level across the group. | Group size 3: Achieve 3,000 total level across the group. | Group size 4: Achieve 4,000 total level across the group. | Group size 5: Achieve 5,000 total level across the group.",
    "1858": "Reach a group total Quest Points of 80 x group size. | Group size 2: Achieve 160 total Quest Points across the group. | Group size 3: Achieve 240 total Quest Points across the group. | Group size 4: Achieve 320 total Quest Points across the group. | Group size 5: Achieve 400 total Quest Points across the group.",
    "1859": "Complete the listed achievements.",
    "1860": "At least one player must complete the achievement 'Competent Provisions Officer'",
    "1861": "At least one player must complete the quest 'Desert Treasure'",
    "1862": "At least one player must complete the achievement 'Kalphite Queen'",
    "1863": "At least one player must complete the achievement 'Morytania Set Tasks - Easy'",
    "1864": "Reach a group total level of 1,400 x group size. | Group size 2: Achieve 2,800 total level across the group. | Group size 3: Achieve 4,200 total level across the group. | Group size 4: Achieve 5,600 total level across the group. | Group size 5: Achieve 7,000 total level across the group.",
    "1865": "Reach a group total Quest Points of 120 x group size. | Group size 2: Achieve 240 total Quest Points across the group. | Group size 3: Achieve 360 total Quest Points across the group. | Group size 4: Achieve 480 total Quest Points across the group. | Group size 5: Achieve 600 total Quest Points across the group.",
    "1866": "Complete the listed achievements.",
    "1867": "At least one player must complete the achievement 'Desert Set Tasks - Medium'",
    "1868": "At least one player must complete the achievement 'God Wars Dungeon'",
    "1869": "At least one player must complete the achievement 'Proficient Provisions Officer'",
    "1870": "At least one player must complete the quest 'The Path of Glouphrie'",
    "1871": "Reach a group total level of 1,800 x group size. | Group size 2: Achieve 3,600 total level across the group. | Group size 3: Achieve 5,400 total level across the group. | Group size 4: Achieve 7,200 total level across the group. | Group size 5: Achieve 9,000 total level across the group.",
    "1872": "Reach a group total Quest Points of 160 x group size. | Group size 2: Achieve 320 total Quest Points across the group. | Group size 3: Achieve 480 total Quest Points across the group. | Group size 4: Achieve 640 total Quest Points across the group. | Group size 5: Achieve 800 total Quest Points across the group.",
    "1873": "Complete the listed achievements.",
    "1874": "At least one player must complete the achievement 'Falador Set Tasks - Hard'",
    "1875": "At least one player must complete the quest 'Recipe for Disaster'",
    "1876": "At least one player must complete the achievement 'Seeing Lava'",
    "1877": "Reach a group total level of 2,000 x group size. | Group size 2: Achieve 4,000 total level across the group. | Group size 3: Achieve 6,000 total level across the group. | Group size 4: Achieve 8,000 total level across the group. | Group size 5: Achieve 10,000 total level across the group.",
    "1878": "Reach a group total Quest Points of 200 x group size. | Group size 2: Achieve 400 total Quest Points across the group. | Group size 3: Achieve 600 total Quest Points across the group. | Group size 4: Achieve 800 total Quest Points across the group. | Group size 5: Achieve 1,000 total Quest Points across the group.",
    "1879": "Complete the listed achievements.",
    "1880": "At least one player must complete the achievement 'Daemonheim Set Tasks - Hard'",
    "1881": "At least one player must complete the quest 'Do No Evil'",
    "1882": "At least one player must complete the achievement 'Expert Provisions Officer'",
    "1883": "At least one player must complete the achievement 'Heart of Gielinor'",
    "1884": "Reach a group total level of 2,150 x group size. | Group size 2: Achieve 4,300 total level across the group. | Group size 3: Achieve 6,450 total level across the group. | Group size 4: Achieve 8,600 total level across the group. | Group size 5: Achieve 10,750 total level across the group.",
    "1885": "Reach a group total Quest Points of 250 x group size. | Group size 2: Achieve 500 total Quest Points across the group. | Group size 3: Achieve 750 total Quest Points across the group. | Group size 4: Achieve 1,000 total Quest Points across the group. | Group size 5: Achieve 1,250 total Quest Points across the group.",
    "1886": "Complete the listed achievements.",
    "1887": "At least one player must complete the achievement 'Araxxi'",
    "1888": "At least one player must complete the quest 'Ritual of the Mahjarrat'",
    "1889": "At least one player must complete the achievement 'Tirannwn Set Tasks - Hard'",
    "1890": "Reach a group total level of 2,300 x group size. | Group size 2: Achieve 4,600 total level across the group. | Group size 3: Achieve 6,900 total level across the group. | Group size 4: Achieve 9,200 total level across the group. | Group size 5: Achieve 11,500 total level across the group.",
    "1891": "Reach a group total Quest Points of 300 x group size. | Group size 2: Achieve 600 total Quest Points across the group. | Group size 3: Achieve 900 total Quest Points across the group. | Group size 4: Achieve 1,200 total Quest Points across the group. | Group size 5: Achieve 1,500 total Quest Points across the group.",
    "1892": "Complete the listed achievements.",
    "1893": "At least one player must complete the achievement 'Fremennik Set Tasks - Elite'",
    "1894": "At least one player must complete the achievement 'Master Provisions Officer'",
    "1895": "At least one player must complete the quest 'Sliske's Endgame'",
    "1896": "At least one player must complete the achievement 'Telos If You're Angry II'",
    "1897": "Reach a group total level of 2,500 x group size. | Group size 2: Achieve 5,000 total level across the group. | Group size 3: Achieve 7,500 total level across the group. | Group size 4: Achieve 10,000 total level across the group. | Group size 5: Achieve 12,500 total level across the group.",
    "1898": "Reach a group total Quest Points of 375 x group size. | Group size 2: Achieve 750 total Quest Points across the group. | Group size 3: Achieve 1,125 total Quest Points across the group. | Group size 4: Achieve 1,500 total Quest Points across the group. | Group size 5: Achieve 1,875 total Quest Points across the group.",
    "1899": "Enter the Earth Altar using an earth tiara or talisman.",
    "1900": "Defeat Raksha, the Shadow Colossus. (X/5)",
    "1901": "Defeat Raksha, the Shadow Colossus. (X/10)",
    "1902": "Defeat Raksha, the Shadow Colossus. (X/25)",
    "1903": "Defeat Raksha, the Shadow Colossus. (X/50)",
    "1904": "Defeat Raksha, the Shadow Colossus. (X/75)",
    "1905": "Defeat Raksha, the Shadow Colossus. (X/100)",
    "1906": "Jump over the fence south of Varrock.",
    "1907": "Complete this quest.",
    "1908": "Obtained a collection of unique drops from Slayer monsters located within Karamja.",
    "1909": "Discover all the totem pieces on Anachronia.",
    "1910": "Make some soft clay.",
    "1911": "Create a sign.",
    "1912": "Defeat Rasial, the First Necromancer without being hit by his 'Finger of Death' attack in phase 4.",
    "1913": "Enter the Magic Guild in Yanille.",
    "1914": "Use a Columbarium key to unlock an alcove.",
    "1915": "Cast the Bones to peaches spell on some bones within Senntisten.",
    "1916": "Claim a ticket from Brimhaven Agility Arena.",
    "1917": "Plant some jute.",
    "1918": "Unlock the K'ril Tinyroth pet from K'ril Tsutsaroth in the God Wars Dungeon.",
    "1919": "Defeat K'ril Tsutsaroth. (X/1)",
    "1920": "Defeat K'ril Tsutsaroth in hard mode, solo, in less than 00:45.",
    "1921": "Defeat K'ril Tsutsaroth in hard mode, solo, in less than 00:27.",
    "1922": "Defeat K'ril Tsutsaroth solo in less than 00:45.",
    "1923": "Defeat K'ril Tsutsaroth solo in less than 00:24.",
    "1924": "Defeat K'ril after he slams through your prayers 3 times. Can only be completed in a solo instance.",
    "1925": "Defeat K'ril with a willow weapon. Can only be completed in a solo instance.",
    "1926": "Complete Kaigi's journal.",
    "1927": "Unlock the Kal'gerion battle commendation titles.",
    "1928": "Find all Kal'gerion notes.",
    "1929": "Unlock the Kalphite Grublet pet from the Kalphite Queen.",
    "1930": "Unlock the Kalphite Grublet (Flying) pet from the Kalphite Queen.",
    "1931": "Unlock the Kalphite Grubling pet from the Kalphite King.",
    "1932": "Defeat the Kalphite King. (X/1)",
    "1933": "Defeat the Kalphite King solo.",
    "1934": "Defeat the Kalphite King in a team of 2 or fewer in less than 01:00.",
    "1935": "Defeat the Kalphite King in a team of 2 or fewer in less than 00:30.",
    "1936": "Defeat the Kalphite Queen. (X/1)",
    "1937": "Defeat Kalphite Queen solo in less than 01:30.",
    "1938": "Defeat the Kalphite Queen solo in less than 02:30.",
    "1939": "Discover all the Arc kami spirits.",
    "1940": "Activate the lodestone on Karamja.",
    "1941": "Given by Pirate Jackie the Fruit outside Brimhaven Agility Arena for completing all Easy Tasks in Karamja.",
    "1942": "Given by any jungle forester north of Kharazi Jungle for completing all Elite Tasks in Karamja.",
    "1943": "Given by any jungle forester north of Kharazi Jungle for completing all Hard Tasks in Karamja.",
    "1944": "Given by Kaleb Paramaya in Shilo Village for completing all Medium Tasks in Karamja.",
    "1945": "Unlock the Karil bobblehead from Rise of the Six.",
    "1946": "Defeat the Ambassador after placing all of his 'Black Stone Flames' attack in a single location.",
    "1947": "Obtained a collection of unique drops from Commander Zilyana.",
    "1948": "Defeat Solak, Guardian of the Grove while his remaining conscience within his mind has at least 50% life points remaining.",
    "1949": "Make a Varrock Teleport tablet on a mahogany lectern.",
    "1950": "Claim and use 8 experience lamps from Philipe Carnillean. (X/16)",
    "1951": "Complete this quest.",
    "1952": "Defeat Kerapac, the bound in hard mode, solo, in less than 06:00.",
    "1953": "Defeat Kerapac, the bound in hard mode, solo, in less than 02:15.",
    "1954": "Defeat Kerapac, the bound in hard mode, solo, in less than 03:00.",
    "1955": "Defeat Kerapac, the bound solo in less than 03:00.",
    "1956": "Defeat Kerapac, the bound solo in less than 01:30.",
    "1957": "Defeat Kerapac, the bound. (X/1)",
    "1958": "Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements.",
    "1959": "Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements.",
    "1960": "Unlock the Kerry pet from Kerapac.",
    "1961": "Defeat Kezalam, the Wanderer in hard mode in less than 04:00.",
    "1962": "Defeat Kezalam, the Wanderer in hard mode in less than 02:00.",
    "1963": "Defeat Kezalam, the Wanderer in less than 04:30.",
    "1964": "Defeat Kezalam, the Wanderer in less than 03:30.",
    "1965": "Defeat Kezalam, the Wanderer. (X/1)",
    "1966": "Defeat Kezalam, the Wanderer in hard mode while completing the listed achievements.",
    "1967": "Defeat Kezalam, the Wanderer without being resurrected while completing the listed achievements.",
    "1968": "Upgrade a set of Death Skull equipment to tier 70.",
    "1969": "Upgrade a set of Death Skull equipment to tier 80.",
    "1970": "Upgrade a set of Death Skull equipment to tier 90.",
    "1971": "Complete this quest.",
    "1972": "Upgrade a set of Deathwarden equipment to tier 70.",
    "1973": "Upgrade a set of Deathwarden equipment to tier 80.",
    "1974": "Upgrade a set of Deathwarden equipment to tier 90.",
    "1975": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 30 from Kili.",
    "1976": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 40 from Kili.",
    "1977": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 50 from Kili.",
    "1978": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 60 from Kili.",
    "1979": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 70 from Kili.",
    "1980": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 80 from Kili.",
    "1981": "Learn how to upgrade your Death Skull and Deathwarden equipment to tier 90 from Kili.",
    "1982": "Learn how to upgrade your Death Skull equipment to tier 70, and upgrade your Deathwarden equipment to tier 70 Deathdealer from Kili.",
    "1983": "Learn how to upgrade your Death Skull and Deathdealer equipment to tier 80 from Kili.",
    "1984": "Learn how to upgrade your Death Skull and Deathdealer equipment to tier 90 from Kili.",
    "1985": "Create an omni soulstone from the Saradominist, Zamorakian, Bandosian and Armadylean soulstones dropped by the hard mode bosses in the God Wars Dungeon.",
    "1986": "Defeat K'ril Tsutsaroth. (X/5)",
    "1987": "Defeat K'ril Tsutsaroth. (X/10)",
    "1988": "Defeat K'ril Tsutsaroth. (X/25)",
    "1989": "Defeat K'ril Tsutsaroth. (X/50)",
    "1990": "Defeat K'ril Tsutsaroth. (X/75)",
    "1991": "Defeat K'ril Tsutsaroth. (X/100)",
    "1992": "Defeat K'ril Tsutsaroth in hard mode. (X/5)",
    "1993": "Defeat K'ril Tsutsaroth in hard mode. (X/10)",
    "1994": "Defeat K'ril Tsutsaroth in hard mode. (X/25)",
    "1995": "Defeat K'ril Tsutsaroth in hard mode. (X/50)",
    "1996": "Defeat K'ril Tsutsaroth in hard mode. (X/75)",
    "1997": "Defeat K'ril Tsutsaroth in hard mode. (X/100)",
    "1998": "Complete the Fight Kiln.",
    "1999": "Complete this quest.",
    "2000": "Defeat the King Black Dragon. (X/1)",
    "2001": "Defeat the King Black Dragon solo in less than 00:48.",
    "2002": "Defeat the King Black Dragon solo in less than 01:00.",
    "2003": "Unlock the King Black Dragonling pet from the King Black Dragon.",
    "2004": "Transport a full load (224 pieces) of coal to Seers' Village.",
    "2005": "Find the highest tree on the Fremennik mainland.",
    "2006": "Find the highest point in Varrock.",
    "2007": "Complete this quest.",
    "2008": "Complete this quest.",
    "2009": "Wear a ring of kinship with a fully upgraded role, e.g. Tank, Medic.",
    "2010": "Non-ironman: | Feed a team mate some food to heal them. | Ironman: | Attempt to feed a Dungeoneering familiar.",
    "2011": "Summon a cat or kitten at the sandy patch by 'The Face' in Port Sarim.",
    "2012": "Ask the Wise Old Man to check your bank for unnecessary quest-related items.",
    "2013": "Obtained a collection of unique drops from elite clue scrolls.",
    "2014": "Solve this mystery.",
    "2015": "Talk to Khoochak about a quest.",
    "2016": "Complete the 'Koschei's Troubles' miniquest and unlock all jewel memories.",
    "2017": "Complete this miniquest.",
    "2018": "Hit Boggoth using a lava whip's special attack.",
    "2019": "Unlock the Krar Jnr pet from the Nemi Forest on Mazcab.",
    "2020": "Defeat Kree'arra. (X/1)",
    "2021": "Defeat Kree'arra in hard mode, solo, in less than 01:00.",
    "2022": "Defeat Kree'arra in hard mode, solo, in less than 00:30.",
    "2023": "Defeat Kree'arra solo in less than 00:42.",
    "2024": "Defeat Kree'arra solo in less than 00:36.",
    "2025": "When you have achieved 153 Kudos, speak to the apprentice by the central staircase, downstairs in the museum.",
    "2026": "Reach full Kudos with the Varrock Museum. (X/198)",
    "2027": "Unlock the Kuroryu pet from Seiryu in the Temple of Aminishi.",
    "2028": "Take a poison chalice to King Arthur.",
    "2029": "Obtained a collection of unique drops from Slayer monsters located within Kandarin.",
    "2030": "Kill an experiment under Castle Fenkenstrain.",
    "2031": "Upgrade the grove at Fort Forinthry to Tier 3.",
    "2032": "Complete this miniquest.",
    "2033": "Rub these quest lamps that can be reclaimed from May's storage chest, near Varrock lodestone. (X/40)",
    "2034": "Complete this quest.",
    "2035": "Defeat Solak, Guardian of the Grove with at least 8 active Blightbound lashers.",
    "2036": "Fully upgrade the pig creation machine after 'Bringing Home the Bacon'.",
    "2037": "Defeat a lava strykewyrm.",
    "2038": "Craft some law runes while inside a dungeon.",
    "2039": "Don't allow the Chaos Elemental's 'Madness' attack to unequip something you're wearing.",
    "2040": "Attempt to pass a leaf trap.",
    "2041": "Solve this mystery.",
    "2042": "Jump the chasm in the Fremennik Slayer Dungeon to gain quick access to the pyrefiends.",
    "2043": "Claim and use the Divination XP lamp from Mr. Mordaut after 'One of a Kind'.",
    "2044": "Find all the hidden Zygomites on Anachronia.",
    "2045": "Complete this quest.",
    "2046": "Inform the Old man about the fate of his mother after 'Vessel of the Harbinger'.",
    "2047": "Complete this quest.",
    "2048": "Unlock the Legio Primulus pet from Legio Primus in the Ascension Dungeon.",
    "2049": "Unlock the Legio Quartulus pet from Legio Quartus in the Ascension Dungeon.",
    "2050": "Unlock the Legio Quintulus pet from Legio Quintus in the Ascension Dungeon.",
    "2051": "Unlock the Legio Secundulus pet from Legio Secundus in the Ascension Dungeon.",
    "2052": "Unlock the Legio Sextulus pet from Legio Sextus in the Ascension Dungeon.",
    "2053": "Unlock the Legio Tertiolus pet from Legio Tertius in the Ascension Dungeon.",
    "2054": "Defeat any of the Ascension Legiones. (X/1)",
    "2055": "Defeat any of the six Ascension Legiones solo in less than 00:30.",
    "2056": "Defeat any of the six Ascension Legiones solo in less than 00:18.",
    "2057": "Complete a Lesser Necroplasm ritual.",
    "2058": "Obtained a collection of unique drops from Slayer monsters located within Feldip Hills.",
    "2059": "Defeat Raksha, the Shadow Colossus without expelling any poisonous shadow energy from his 'Mind Flay' attack.",
    "2060": "Complete this quest.",
    "2061": "Find and read the Ugthanatos journal.",
    "2062": "Convert a memory, or an enriched memory, into enhanced experience.",
    "2063": "Claim the King Slime's Top Hat cosmetic override from Eva after 'Once Upon a Slime'.",
    "2064": "Defeat Vorago without anyone being hit by his 'Teamsplit' attack during the 'Teamsplit' stage.",
    "2065": "Defeat Vorago without anyone successfully hiding during the 'Teamsplit' attack.",
    "2066": "Obtained a collection of unique drops from the Liberation of Mazcab.",
    "2067": "Find and read the books from the Nex, Angel of Death encounter.",
    "2068": "Cook shrimp on a range in Lumbridge.",
    "2069": "Get rescued by the Sign of Life effect 50 times. (X/50)",
    "2070": "Hand in a lizard chicken called Malcolm with the Chaotic trait to Granny P.",
    "2071": "Burn at least 15 logs at once using the Pyromaniac perk.",
    "2072": "Power all the shadow anchors at Kharid-et. (X/8)",
    "2073": "Obtained a collection of unique drops from Kree'arra.",
    "2074": "Defeat Araxxor and Araxxi without anyone standing in the light after taking the Darkness path during phase 2.",
    "2075": "Enter the Temple of Light using a teleport crystal.",
    "2076": "Trade furs with the fancy dress seller for a spottier cape.",
    "2077": "Defeat any of the six Legiones solo without being hit by their 'Lightning' attack.",
    "2078": "Defeat Commander Zilyana in hard mode, solo, without being hit by her 'Lightning' attack.",
    "2079": "Defeat Kerapac, the bound after being hit by all 3 waves of his 'Lightning Strike' attack within 3s of each other.",
    "2080": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Portal Explosion' attack.",
    "2081": "Kill a goblin raider boss in the Goblin Village.",
    "2082": "Cast the Varrock Teleport spell.",
    "2083": "Unlock the Lil' Tuzzy pet from Beastmaster Durzag in the Liberation of Mazcab.",
    "2084": "Unlock the Lilwyr pet from Helwyr in the Heart of Gielinor.",
    "2085": "Complete the high-level section of the Barbarian Agility course while wearing an agile top.",
    "2086": "Mine limestone at the mountains of Arandar.",
    "2087": "Mine some limestone near Paterdomus, the temple to the east of Varrock.",
    "2088": "Create a luck potion from scratch whilst in the Wilderness.",
    "2089": "Score a goal in Gnome Ball.",
    "2090": "Unlock the Little Sus pet from Croesus.",
    "2091": "Unlock the Little Zuk pet from TzKal-Zuk's challenge.",
    "2092": "Throw a rotten tomato at Pauline Polaris in New Varrock, after having unlocked all Livid Farm spells.",
    "2093": "Use the Air Guitar emote near the musician outside the monastery south of Ardougne.",
    "2094": "Defeat TzTok-Jad. (X/5)",
    "2095": "Defeat TzTok-Jad. (X/10)",
    "2096": "Defeat TzTok-Jad. (X/25)",
    "2097": "Defeat TzTok-Jad. (X/50)",
    "2098": "Defeat TzTok-Jad. (X/75)",
    "2099": "Defeat TzTok-Jad. (X/100)",
    "2100": "Cast the Home Teleport spell in the Ancient Magicks spellbook to teleport to Edgeville.",
    "2101": "Hear the Epic of Bukalla in the Rellekka longhall.",
    "2102": "Unlock all of the Lodestones.",
    "2103": "Unlock all of the Free to Play Lodestones.",
    "2104": "Unlock all of the Members' Lodestones.",
    "2105": "Obtained a collection of unique drops from the Dagannoth Kings.",
    "2106": "Defeat the Queen Black Dragon and obtain the first dragonkin journal.",
    "2107": "Complete the Hefin Agility course with a light creature familiar summoned.",
    "2108": "Salute Sir Tiffy while wearing full initiate armour.",
    "2109": "Defeat the Queen Black Dragon. (X/5)",
    "2110": "Defeat the Queen Black Dragon. (X/10)",
    "2111": "Defeat the Queen Black Dragon. (X/25)",
    "2112": "Defeat the Queen Black Dragon. (X/50)",
    "2113": "Defeat the Queen Black Dragon. (X/75)",
    "2114": "Defeat the Queen Black Dragon. (X/100)",
    "2115": "Loot all of the abandoned chests in the Star Lodge.",
    "2116": "Claim the gems from the demon throne during or after 'The Golem'.",
    "2117": "Defeat Zamorak, Lord of Chaos in a group at 500% enrage.",
    "2118": "Defeat Zamorak, Lord of Chaos in a group at 1,000% enrage.",
    "2119": "Defeating Zamorak, Lord of Chaos in a group at 4,000% enrage.",
    "2120": "Defeating Zamorak, Lord of Chaos in a group at 2,000% enrage.",
    "2121": "Complete this quest.",
    "2122": "Complete this miniquest.",
    "2123": "Find and squeeze Morytania plushies, and return them to Lex in Canifis.",
    "2124": "Complete this quest.",
    "2125": "Catch a salmon in the river to the east of Lumbridge Castle.",
    "2126": "Use elder charms to create each of the listed summoning pouches.",
    "2127": "Discover and read all five Horror journals.",
    "2128": "Contribute all items to the collection.",
    "2129": "Contribute all items to the collection.",
    "2130": "Contribute all items to the collection.",
    "2131": "Get the King Black Dragon to fully degrade a mole anti-dragon shield. Can only be completed in a solo instance.",
    "2132": "Kill a scarab mage, locust rider or kalphite with the Keris dagger.",
    "2133": "Activate the lodestone in Lumbridge.",
    "2134": "Given by Explorer Jack in Lumbridge for completing all Beginner Tasks in Lumbridge.",
    "2135": "Given by Bob, the axe seller in Lumbridge, for completing all Easy Tasks in Lumbridge.",
    "2136": "Given by Ned in Draynor Village for completing all Hard Tasks in Lumbridge.",
    "2137": "Given by Ned in Draynor Village for completing all Medium Tasks in Lumbridge.",
    "2138": "Defeat Araxxor and Araxxi whilst wearing bronze armour on your head, torso and legs, and a bronze weapon in your main hand. Can only be completed in solo mode.",
    "2139": "Complete this quest.",
    "2140": "Activate the lodestone in Lunar Isle.",
    "2141": "Unlock all lunar spells. (X/11)",
    "2142": "Unlock the Dorgesh-Kaan food trading minigame.",
    "2143": "Catch a mackerel.",
    "2144": "Craft a holy symbol in the furnace in Lumbridge.",
    "2145": "Find and read 'Archaeology Journal - H.F.A', found in the Zamorakian Undercity.",
    "2146": "Defeat Kolodion at the Mage Arena and collect a god staff.",
    "2147": "Unlock the Magic pet.",
    "2148": "Reach level 5 in the Magic skill.",
    "2149": "Reach level 10 in the Magic skill.",
    "2150": "Reach level 20 in the Magic skill.",
    "2151": "Reach level 30 in the Magic skill.",
    "2152": "Reach level 40 in the Magic skill.",
    "2153": "Reach level 50 in the Magic skill.",
    "2154": "Reach level 60 in the Magic skill.",
    "2155": "Reach level 70 in the Magic skill.",
    "2156": "Reach level 80 in the Magic skill.",
    "2157": "Reach level 90 in the Magic skill.",
    "2158": "Reach level 92 in the Magic skill.",
    "2159": "Reach level 99 in the Magic skill.",
    "2160": "Reach virtual level 110 in the Magic skill.",
    "2161": "Reach virtual level 120 in the Magic skill.",
    "2162": "Obtain 100 soul fragments within Soul Wars and offer them all at once to the Soul Obelisk.",
    "2163": "Recover all 15 memories for Kharshai during the Mahjarrat Memories miniquest.",
    "2164": "Make an enchanted diamond-tipped bolt from scratch within the Seers' Village area.",
    "2165": "Gain 6,000 reputation with any faction in Menaphos.",
    "2166": "Throw coins into the deep sea whirlpool.",
    "2167": "Use asphyxiate on Yakamaru's north pool and have the whole raid survive.",
    "2168": "Perform well enough in Rush of Blood to impress Morvran.",
    "2169": "Complete a flawless run by defeating TzKal-Zuk in a single attempt after completing all of his challenges.",
    "2170": "Complete this quest.",
    "2171": "Enter the second level of the Stronghold of Security.",
    "2172": "Make a mind tiara.",
    "2173": "Defeat 18 shadow enigmas in 6 seconds.",
    "2174": "Unlock the Mallory pet from Araxxi.",
    "2175": "Upgrade the command centre in Fort Forinthry to Tier 3.",
    "2176": "Permanently cure Razmire and Ulsquire after 'Shades of Mort'ton'.",
    "2177": "Complete all three additional challenges from Maria in the Broken Home quest.",
    "2178": "Make use of either an autoheater, gem bag, herbicide, bonecrusher or charming imp.",
    "2179": "Find all Marmaros and Thok letters from Daemonheim.",
    "2180": "Assemble the five parts of the Mask of Dragith Nurn from the Lumbridge Catacombs.",
    "2181": "Craft 140 or more mind runes simultaneously, without using pouches or familiars.",
    "2182": "Purchase the champion's tackle box from the Fish Flingers fisherman.",
    "2183": "Unlock the ogre bowman hat by killing 30 chompy birds. (X/30)",
    "2184": "Fully upgrade the base camp on Anachronia.",
    "2185": "Complete all these to be able to obtain the master completionist cape.",
    "2186": "Reach level or virtual level 120 in the listed skills to be able to obtain the master max cape.",
    "2187": "Collect all skilling pets. (X/29)",
    "2188": "Climb to the highest point in Lumbridge.",
    "2189": "Achieve maximum rank in each Barbarian Assault role.",
    "2190": "Defeat Beastmaster Durzag. (X/5)",
    "2191": "Defeat Beastmaster Durzag. (X/10)",
    "2192": "Defeat Beastmaster Durzag. (X/25)",
    "2193": "Defeat Beastmaster Durzag. (X/50)",
    "2194": "Defeat Beastmaster Durzag. (X/75)",
    "2195": "Defeat Beastmaster Durzag. (X/100)",
    "2196": "Obtained a collection of unique drops from Slayer monsters located on realms beyond Gielinor.",
    "2197": "Complete all barbarian training with Otto, at his grotto west of Baxtorian Falls.",
    "2198": "Gather a total of 20,000 resources from Archaeology, Fishing, Mining or Woodcutting. (X/20,000)",
    "2199": "Complete all these to be able to obtain the master quest cape. (X/294)",
    "2200": "Pick a fruit from the White Tree.",
    "2201": "Increase all skills to mastery level.",
    "2202": "Complete all these to be able to obtain the master completionist cape (t).",
    "2203": "Defeat each type of elemental in the Elemental Workshop.",
    "2204": "Fully explore the history of the Daemonheim Dig Site.",
    "2205": "Fully explore the history of the Everlight Dig Site.",
    "2206": "Fully explore the history of the Infernal Source Dig Site.",
    "2207": "Fully explore the history of the Kharid-et Dig Site.",
    "2208": "Fully explore the history of the Orthen Dig Site.",
    "2209": "Fully explore the history of the Senntisten Dig Site.",
    "2210": "Fully explore the history of the Stormguard Dig Site.",
    "2211": "Fully explore the history of the Warforge Dig Site.",
    "2212": "Defeat Masuta the Ascended solo in less than 05:00.",
    "2213": "Defeat Masuta the Ascended solo in less than 03:30.",
    "2214": "Defeat Masuta the Ascended. (X/5)",
    "2215": "Defeat Masuta the Ascended. (X/10)",
    "2216": "Defeat Masuta the Ascended. (X/25)",
    "2217": "Defeat Masuta the Ascended. (X/50)",
    "2218": "Defeat Masuta the Ascended. (X/75)",
    "2219": "Defeat Masuta the Ascended. (X/100)",
    "2220": "Defeat Masuta the Ascended solo. (X/5)",
    "2221": "Defeat Masuta the Ascended solo. (X/10)",
    "2222": "Defeat Masuta the Ascended solo. (X/25)",
    "2223": "Defeat Masuta the Ascended solo. (X/50)",
    "2224": "Defeat Masuta the Ascended solo. (X/75)",
    "2225": "Defeat Masuta the Ascended solo. (X/100)",
    "2226": "Defeat Masuta the Ascended.",
    "2227": "Defeat Nex while accompanied by each of the nihil followers.",
    "2228": "Defeat Vorago in hard mode, solo, by personally using the Maul of Omens on him on every rotation.",
    "2229": "Defeat Vorago in hard mode in a team size of 2 or fewer by personally using the Maul of Omens on him on every rotation.",
    "2230": "Defeat Vorago in hard mode by personally using the Maul of Omens on him on every rotation.",
    "2231": "Reach 99 in the listed skills to be able to obtain the max cape.",
    "2232": "Unlock the Mazcab Teleport spell.",
    "2233": "Use the Measure to find the four Elder God chronicles.",
    "2234": "Complete this quest.",
    "2235": "After Meeting History, return to the past and talk to Sarah about Herblore.",
    "2236": "Investigate an overgrown Karamjan idol to discover an ancient tale.",
    "2237": "Unlock the mega ducklings pet from fowl play.",
    "2238": "View the memorial board at Het's Oasis.",
    "2239": "Read the Memoirs of the Devourer from Amascut, the Devourer.",
    "2240": "Prestige the Memorial to Guthix three times. (X/3)",
    "2241": "Attune and hand all engrams in to the Memorial to Guthix.",
    "2242": "Defeat Amascut, the Devourer in enrage mode without failing her 'Altar Strike' attack in phase 7.",
    "2243": "Activate the lodestone in Menaphos.",
    "2244": "Complete various achievements within Menaphos.",
    "2245": "Complete this quest.",
    "2246": "Find and read 'Scions of Erebus', dropped by an Abyssal lord.",
    "2247": "Gain access to the secret treasure room from 'Our Man in the North'.",
    "2248": "Whip up a batch of 'Zemouregal brew' for Tiny Zemouregal.",
    "2249": "Transmute an item.",
    "2250": "Sober up Skippy.",
    "2251": "Give the Tooth Fairy five teeth and claim a tooth creature pet.",
    "2252": "Get a member of the Dagon'hai's mind control spells to backfire on him.",
    "2253": "Create the cosmic accumulator by combining the cosmic focus and the cosmic pyramid after 'Desperate Measures'.",
    "2254": "Unlock the Mining pet.",
    "2255": "Reach level 5 in the Mining skill.",
    "2256": "Reach level 10 in the Mining skill.",
    "2257": "Reach level 20 in the Mining skill.",
    "2258": "Reach level 30 in the Mining skill.",
    "2259": "Reach level 40 in the Mining skill.",
    "2260": "Reach level 50 in the Mining skill.",
    "2261": "Reach level 60 in the Mining skill.",
    "2262": "Reach level 70 in the Mining skill.",
    "2263": "Reach level 80 in the Mining skill.",
    "2264": "Reach level 90 in the Mining skill.",
    "2265": "Reach level 92 in the Mining skill.",
    "2266": "Reach level 99 in the Mining skill.",
    "2267": "Reach level 110 in the Mining skill.",
    "2268": "Reach virtual level 120 in the Mining skill.",
    "2269": "Mine a rock in the Worker District.",
    "2270": "Defeat Rasial, the First Necromancer without being hit by his minions.",
    "2271": "Unlock the Minister pet from the Magister.",
    "2272": "Earn the Wisdom of Anima fletching perk for one of the Elder God arrow types.",
    "2273": "Find Misc. Dungeoneering journals 1 through 15.",
    "2274": "Unlock the Miso pet from Rasial, the First Necromancer.",
    "2275": "Defeat Amascut, the Devourer in enrage mode without anyone allowing any Volatile scarab akh to spawn.",
    "2276": "Complete this quest.",
    "2277": "Complete this quest.",
    "2278": "Unlock the death lotus gloves and boots scrolls from the Waiko reward shop.",
    "2279": "Unlock the seasinger gloves and boots scrolls from the Waiko reward shop.",
    "2280": "Unlock the tetsu gloves and boots scrolls from the Waiko reward shop.",
    "2281": "Restore the fairy ring in the Ancient Cavern.",
    "2282": "Unlock each of the A.R.M.S. titles. (X/4)",
    "2283": "Defeat the Giant Mole. (X/5)",
    "2284": "Defeat the Giant Mole. (X/10)",
    "2285": "Defeat the Giant Mole. (X/25)",
    "2286": "Defeat the Giant Mole. (X/50)",
    "2287": "Defeat the Giant Mole. (X/75)",
    "2288": "Defeat the Giant Mole. (X/100)",
    "2289": "Unlock the Molly pet from the Giant Mole.",
    "2290": "Access the bank in Draynor Village.",
    "2291": "Complete this quest.",
    "2292": "Cross the monkey bars in the Yanille Agility Dungeon.",
    "2293": "Complete this quest.",
    "2294": "Defeat Bossy McBossface's first mate.",
    "2295": "Harness the power of three relics at once.",
    "2296": "Damage Zemouregal at least five times with exploding cows.",
    "2297": "Cast Fertile Soil on a patch within the Seers' Village area.",
    "2298": "Defeat Vermyx, Brood Mother without being hit by her 'Moonstone Shard' attack.",
    "2299": "Defeat Avaryss and Nymora in hard mode. (X/5)",
    "2300": "Defeat Avaryss and Nymora in hard mode. (X/10)",
    "2301": "Defeat Avaryss and Nymora in hard mode. (X/25)",
    "2302": "Defeat Avaryss and Nymora in hard mode. (X/50)",
    "2303": "Defeat Avaryss and Nymora in hard mode. (X/75)",
    "2304": "Defeat Avaryss and Nymora in hard mode. (X/100)",
    "2305": "Fletch some broad bolts or arrows in Sumona's house.",
    "2306": "Sell a clay ring to Morgan in Draynor Village.",
    "2307": "Given by Hiylik Myna, east of Paterdomus, for completing all Easy Tasks in Morytania.",
    "2308": "Given by Old Man Ral, in Meiyerditch, for completing all Elite Tasks in Morytania.",
    "2309": "Given by the Strange Old Man, at the Barrows, for completing all Hard Tasks in Morytania.",
    "2310": "Given by Robin, in Port Phasmatys, for completing all Medium Tasks in Morytania.",
    "2311": "Complete this quest.",
    "2312": "Complete a communion ritual using a memento.",
    "2313": "Complete this quest.",
    "2314": "Complete this quest.",
    "2315": "Recharge your Prayer points at the altar south-west of Port Sarim.",
    "2316": "Attempt to pass a poison bolt tripwire trap.",
    "2317": "Find a way to return Fluffs home to Gertrude.",
    "2318": "Unlock the Mune pet from spotting Mune roaming Gielinor.",
    "2319": "Complete this quest.",
    "2320": "Complete this quest.",
    "2321": "Discover all the Arc mushrooms.",
    "2322": "Unlock all music tracks.",
    "2323": "Speak to King Roald with the inferno adze equipped.",
    "2324": "Complete this quest.",
    "2325": "Make a maple plank yourself on the sawmill in Fort Forinthry.",
    "2326": "Obtain maximum reputation with the goebies on Mazcab.",
    "2327": "Unlock the mentioned amenities in War's Retreat.",
    "2328": "Complete this miniquest.",
    "2329": "Find and return Gregg 'Groggy' Herring's lost ring.",
    "2330": "Maintain nearly maximum stamina when mining for 60 seconds.",
    "2331": "Have a Skeleton Warrior conjured while fighting a skeleton.",
    "2332": "Defeat Hermod, the Spirit of War without being hit by its 'Obliterate' attack.",
    "2333": "Have either a Putrid Zombie or Vengeful Ghost conjured while fighting the matching creature.",
    "2334": "Kill a highwayman on the road south of Falador.",
    "2335": "Craft some miasma runes.",
    "2336": "Help Bill the ancient zygomite near the mystical tree on the west coast of Anachronia.",
    "2337": "Find an unchecked zygomite while carestyling south of Anachronia dinosaur farm.",
    "2338": "Complete construction of the Myreque memorial and help Veliaf to move on.",
    "2339": "Complete all the Daemonheim mysteries.",
    "2340": "Complete all the Everlight mysteries.",
    "2341": "Complete all the Guild mysteries.",
    "2342": "Complete all the Infernal Source mysteries.",
    "2343": "Complete all the Kharid-et mysteries.",
    "2344": "Complete all the Orthen mysteries.",
    "2345": "Complete all the Daemonheim[sic] mysteries.",
    "2346": "Complete all the Stormguard mysteries.",
    "2347": "Complete all the Warforge mysteries.",
    "2348": "Fully interact with the mysterious statues after 'One of a Kind'.",
    "2349": "Solve this mystery.",
    "2350": "Solve 1 of Gielinor's greatest mysteries.",
    "2351": "Solve 2 of Gielinor's greatest mysteries.",
    "2352": "Solve 5 of Gielinor's greatest mysteries.",
    "2353": "Solve 10 of Gielinor's greatest mysteries.",
    "2354": "Solve 15 of Gielinor's greatest mysteries.",
    "2355": "Solve 20 of Gielinor's greatest mysteries.",
    "2356": "Solve 25 of Gielinor's greatest mysteries.",
    "2357": "Solve 30 of Gielinor's greatest mysteries.",
    "2358": "Learn how to craft moonstone jewellery.",
    "2359": "Complete this quest.",
    "2360": "Complete this saga.",
    "2361": "Defeat Nakatra, Devourer Eternal in hard mode in less than 05:00.",
    "2362": "Defeat Nakatra, Devourer Eternal in hard mode in less than 02:24.",
    "2363": "Defeat Nakatra, Devourer Eternal in hard mode in less than 03:00.",
    "2364": "Defeat Nakatra, Devourer Eternal in less than 06:00.",
    "2365": "Defeat Nakatra, Devourer Eternal in less than 04:30.",
    "2366": "Defeat Nakatra, Devourer Eternal. (X/1)",
    "2367": "Defeat Nakatra, Devourer Eternal in hard mode while completing the listed achievements.",
    "2368": "Defeat Nakatra, Devourer Eternal without being resurrected while completing the listed achievements.",
    "2369": "Claim the Kipple Nano pet.",
    "2370": "Claim the reward lamp from the natural historian after 'The Tale of the Muspah'.",
    "2371": "Complete this quest.",
    "2372": "Allow the Chaos Elemental's 'Madness' attack to unequip something you're wearing five times.",
    "2373": "Obtained a collection of unique drops from Kerapac, the bound.",
    "2374": "Smelt a necronium bar at the smithy in the City of Um.",
    "2375": "Unlock the Necromancy pet.",
    "2376": "Reach level 5 in the Necromancy skill.",
    "2377": "Reach level 10 in the Necromancy skill.",
    "2378": "Reach level 20 in the Necromancy skill.",
    "2379": "Reach level 30 in the Necromancy skill.",
    "2380": "Reach level 40 in the Necromancy skill.",
    "2381": "Reach level 50 in the Necromancy skill.",
    "2382": "Reach level 60 in the Necromancy skill.",
    "2383": "Reach level 70 in the Necromancy skill.",
    "2384": "Reach level 80 in the Necromancy skill.",
    "2385": "Reach level 90 in the Necromancy skill.",
    "2386": "Reach level 92 in the Necromancy skill.",
    "2387": "Reach level 99 in the Necromancy skill.",
    "2388": "Reach level 110 in the Necromancy skill.",
    "2389": "Reach level 113 in the Necromancy skill.",
    "2390": "Reach level 120 in the Necromancy skill.",
    "2391": "Complete this quest.",
    "2392": "Show an elder god arrow to Prehistoric Potterington.",
    "2393": "Unlock the Neffie pet from the Sanctum of Rebirth.",
    "2394": "Activate and teleport from each of the Wilderness teleport obelisks.",
    "2395": "Get charged by the Kalphite King to each side of the arena and then defeat him.",
    "2396": "Find out what happens when dark and light meet.",
    "2397": "Complete this quest.",
    "2398": "Given by Tiny Zemouregal in New Varrock square for completing all Easy Tasks in New Varrock.",
    "2399": "Given by Tiny Zemouregal in New Varrock square for completing all Elite Tasks in New Varrock.",
    "2400": "Given by Tiny Zemouregal in New Varrock square for completing all Hard Tasks in New Varrock.",
    "2401": "Given by Tiny Zemouregal in New Varrock square for completing all Medium Tasks in New Varrock.",
    "2402": "Defeat Nex. (X/1)",
    "2403": "Defeat Nex solo in less than 03:00.",
    "2404": "Defeat Nex solo in less than 02:15.",
    "2405": "Defeat Nex solo in less than 01:21.",
    "2406": "Defeat Nex, the Angel of Death. (X/5)",
    "2407": "Defeat Nex, the Angel of Death. (X/10)",
    "2408": "Defeat Nex, the Angel of Death. (X/25)",
    "2409": "Defeat Nex, the Angel of Death. (X/50)",
    "2410": "Defeat Nex, the Angel of Death. (X/75)",
    "2411": "Defeat Nex, the Angel of Death. (X/100)",
    "2412": "Defeat Nex, the Angel of Death. (X/1)",
    "2413": "Defeat Nex, Angel of Death in a team of 2 or fewer.",
    "2414": "Defeat Nex, Angel of Death in a team of 5 or fewer without anyone dying while completing the listed achievements.",
    "2415": "Defeat Nex, Angel of Death solo.",
    "2416": "Defeat Nex, Angel of Death in a team of 5 or fewer without anyone dying while completing the listed achievements.",
    "2417": "Defeat Nex, Angel of Death in a team of 7 or fewer in less than 02:30.",
    "2418": "Defeat Nex, Angel of Death in a team of 7 or fewer in less than 01:06.",
    "2419": "Defeat Nex, Angel of Death in a team of 7 or fewer in less than 01:21.",
    "2420": "Defeat Nex without the use of prayers by anyone in the group.",
    "2421": "Unlock the Nexterminator pet from Nex in the God Wars Dungeon.",
    "2422": "Sample all of the listed meat dishes.",
    "2423": "Kill Rammernaut without getting charged, or make him stun himself.",
    "2424": "Use the portal in the Magic Guild to teleport to Thormac's tower.",
    "2425": "Solve this mystery.",
    "2426": "Use a dreadnip on the Kalphite Queen.",
    "2427": "Defeat Raksha, the Shadow Colossus without letting him use his 'Shadow Bomb' attack in phase 4.",
    "2428": "Start a duel in the Crucible area within the Warforge.",
    "2429": "Defeat Vorago without anyone being hit by damage reflected by his 'Target Link' attack.",
    "2430": "Chop down the dead tree next to Varrock's south east wall and the mine.",
    "2431": "Defeat Amascut, the Devourer in enrage mode without allowing any Engulfing shadow tears to explode.",
    "2432": "Restore and claim from the statues of four famous icyene.",
    "2433": "Make a pyre ship from magic logs.",
    "2434": "Defeat Nex, Angel of Death in a team of 7 or fewer without anyone taking damage from her 'Smoke Blades' attack.",
    "2435": "Use a ring of duelling to teleport to Castle Wars.",
    "2436": "Defeat Rasial, the First Necromancer. (X/5)",
    "2437": "Defeat Rasial, the First Necromancer. (X/10)",
    "2438": "Defeat Rasial, the First Necromancer. (X/25)",
    "2439": "Defeat Rasial, the First Necromancer. (X/50)",
    "2440": "Defeat Rasial, the First Necromancer. (X/75)",
    "2441": "Defeat Rasial, the First Necromancer. (X/100)",
    "2442": "Craft some spirit or bone runes.",
    "2443": "Complete this quest.",
    "2444": "Defeat the memory of Nomad and loot one of his bounty chests.",
    "2445": "Complete this quest.",
    "2446": "Speak to Zimberfizz about swapping your Soul Wars cape for one of a different colour.",
    "2447": "Defeat the Black Stone Dragon without taking damage from any shadow flames.",
    "2448": "Defeat Helwyr solo without moving.",
    "2449": "Pickpocket a watchman in Yanille while wearing gloves of silence.",
    "2450": "Teleport to Burgh de Rott using a games necklace.",
    "2451": "Craft at least 100 water runes at once without needing an explorer's ring, pouches or familiars.",
    "2452": "Persuade Noterazzo in the Bandit Camp to show you his goods.",
    "2453": "Gather a total of 500 resources from Archaeology, Fishing, Mining or Woodcutting. (X/500)",
    "2454": "Unlock the Ex-Ex-Parrot pet after 'Rocking Out'.",
    "2455": "Search the shed in Lumbridge Swamp.",
    "2456": "Unlock the Nylessa pet from the Twin Furies in the Heart of Gielinor.",
    "2457": "Complete this quest.",
    "2458": "Make a batch of cannonballs in Port Phasmatys.",
    "2459": "Complete an occult floor solo on any complexity.",
    "2460": "Complete History of the Order of Ascension. (X/22)",
    "2461": "Obtained a collection of unique drops from Flesh-hatcher Mhekarnahz.",
    "2462": "Complete this quest.",
    "2463": "Collect the following lore books from bosses inside the Shadow Reef.",
    "2464": "Help Galgalar the ilujanka near the incubator south of the Anachronia dinosaur farm.",
    "2465": "Defeat any of the Barrows brothers after using the correct protection prayer against all of their basic attacks.",
    "2466": "Complete this quest.",
    "2467": "Unlock the Altar of War at War's Retreat.",
    "2468": "Complete the 'God Emissaries' miniquest.",
    "2469": "Unlock the highest rune shop from Ali Morrisane, by completing the 'Rogue Trader' miniquest.",
    "2470": "Catch a deathshead moth.",
    "2471": "Enter Edgeville Dungeon using the entrance to the south of Edgeville.",
    "2472": "Gain combat level 60, the recommended level to train under War in his retreat. He will grant rewards to help you fight bosses.",
    "2473": "Use Drakan's Medallion to teleport to Darkmeyer.",
    "2474": "Obtained a collection of unique drops from Helwyr.",
    "2475": "Complete this quest.",
    "2476": "Complete this quest.",
    "2477": "Defeat Kerapac, the bound in hard mode, without letting him jump more than once each phase from his 'Jumping Slam' attack.",
    "2478": "Smelt a silver bar in the furnace in Lumbridge.",
    "2479": "Find and read the Last Riders book, dropped by the King Black Dragon.",
    "2480": "Complete this miniquest.",
    "2481": "Defeat Nex, Angel of Death in a team of 7 or fewer without more than one player getting caught in her 'Elemental Lockdown' attack.",
    "2482": "Defeat Seiryu solo without jumping onto his manacles more than once.",
    "2483": "Fully loot Movario's base.",
    "2484": "Complete this quest.",
    "2485": "Transform into a native of Zolarea in front of one.",
    "2486": "Complete this quest.",
    "2487": "Complete this quest.",
    "2488": "Befriend a space flea.",
    "2489": "Earn only 1 credit from a construction contract.",
    "2490": "Take an easy companion through an easy route of Temple Trekking.",
    "2491": "Make three vials in the furnace building at Rellekka.",
    "2492": "Activate the lodestone near Oo'glog.",
    "2493": "Enter the Temple of Aminishi wearing H.A.M. clothing.",
    "2494": "Wear a full H.A.M. outfit while entering the Warforge.",
    "2495": "Talk to the Drunken Dwarf while carrying 28 different ales.",
    "2496": "Enter the Al Kharid Resource Dungeon.",
    "2497": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his orange 'Bomb' attacks.",
    "2498": "Craft and wield a spiritbloom orb.",
    "2499": "Complete a task from each Slayer Master consecutively, starting with [Turael/Spria] and ending with Laniakea.",
    "2500": "Create the big bowl for Tears of Guthix.",
    "2501": "Complete this quest.",
    "2502": "Obtained a collection of unique drops from Osseous.",
    "2503": "Find all barbarian notes in the Ancient Cavern.",
    "2504": "Complete this quest.",
    "2505": "Cast the Ourania Teleport spell.",
    "2506": "Unlock the spell: Ourania Teleport.",
    "2507": "Obtained a collection of unique drops from Corporeal Beast.",
    "2508": "Defeat Astellarn the First Celestial without anyone stabilising a wyrmhole.",
    "2509": "Solve this mystery.",
    "2510": "Give Sharrigan her mentor's Pastkeeper Amulet.",
    "2511": "Unlock everything in the Shooting Star Reward Shop. (X/4)",
    "2512": "Defeat the Sanctum Guardian without anyone taking any damage from her purple corruption.",
    "2513": "Boost your stats at Amascut's altar.",
    "2514": "Have all 6 prayer powders active at once.",
    "2515": "Track 8 of the owls in the City of Um.",
    "2516": "Speak to Otto Godblessed about barbarian training.",
    "2517": "Feed the giant oyster on Tutorial Island.",
    "2518": "Spend some Penguin Points with Larry (or Chuck) at Ardougne Zoo.",
    "2519": "Uncover the secrets of haemalchemy, after 'River of Blood'.",
    "2520": "Repair the stained glass windows in the Cathedral. (X/4)",
    "2521": "Panic at the party room in your clan citadel.",
    "2522": "Trap a pawya in the elven lands using a papaya you have harvested from a tree grown in the elven lands.",
    "2523": "Find Rowena 5 times.",
    "2524": "Defeat Vorago after personally jumping onto Vorago's back in stage 1 in under 35 seconds.",
    "2525": "Obtained a collection of unique drops from Telos.",
    "2526": "Pop a balloon in the monastery south of Ardougne.",
    "2527": "Create and use a portent of restoration IX or higher.",
    "2528": "Create a passing bracelet, performing each step in the City of Um.",
    "2529": "Unlock the Pavo pet from Pthentraken.",
    "2530": "Defeat Solak, Guardian of the Grove without anyone entering his mind in phase 4.",
    "2531": "Unlock the spell: Bones to Peaches.",
    "2532": "Catch a fish off one of Rellekka's piers.",
    "2533": "Kill the penance king in Barbarian Assault.",
    "2534": "Adopt Sheldon the penguin by tracking penguin spies around the world.",
    "2535": "Unlock all rewards from 'Dimension of Disaster'.",
    "2536": "Achieve a 100% Perfect Build score within Fort Forinthry.",
    "2537": "Train on a serenity post. (X/1)",
    "2538": "Train on a serenity post 5 times. (X/5)",
    "2539": "Train on a serenity post 10 times. (X/10)",
    "2540": "Train on a serenity post 25 times. (X/25)",
    "2541": "Complete this quest.",
    "2542": "Have at least 9 tier I animal perks from Manor Farm active at the same time.",
    "2543": "Have at least 6 tier II animal perks from Manor Farm active at the same time.",
    "2544": "Gain all possible Prawn Perk Points for your Aquarium. (X/2)",
    "2545": "Defeat the exiled Kalphite Queen solo.",
    "2546": "Find and return Petruccio's feather.",
    "2547": "Complete this quest.",
    "2548": "Use a lockpick to open ALL of New Varrock's treasure chests.",
    "2549": "Use a lockpick to open HALF of New Varrock's treasure chests.",
    "2550": "Use a lockpick to open any ONE of New Varrock's treasure chests.",
    "2551": "Complete this quest.",
    "2552": "Loot from all safes within Asgarnia. (X/10)",
    "2553": "Loot from all safes within Kandarin. (X/9)",
    "2554": "Loot from all safes within the Kharidian Desert. (X/10)",
    "2555": "Loot from all safes within Misthalin. (X/11)",
    "2556": "Loot from all safes hidden around less frequently visited places. (X/9)",
    "2557": "By completing the 8 Knight Waves in Camelot, unlock the prayers: Chivalry, Piety, Rigour, Augury.",
    "2558": "Complete this quest.",
    "2559": "Complete this quest.",
    "2560": "Complete this quest.",
    "2561": "Make a plank yourself on the sawmill in Fort Forinthry.",
    "2562": "Kill a Ket-Zek in the Fight Cave.",
    "2563": "Enter the Castle Wars waiting room.",
    "2564": "Make an extreme Ranging potion from scratch and drink it within the Ranging Guild.",
    "2565": "Unlock a chest in the Shade Catacombs.",
    "2566": "Pick up all of the chests in the Warforge.",
    "2567": "Use the spirit tree to the north-east of the Grand Exchange.",
    "2568": "Cross the spiky pit using the stepping stones within Brimhaven Dungeon.",
    "2569": "Craft some regular ghostly ink while in the City of Um",
    "2570": "Mine the mithril vein in the north-west corner of level 2 of the Abandoned Mine.",
    "2571": "Pray at the altar in the Kharid-et chapel while wearing a full set of ancient ceremonial robes.",
    "2572": "Disgruntle an inhabitant of Um by wearing a bedsheet.",
    "2573": "Defeat Nex, Angel of Death in a team of 7 or fewer after defeating all four pillars within 15 seconds.",
    "2574": "Create a portent of passage V or above.",
    "2575": "Complete the Player Owned Port tutorial.",
    "2576": "Activate the lodestone in Port Sarim.",
    "2577": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Bombard' attack.",
    "2578": "Create a portent.",
    "2579": "Send off at least one voyage from your player-owned port every day for fourteen consecutive days. (X/14)",
    "2580": "Make a bowl on a potter's wheel then fire it in the pottery oven, all in Barbarian Village.",
    "2581": "Help Lady Meilyr to retrieve her lost potion recipes.",
    "2582": "Unlock the listed combination potion recipes from Clan Meilyr in Prifddinas.",
    "2583": "Unlock the listed advanced combination potion recipes from Clan Meilyr in Prifddinas.",
    "2584": "Help Bill (near the mystical tree on the west coast of Anachronia) realise his 'pot'ential.",
    "2585": "Make a Super Ranging Mix within Otto's house.",
    "2586": "Unlock the ability to grow three spirit trees at once.",
    "2587": "Unlock Plant Power (Tier 1) from Sydekix's Reward Store at the Garden of Kharid.",
    "2588": "Unlock Plant Power (Tier 4) from Sydekix's Reward Store at the Garden of Kharid.",
    "2589": "Unlock the Prayer pet.",
    "2590": "Reach level 5 in the Prayer skill.",
    "2591": "Reach level 10 in the Prayer skill.",
    "2592": "Reach level 20 in the Prayer skill.",
    "2593": "Reach level 30 in the Prayer skill.",
    "2594": "Reach level 40 in the Prayer skill.",
    "2595": "Reach level 50 in the Prayer skill.",
    "2596": "Reach level 60 in the Prayer skill.",
    "2597": "Reach level 70 in the Prayer skill.",
    "2598": "Reach level 80 in the Prayer skill.",
    "2599": "Reach level 90 in the Prayer skill.",
    "2600": "Reach level 99 in the Prayer skill.",
    "2601": "Reach virtual level 110 in the Prayer skill.",
    "2602": "Reach virtual level 120 in the Prayer skill.",
    "2603": "Enter the Seers' Village courthouse with your Piety prayer turned on.",
    "2604": "Use the altar in West Ardougne's church.",
    "2605": "Create death runes from at least 20 pure essence whilst wearing a death tiara at the Death Altar.",
    "2606": "Complete this quest.",
    "2607": "Activate the lodestone in Prifddinas.",
    "2608": "Unlock the Prime Hatchling pet from Dagannoth Prime.",
    "2609": "Mine each of the 10 ores on the surface of the Daemonheim peninsula in under 5 minutes.",
    "2610": "Help out Nen with delivering water to Naida.",
    "2611": "Complete this quest.",
    "2612": "Solve this mystery.",
    "2613": "Obtained a collection of unique drops from Nex.",
    "2614": "Have at least one goebie survive the fight with Durzag.",
    "2615": "Use a ball of wool, mouse toy, or toy mouse on Amascut once she's been defeated.",
    "2616": "Gather a total of 4,000 resources from Archaeology, Fishing, Mining or Woodcutting. (X/4,000)",
    "2617": "Enchant an earth tiara on the Earth Altar.",
    "2618": "Clear wave 15 in a Gold or Platinum wave of the Rush of Blood D&D.",
    "2619": "Defeat Amascut, the Devourer in enrage mode without allowing Tumeken to be damaged during phase 5.",
    "2620": "Defeat Kerapac, the bound in hard mode, solo after dealing with all echos of Kerapac within 9s of each other.",
    "2621": "Obtained a collection of unique drops from Amascut, the Devourer.",
    "2622": "Disassemble 5 rare relics from elite dungeons. (X/5)",
    "2623": "Cleanse the Gate of Elidinis. (X/5)",
    "2624": "Cleanse the Gate of Elidinis. (X/10)",
    "2625": "Cleanse the Gate of Elidinis. (X/25)",
    "2626": "Cleanse the Gate of Elidinis. (X/50)",
    "2627": "Cleanse the Gate of Elidinis. (X/75)",
    "2628": "Cleanse the Gate of Elidinis. (X/100)",
    "2629": "Discover all of the chapters in 'The Needle Skips' and then claim your reward from Megan.",
    "2630": "Defeat the Chaos Elemental, dealing the most damage.",
    "2631": "Use Lev's old music box after 'Beneath Cursed Tides'.",
    "2632": "Complete this miniquest.",
    "2633": "Use the shard of Zaros on a dark animica rock.",
    "2634": "Travel to Port Sarim via the dock east of Musa Point.",
    "2635": "Smith an adamant medium helm on the anvil in Varrock next to Aubury's Rune Shop.",
    "2636": "Make a barbarian pyre ship from arctic pine.",
    "2637": "Complete all of the listed achievements and attend the qualification ceremony.",
    "2638": "Complete all of the listed achievements and attend the qualification ceremony.",
    "2639": "Complete all of the listed achievements and attend the qualification ceremony.",
    "2640": "Complete the Archaeology tutorial.",
    "2641": "Complete all of the listed achievements and attend the qualification ceremony.",
    "2642": "Defeat the Queen Black Dragon. (X/1)",
    "2643": "Defeat the Queen Black Dragon in less than 02:00.",
    "2644": "Defeat the Queen Black Dragon in less than 01:30.",
    "2645": "Unlock the Queen Black Dragonling pet from the Queen Black Dragon.",
    "2646": "Solve this mystery.",
    "2647": "Complete all quests to obtain the quest cape.",
    "2648": "Rest for a total of 150 minutes. (X/150)",
    "2649": "Bank stand for one hour.",
    "2650": "Use the crossbow shortcut south of the volcano.",
    "2651": "Complete this quest.",
    "2652": "Defeat the Queen Black Dragon and obtain all four dragonkin journals.",
    "2653": "Fill both small pens with rabbits.",
    "2654": "Successfully breed a rabbit with the Ravensworn trait.",
    "2655": "Defeat the Memory of Nomad encounter in under 6 minutes.",
    "2656": "Defeat the Memory of Nomad encounter in under 8 minutes.",
    "2657": "Defeat the Memory of Nomad encounter in under 10 minutes.",
    "2658": "Defeat the Memory of Nomad encounter in under 12 minutes.",
    "2659": "Defeat the Memory of Nomad encounter in under 14 minutes.",
    "2660": "Defeat the Memory of Nomad encounter in under 16 minutes.",
    "2661": "Defeat the Memory of Nomad encounter in under 20 minutes.",
    "2662": "Complete this quest.",
    "2663": "Obtained a collection of unique drops from the Temple of Aminishi elite dungeon.",
    "2664": "Raise the flag on the roof of the Lumbridge bank.",
    "2665": "Fletch a blisterwood polearm within Morytania.",
    "2666": "Unlock the Raklette pet from Raksha, the Shadow Colossus.",
    "2667": "Defeat Raksha, the Shadow Colossus in less than 02:45.",
    "2668": "Defeat Raksha, the Shadow Colossus in less than 01:15.",
    "2669": "Defeat Raksha, the Shadow Colossus in less than 01:42.",
    "2670": "Defeat Raksha, the Shadow Colossus. (X/1)",
    "2671": "Complete this quest.",
    "2672": "Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements.",
    "2673": "Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements.",
    "2674": "Have the four different seasonal rams in a pen at the same time.",
    "2675": "Unlock the Ranged pet.",
    "2676": "Reach level 5 in the Ranged skill.",
    "2677": "Reach level 10 in the Ranged skill.",
    "2678": "Reach level 20 in the Ranged skill.",
    "2679": "Reach level 30 in the Ranged skill.",
    "2680": "Reach level 40 in the Ranged skill.",
    "2681": "Reach level 50 in the Ranged skill.",
    "2682": "Reach level 60 in the Ranged skill.",
    "2683": "Reach level 70 in the Ranged skill.",
    "2684": "Reach level 80 in the Ranged skill.",
    "2685": "Reach level 90 in the Ranged skill.",
    "2686": "Reach level 92 in the Ranged skill.",
    "2687": "Reach level 99 in the Ranged skill.",
    "2688": "Reach virtual level 110 in the Ranged skill.",
    "2689": "Reach virtual level 120 in the Ranged skill.",
    "2690": "Obtain rank 1 esteem from Wizard Finix.",
    "2691": "Complete the Ungael combat activity on hard mode.",
    "2692": "Defeat Rasial, the First Necromancer in less than 02:30.",
    "2693": "Defeat Rasial, the First Necromancer in less than 01:30.",
    "2694": "Defeat Rasial, the First Necromancer in less than 01:00.",
    "2695": "Defeat Rasial, the First Necromancer. (X/1)",
    "2696": "Defeat Rasial, the First Necromancer while completing the listed achievements.",
    "2697": "Complete this quest.",
    "2698": "Cook some rat meat on a fire in Lumbridge Swamp.",
    "2699": "Attempt to catch a ghostly rat.",
    "2700": "Unlock the Rawrvek pet from Vindicta in the Heart of Gielinor.",
    "2701": "Buy a copy of the Varrock Herald.",
    "2702": "Cook some meat from an undead source (cow or chicken).",
    "2703": "Defeat Kerapac, the bound without being hit by his 'Jumping Slam' attack.",
    "2704": "Take a medium companion through a medium route of Temple Trekking.",
    "2705": "Defeat listed bosses at least once. (X/55)",
    "2706": "Complete this miniquest.",
    "2707": "Complete this Special quest.",
    "2708": "Complete this quest.",
    "2709": "Complete this quest.",
    "2710": "Complete this quest.",
    "2711": "Complete this quest.",
    "2712": "Complete this quest.",
    "2713": "Complete this quest.",
    "2714": "Complete this quest.",
    "2715": "Complete this quest.",
    "2716": "Complete this quest.",
    "2717": "Complete this quest.",
    "2718": "Defeat Telos, the Warden at 4000% enrage after killing all anima-golems in phases 4 and 5.",
    "2719": "Complete this quest.",
    "2720": "Use crimson charms to create each of the listed summoning pouches.",
    "2721": "Get a civilian to throw a tomato at the army recruiter in West Ardougne.",
    "2722": "Use the Bloodstone to turn the skies red after 'River of Blood'.",
    "2723": "Bake a summer pie in the Cooking Guild from scratch.",
    "2724": "Claim Thieving XP from Caelyn Kadaan after 'Heartstealer'.",
    "2725": "Unlock the Reeves pet from Nex, Angel of Death in the God Wars Dungeon.",
    "2726": "Pick five flax from the flax field.",
    "2727": "Collect 60 shards in Familiarisation.",
    "2728": "Complete this quest.",
    "2729": "Unlock all relic powers at the monolith.",
    "2730": "Re-kindle the Dragon Forge.",
    "2731": "Unlock the mentioned bonfire upgrades from War's store. (X/7)",
    "2732": "Claim XP from the Holy Cithara.",
    "2733": "Move your player-owned house portal by talking to the Varrock estate agent.",
    "2734": "Complete this quest.",
    "2735": "Build the Remote Totem Charging Point in the base camp on Anachronia.",
    "2736": "Earn tier 10 Menaphos reputation. (X/3,300,000)",
    "2737": "Earn tier 10 reputation with the imperial faction in Menaphos.",
    "2738": "Earn tier 10 reputation with the merchant faction in Menaphos.",
    "2739": "Earn tier 10 reputation with the ports faction in Menaphos.",
    "2740": "Earn tier 10 reputation with the worker faction in Menaphos.",
    "2741": "Complete this quest.",
    "2742": "Complete all of the listed research.",
    "2743": "Complete all of the listed research.",
    "2744": "Complete all of the listed research.",
    "2745": "Complete all of the listed research.",
    "2746": "Complete all of the listed research.",
    "2747": "Complete all of the listed research.",
    "2748": "Complete all of the listed research.",
    "2749": "Complete all of the listed research.",
    "2750": "Complete all of the listed research.",
    "2751": "Unlock all researchers.",
    "2752": "Defeat Taraket the Necromancer. (X/5)",
    "2753": "Defeat Taraket the Necromancer. (X/10)",
    "2754": "Defeat Taraket the Necromancer. (X/25)",
    "2755": "Defeat Taraket the Necromancer. (X/50)",
    "2756": "Defeat Taraket the Necromancer. (X/75)",
    "2757": "Defeat Taraket the Necromancer. (X/100)",
    "2758": "Defeat Taraket the Necromancer solo. (X/5)",
    "2759": "Defeat Taraket the Necromancer solo. (X/10)",
    "2760": "Defeat Taraket the Necromancer solo. (X/25)",
    "2761": "Defeat Taraket the Necromancer solo. (X/50)",
    "2762": "Defeat Taraket the Necromancer solo. (X/75)",
    "2763": "Defeat Taraket the Necromancer solo. (X/100)",
    "2764": "Pay respects and light the torches in Guthix's shrine.",
    "2765": "Chop a log from an elder tree you have grown in the Prifddinas farming patch, then fletch it into a shortbow. (X/2)",
    "2766": "Locate Rasial's tomb after 'Tomes of the Warlock'.",
    "2767": "Teleport to Varrock Dig Site using a Dig Site pendant.",
    "2768": "Defeat one of each revenant creature in the Forinthry dungeon.",
    "2769": "Obtained a collection of unique drops from Vindicta & Gorvek.",
    "2770": "Unlock all 5 of the god chisels from sculpting god statues and then talk to Copernicus Glyph.",
    "2771": "Collect your rewards for completing all Arc collections.",
    "2772": "Defeat Yakamaru after defeating all of its images and then allowing it to consume a durable jellyfish.",
    "2773": "Obtained a collection of unique drops from the Rex Matriarchs.",
    "2774": "Unlock the Rex Hatchling pet from Dagannoth Rex.",
    "2775": "Defeat any of the Rex Matriarchs. (X/1)",
    "2776": "Fully build the statue of Rhiannon in the Tower of Voices at least once.",
    "2777": "Unlock the Richie pet from helping Richie accumulate wealth at the Grand Exchange. (X/100,000,000)",
    "2778": "Defeat Solak, Guardian of the Grove without anyone siphoning Blight from the Anima storm.",
    "2779": "Ring the bell in Lumbridge's church.",
    "2780": "Unlock the runespan portal redirect.",
    "2781": "Complete this quest.",
    "2782": "Tune a bane sword or two-handed sword.",
    "2783": "Complete this quest.",
    "2784": "Decipher all four murals in the sunken temple.",
    "2785": "Pickpocket a Trahaearn elf while wearing the Trahaearn exoskeleton set.",
    "2786": "Recover the Grand Library's collection of valuable and unique gemstones.",
    "2787": "Defeat Vorago without anyone avoiding any falling rocks during the 'Ceiling Collapse' stage.",
    "2788": "Complete this quest.",
    "2789": "Defeat Raksha, the Shadow Colossus without moving during his 'Colossal Stomp' attack.",
    "2790": "Free the Wilderness portal rogue trader.",
    "2791": "Mine a ruby from a gem rock in Shilo Village.",
    "2792": "Open the sarcophagus in the final room of Pyramid Plunder.",
    "2793": "Complete this quest.",
    "2794": "Complete this quest.",
    "2795": "Pickpocket a guard in Varrock Palace's courtyard.",
    "2796": "Successfully complete all deep sea encounters.",
    "2797": "Complete this quest.",
    "2798": "Complete this quest.",
    "2799": "Complete this quest.",
    "2800": "Complete this quest.",
    "2801": "Complete this quest.",
    "2802": "Break a Blood Altar teletablet.",
    "2803": "Unlock the Runecrafting pet.",
    "2804": "Reach level 5 in the Runecrafting skill.",
    "2805": "Reach level 10 in the Runecrafting skill.",
    "2806": "Reach level 20 in the Runecrafting skill.",
    "2807": "Reach level 30 in the Runecrafting skill.",
    "2808": "Reach level 40 in the Runecrafting skill.",
    "2809": "Reach level 50 in the Runecrafting skill.",
    "2810": "Reach level 60 in the Runecrafting skill.",
    "2811": "Reach level 70 in the Runecrafting skill.",
    "2812": "Reach level 80 in the Runecrafting skill.",
    "2813": "Reach level 90 in the Runecrafting skill.",
    "2814": "Reach level 92 in the Runecrafting skill.",
    "2815": "Reach level 99 in the Runecrafting skill.",
    "2816": "Reach level 110 in the Runecrafting skill.",
    "2817": "Reach virtual level 120 in the Runecrafting skill.",
    "2818": "Mine pure essence on Lunar Isle.",
    "2819": "Take the order to Braindeath and claim the Rusty Anchor's bartender's reward.",
    "2820": "Avoid being damaged by twenty of the Queen Black Dragon's fire waves without defeat. Can only be completed in a solo instance.",
    "2821": "Talk to the Lumbridge Sage.",
    "2822": "Complete this quest.",
    "2823": "Fully explore what the Arc has to offer, and earn the right to claim the 'Salty' title.",
    "2824": "Defeat the Sanctum Guardian solo in less than 02:15.",
    "2825": "Defeat the Sanctum Guardian solo in less than 01:30.",
    "2826": "Complete all of the listed achievements.",
    "2827": "Complete the Sanctum of Rebirth dungeon in hard mode in a single run without anyone dying or leaving while completing the listed achievements.",
    "2828": "Obtained a collection of unique drops from Slayer monsters located within the Kharidian desert.",
    "2829": "Complete various achievements within Menaphos... and then some more to earn the right to claim the 'Sandy' title.",
    "2830": "Grapple over Yanille's south wall.",
    "2831": "Restored a collection of Saradominist artefacts.",
    "2832": "Hear one of Al the Camel's poems using a fully featured cramulet.",
    "2833": "Eat some perfectly cooked ox meat.",
    "2834": "Defeat Amascut, the Devourer in enrage mode without stopping any Scarabs from spawning.",
    "2835": "Complete the Scabaras research and present it to lead archaeologist Abigail.",
    "2836": "Own the Fury Shark outfit.",
    "2837": "Defeat Kezalam, the Wanderer without letting any Volatile scarab akh explode.",
    "2838": "Defeat Raksha after letting him reach 100% shadow energy in the first phase. Can only be completed in a solo instance.",
    "2839": "Complete this quest.",
    "2840": "Claim a jug of wine from the Observatory assistant after 'Observatory Quest'.",
    "2841": "Grow a healthy fruit tree in the patch near Brimhaven.",
    "2842": "Own the Warped Gorajan Trailblazer outfit.",
    "2843": "Obtain the hidden rewards after the 'Song from the Depths' quest.",
    "2844": "Find 'Vicendithas' Scribblings' located in the Edimmu Resource Dungeon.",
    "2845": "Find every scroll piece in Player Owned Ports.",
    "2846": "Unlock the Dungeoneering scroll traits.",
    "2847": "Use Zemouregal's scrying pool to spy on the citizens of New Varrock.",
    "2848": "Complete this quest.",
    "2849": "Craft an entire set of armour and weapons worthy of a Seasinger.",
    "2850": "Try to find out which is the mightiest tree in the forest.",
    "2851": "Unlock the ability to refresh the cooldown of adrenaline potions using the adrenaline crystals at War's Retreat.",
    "2852": "Solve this mystery.",
    "2853": "Solve this mystery.",
    "2854": "Use the crevice shortcut in Varrock Sewers, near the moss giants.",
    "2855": "Use the deposit chest near the Bedabin Camp.",
    "2856": "Cut five sets of yew logs. (X/5)",
    "2857": "Use your fire cape on TzTok-Jad before defeating them.",
    "2858": "Obtain five artefacts from Pyramid Plunder.",
    "2859": "Activate the lodestone in Seers' Village.",
    "2860": "Given by any seer in Seers' Village for completing all Easy Tasks in Seers' Village.",
    "2861": "Given by Sir Kay in Camelot Castle for completing all Elite Tasks in Seers' Village.",
    "2862": "Given by Sir Kay in Camelot Castle for completing all Hard Tasks in Seers' Village.",
    "2863": "Given by Stankers at the coal mine west of Seers' Village for completing all Medium Tasks in Seers' Village.",
    "2864": "Defeat Seiryu the Azure Serpent solo in less than 05:00.",
    "2865": "Defeat Seiryu the Azure Serpent solo in less than 03:00.",
    "2866": "Defeat Seiryu the Azure Serpent solo in less than 01:00.",
    "2867": "Defeat Seiryu the Azure Serpent solo in less than 01:30.",
    "2868": "Defeat Seiryu the Azure Serpent. (X/1)",
    "2869": "Collect all of the letters from the Senntisten dig.",
    "2870": "Deposit Seren memoriam crystals (from the Approach of Freneskae), then search the Sanctum alcove.",
    "2871": "Reach maximum reputation with the Seren faction in the Heart of Gielinor. (X/5,000)",
    "2872": "Burn a fiyr shade with pyre wood.",
    "2873": "Complete the base camp tutorial on Anachronia.",
    "2874": "Make a full suit of tier 1 armour (helm, body, legs, boots, gloves).",
    "2875": "Show the Wise Old Man your chromatic party hat.",
    "2876": "Cast Bloom using a Flail of Ivandis, upgraded with at least 200 burnt vyre corpses.",
    "2877": "Complete this quest.",
    "2878": "Kill a shadow warrior in the Legends' Guild basement.",
    "2879": "Solve this mystery.",
    "2880": "Claim all treasure from the chests during 'A Shadow over Ashdale', or talk to Gudrik to claim them afterwards.",
    "2881": "Complete this quest.",
    "2882": "Complete all of the listed achievements.",
    "2883": "Defeat Nex solo, without being hit by her 'Shadow Smash' attack during her Shadow phase.",
    "2884": "Defeat Nex solo, without moving during her Shadow phase until Nex has hit 120,000 lifepoints.",
    "2885": "Wave goodbye to a black hand.",
    "2886": "Survive the shadow beneath the barrows.",
    "2887": "Own the Magic Golem outfit.",
    "2888": "Bank a shark fished from the elven lands using the Elf Camp deposit box.",
    "2889": "Contribute all items to the collection.",
    "2890": "Contribute all items to the collection.",
    "2891": "Contribute all items to the collection.",
    "2892": "Contribute all items to the collection.",
    "2893": "Contribute all items to the collection.",
    "2894": "Contribute all items to the collection.",
    "2895": "Contribute all items to the collection.",
    "2896": "Complete world 10 in Shattered Worlds.",
    "2897": "Complete world 25 in Shattered Worlds.",
    "2898": "Complete world 50 in Shattered Worlds.",
    "2899": "Complete world 100 in Shattered Worlds.",
    "2900": "Complete world 150 in Shattered Worlds.",
    "2901": "Complete world 200 in Shattered Worlds.",
    "2902": "Defeat Kerapac, the bound without letting him send a rift of time from his 'Shatter' attack.",
    "2903": "Show Shrine Maiden Elei some sushi.",
    "2904": "Complete this quest.",
    "2905": "Complete this miniquest.",
    "2906": "Successfully breed a sheep with the Ravensworn trait.",
    "2907": "Speak to Edvard in the Abyss after 'Tortle Combat'.",
    "2908": "Catch a trout in the river to the east of Barbarian Village.",
    "2909": "Complete this quest.",
    "2910": "Complete this quest.",
    "2911": "Mine a diamond from a gem rock in Prifddinas while the Voice of Seren shines on the Trahaearn district.",
    "2912": "Charter a ship from the shipyard in the far east of Karamja.",
    "2913": "Defeat Kezalam, the Wanderer in hard mode. (X/5)",
    "2914": "Defeat Kezalam, the Wanderer in hard mode. (X/10)",
    "2915": "Defeat Kezalam, the Wanderer in hard mode. (X/25)",
    "2916": "Defeat Kezalam, the Wanderer in hard mode. (X/50)",
    "2917": "Defeat Kezalam, the Wanderer in hard mode. (X/75)",
    "2918": "Defeat Kezalam, the Wanderer in hard mode. (X/100)",
    "2919": "Explore Cairn Island to the west of Karamja.",
    "2920": "Catch some shrimp in the fishing spot to the east of Lumbridge Swamp.",
    "2921": "Unlock the Shrimpy pet from Har-Aken in the Fight Kiln.",
    "2922": "Kill a warped terrorbird or tortoise in the Warped Poison Waste Dungeon.",
    "2923": "Sabotage a Nodon siege engine.",
    "2924": "Sell silk to the silk trader in Ardougne for 60gp each by haggling.",
    "2925": "Create a divine location.",
    "2926": "Use the churn in the Sinclair Mansion garden.",
    "2927": "Help Lady Ithell with crystal singing research.",
    "2928": "During the Amlodd Voice of Seren : create a Titan's Constitution summoning scroll.",
    "2929": "During the Cadarn Voice of Seren : use a crystal bow to damage a Cadarn elf.",
    "2930": "During the Crwys Voice of Seren : cut a magic log in the Crwys district.",
    "2931": "During the Hefin Voice of Seren : complete one lap of the Hefin Agility Course successfully.",
    "2932": "During the Iorwerth Voice of Seren : use a crystal dagger to damage an Iorwerth elf.",
    "2933": "During the Meilyr Voice of Seren : craft a perfect juju farming potion using moss you harvested yourself.",
    "2934": "During the Trahaearn Voice of Seren : mine an adamantite or runite rock.",
    "2935": "Defeat Solak, Guardian of the Grove after using only one sigil to defeat Erethdor while Solak has at least 30% life points remaining.",
    "2936": "Defeat Taraket the Necromancer while the corpse carrier is still alive.",
    "2937": "Regular accounts, Ironman accounts, Hardcore Ironman accounts, and Regular Group Ironman accounts: | Complete a sinkhole. | Competitive Group Ironman: | Locate a sinkhole.",
    "2938": "Complete this quest.",
    "2939": "Contribute all items to the collection.",
    "2940": "Contribute all items to the collection.",
    "2941": "Contribute all items to the collection.",
    "2942": "Contribute all items to the collection.",
    "2943": "Climb to the top of the White Knights' Castle.",
    "2944": "Help the Odd Old Man complete his creepy tasks.",
    "2945": "Claim an elite clue scroll by defeating the skeletal horror.",
    "2946": "Complete this miniquest.",
    "2947": "Use Humidify to fill a waterskin while standing in the desert.",
    "2948": "Get water from a cactus in the desert.",
    "2949": "Slay a combination of 500 corrupted or devourer creatures. (X/500)",
    "2950": "Slay a combination of 1,000 corrupted or devourer creatures. (X/1,000)",
    "2951": "Slay a combination of 2,500 corrupted or devourer creatures. (X/2,500)",
    "2952": "Slay a combination of 5,000 corrupted or devourer creatures. (X/5,000)",
    "2953": "Slay a combination of 10,000 corrupted or devourer creatures. (X/10,000)",
    "2954": "Defeat Seiryu the Azure Serpent. (X/5)",
    "2955": "Defeat Seiryu the Azure Serpent. (X/10)",
    "2956": "Defeat Seiryu the Azure Serpent. (X/25)",
    "2957": "Defeat Seiryu the Azure Serpent. (X/50)",
    "2958": "Defeat Seiryu the Azure Serpent. (X/75)",
    "2959": "Defeat Seiryu the Azure Serpent. (X/100)",
    "2960": "Defeat Seiryu the Azure Serpent solo. (X/5)",
    "2961": "Defeat Seiryu the Azure Serpent solo. (X/10)",
    "2962": "Defeat Seiryu the Azure Serpent solo. (X/25)",
    "2963": "Defeat Seiryu the Azure Serpent solo. (X/50)",
    "2964": "Defeat Seiryu the Azure Serpent solo. (X/75)",
    "2965": "Defeat Seiryu the Azure Serpent solo. (X/100)",
    "2966": "Unlock the Slayer pet.",
    "2967": "Reach level 5 in the Slayer skill.",
    "2968": "Reach level 10 in the Slayer skill.",
    "2969": "Reach level 20 in the Slayer skill.",
    "2970": "Reach level 30 in the Slayer skill.",
    "2971": "Reach level 40 in the Slayer skill.",
    "2972": "Reach level 50 in the Slayer skill.",
    "2973": "Reach level 60 in the Slayer skill.",
    "2974": "Reach level 70 in the Slayer skill.",
    "2975": "Reach level 80 in the Slayer skill.",
    "2976": "Reach level 90 in the Slayer skill.",
    "2977": "Reach level 92 in the Slayer skill.",
    "2978": "Reach level 99 in the Slayer skill.",
    "2979": "Reach level 110 in the Slayer skill.",
    "2980": "Reach level 113 in the Slayer skill.",
    "2981": "Reach level 120 in the Slayer skill.",
    "2982": "Earn the title 'Slayer Master' from Morvran's platinum Rush of Blood challenge.",
    "2983": "Obtained a collection of unique drops from Slayer monsters located within Keldagrim.",
    "2984": "Solve a puzzle box.",
    "2985": "Defeat the Crassian Leviathan without anyone being hit by its 'Poisonous Breath' attack.",
    "2986": "Craft a water rune at the Water Altar.",
    "2987": "Complete this quest.",
    "2988": "Reach maximum reputation with the Sliske faction in the Heart of Gielinor. (X/5,000)",
    "2989": "Replay 'Sliske's Endgame' once to receive the 'Agent of the Eldest' cosmetic outfit override.",
    "2990": "Own the Master Camouflage outfit.",
    "2991": "Harvest 60 things from fruit tree patches in 4 minutes.",
    "2992": "Defeat Vorago in hard mode by personally using the Maul of Omens on him on any rotation.",
    "2993": "Unlock the Smithing pet.",
    "2994": "Reach level 5 in the Smithing skill.",
    "2995": "Reach level 10 in the Smithing skill.",
    "2996": "Reach level 20 in the Smithing skill.",
    "2997": "Reach level 30 in the Smithing skill.",
    "2998": "Reach level 40 in the Smithing skill.",
    "2999": "Reach level 50 in the Smithing skill.",
    "3000": "Reach level 60 in the Smithing skill.",
    "3001": "Reach level 70 in the Smithing skill.",
    "3002": "Reach level 80 in the Smithing skill.",
    "3003": "Reach level 90 in the Smithing skill.",
    "3004": "Reach level 92 in the Smithing skill.",
    "3005": "Reach level 99 in the Smithing skill.",
    "3006": "Reach level 110 in the Smithing skill.",
    "3007": "Reach virtual level 120 in the Smithing skill.",
    "3008": "Defeat Nex, Angel of Death in a team of 7 or fewer after having everyone tank all damage from her 'Smoke Blades' attack.",
    "3009": "Complete this quest.",
    "3010": "Create some bakriminel bolts from scratch in the Wilderness.",
    "3011": "Kill Smoulders while wearing the Demonic Skull.",
    "3012": "Enter the mole lair under Falador Park.",
    "3013": "Defeat Vindicta & Gorvek solo after using the correct protection prayer against their ranged attacks.",
    "3014": "Kill one guard on each tower of the Ranging Guild using a regular shieldbow.",
    "3015": "Own the Elder Divination outfit.",
    "3016": "Defeat the Arch-Glacor with all mechanics enabled.",
    "3017": "Defeat the Arch-Glacor in hard mode. (X/5)",
    "3018": "Defeat the Arch-Glacor in hard mode. (X/10)",
    "3019": "Defeat the Arch-Glacor in hard mode. (X/25)",
    "3020": "Defeat the Arch-Glacor in hard mode. (X/50)",
    "3021": "Defeat the Arch-Glacor in hard mode. (X/75)",
    "3022": "Defeat the Arch-Glacor in hard mode. (X/100)",
    "3023": "Defeat Nex, Angel of Death in a team of 7 or fewer without anyone being freed from her 'Icicle Slam' attack.",
    "3024": "Solve an easy runedoku casket.",
    "3025": "Defeat Solak, Guardian of the Grove without letting any Volatile rootling transform into a Blightbound lasher.",
    "3026": "Obtained a collection of unique drops from Solak, Guardian of the Grove.",
    "3027": "Read two bedtime stories to Vorkath.",
    "3028": "Own the Master Archaeologist's outfit.",
    "3029": "Defeat Solak, Guardian of the Grove in less than 06:00.",
    "3030": "Defeat Solak, Guardian of the Grove in less than 02:36.",
    "3031": "Defeat Solak, Guardian of the Grove in less than 03:45.",
    "3032": "Defeat Solak, Guardian of the Grove. (X/1)",
    "3033": "Defeat Solak, Guardian of the Grove while completing the listed achievements.",
    "3034": "Defeat Solak, Guardian of the Grove while completing the listed achievements.",
    "3035": "Feed the ghost cat their favourite fish.",
    "3036": "Unlock the Solly pet from Solak, Guardian of the Grove.",
    "3037": "Obtained a collection of unique drops from Croesus.",
    "3038": "Complete this quest.",
    "3039": "Find the Ancient, Dusty and Weathered Tarddian journals.",
    "3040": "Hand in each of the four Sq'irkjuices from the Sorceress's Garden minigame in one go.",
    "3041": "Defeat the six Barrows Brothers and loot their chest. (X/5)",
    "3042": "Defeat the six Barrows Brothers and loot their chest. (X/10)",
    "3043": "Defeat the six Barrows Brothers and loot their chest. (X/25)",
    "3044": "Defeat the six Barrows Brothers and loot their chest. (X/50)",
    "3045": "Defeat the six Barrows Brothers and loot their chest. (X/75)",
    "3046": "Defeat the six Barrows Brothers and loot their chest. (X/100)",
    "3047": "Defeat Vorago after receiving a total of 5000 damage from his 'Gas Cloud' attack.",
    "3048": "Complete this quest.",
    "3049": "Catch a grenwall in a crystallised trap.",
    "3050": "Contribute all items to the collection.",
    "3051": "Contribute all items to the collection.",
    "3052": "Contribute all items to the collection.",
    "3053": "Contribute all items to the collection.",
    "3054": "Obtain the 'Dark Lord' title by unlocking a selection of titles from Prifddinas.",
    "3055": "Defeat Vermyx, Brood Mother without being hit by her 'Soul Bomb' attack.",
    "3056": "Complete this quest.",
    "3057": "Defeat Vermyx, Brood Mother after redirecting all souls.",
    "3058": "Pick fruit from a sq'irk tree in the Sorceress' Garden without stopping.",
    "3059": "Infiltrate both the Black Arm Gang AND the Phoenix Gang in New Varrock.",
    "3060": "Unlock the ability to craft the listed Slayer items.",
    "3061": "Defeat Spyndra with one of Araxxi's legs, eyes, fang or web in your inventory.",
    "3062": "Successfully breed a spider with the Ravensworn trait.",
    "3063": "Defeat Barrows: Rise of the Six without anyone being hit by a 'Hurricane' attack.",
    "3064": "Surge under the spine on Anachronia.",
    "3065": "Set a spinebeam trap that you made yourself.",
    "3066": "Complete this quest.",
    "3067": "Defeat Hermod, the Spirit of War. (X/5)",
    "3068": "Defeat Hermod, the Spirit of War. (X/10)",
    "3069": "Defeat Hermod, the Spirit of War. (X/25)",
    "3070": "Defeat Hermod, the Spirit of War. (X/50)",
    "3071": "Defeat Hermod, the Spirit of War. (X/75)",
    "3072": "Defeat Hermod, the Spirit of War. (X/100)",
    "3073": "Complete this quest.",
    "3074": "Upgrade the chapel in Fort Forinthry to Tier 3.",
    "3075": "Complete this miniquest.",
    "3076": "Own the Infinity Ethereal outfit.",
    "3077": "Defeat Nakatra, Devourer Eternal in hard mode. (X/5)",
    "3078": "Defeat Nakatra, Devourer Eternal in hard mode. (X/10)",
    "3079": "Defeat Nakatra, Devourer Eternal in hard mode. (X/25)",
    "3080": "Defeat Nakatra, Devourer Eternal in hard mode. (X/50)",
    "3081": "Defeat Nakatra, Devourer Eternal in hard mode. (X/75)",
    "3082": "Defeat Nakatra, Devourer Eternal in hard mode. (X/100)",
    "3083": "Defeat a skeleton at Senntisten altar (or pray at Senntisten altar) with Soul Split enabled.",
    "3084": "Defeat Taraket the Necromancer without anyone defeating any of the 'Rifts of Undeath'.",
    "3085": "Defeat Solak, Guardian of the Grove without anyone being hit by a Blight bomb.",
    "3086": "Use a potato on the ancient Zygomite elder.",
    "3087": "Claim the coins from Yelps' cash bag after fighting him.",
    "3088": "Squish a corrupted scarab.",
    "3089": "Squish 10 corrupted scarabs. (X/10)",
    "3090": "Squish 50 corrupted scarabs. (X/50)",
    "3091": "Squish 100 corrupted scarabs. (X/100)",
    "3092": "Squish 200 corrupted scarabs. (X/200)",
    "3093": "Start a floor with 225 of any type of ammo bound to you.",
    "3094": "Complete the ritual to activate a totem on Anachronia.",
    "3095": "Kill a desert strykewyrm wearing a Full Slayer Helm and wielding an ancient staff.",
    "3096": "Climb the stairs within Brimhaven Dungeon.",
    "3097": "Find all Stalker notes.",
    "3098": "Deliver a pizza to a hungry highwayman.",
    "3099": "Have Eluned or Ilfeen recharge a teleport crystal for you in Isafdar.",
    "3100": "Defeat each of the six Legiones without moving.",
    "3101": "Use the noticeboard near the Observatory to gather information about shooting stars.",
    "3102": "Get knocked out by a shooting star.",
    "3103": "Fully complete the Stronghold of Player Safety.",
    "3104": "Fully complete the Stronghold of Security.",
    "3105": "Defeat the Twin Furies solo without being hit by Nymora's 'Rain Death' attack.",
    "3106": "Steal from a merchant in the Merchant District.",
    "3107": "Fully loot Archmage Sedridor's chest.",
    "3108": "Smith a steel longsword on the anvil in the jailhouse sewers.",
    "3109": "Perform the Salute emote in New Varrock while wearing level 20 armour.",
    "3110": "Complete this quest.",
    "3111": "Defeat Amascut, the Devourer in enrage mode without anyone taking damage from Volatile scarab akh and Explosive scarab akh.",
    "3112": "Defeat Bork.",
    "3113": "Use a Dorgeshuun spear on Bandos's throne.",
    "3114": "Venture through the cobwebbed corridor in Varrock's sewers.",
    "3115": "Have Sir Galahad make you a cup of tea.",
    "3116": "Place a scarecrow to protect your sweetcorn in the patch north of Port Sarim.",
    "3117": "Complete this quest.",
    "3118": "Observe all the large dragonkin statues around Anachronia. (X/5)",
    "3119": "Complete the Dahmaroc statue in your player-owned house.",
    "3120": "Defeat the Queen Black Dragon after having killed a Tortured Soul by only damaging them with chaos clouds.",
    "3121": "Defeat the Queen Black Dragon after cancelling the time stop attack.",
    "3122": "Create a stranger plant pouch at the Well of Voyage.",
    "3123": "Obtained a collection of unique drops from Rasial, the First Necromancer.",
    "3124": "Unlock the Strength pet.",
    "3125": "Reach level 5 in the Strength skill.",
    "3126": "Reach level 10 in the Strength skill.",
    "3127": "Reach level 20 in the Strength skill.",
    "3128": "Reach level 30 in the Strength skill.",
    "3129": "Reach level 40 in the Strength skill.",
    "3130": "Reach level 50 in the Strength skill.",
    "3131": "Reach level 60 in the Strength skill.",
    "3132": "Reach level 70 in the Strength skill.",
    "3133": "Reach level 80 in the Strength skill.",
    "3134": "Reach level 90 in the Strength skill.",
    "3135": "Reach level 92 in the Strength skill.",
    "3136": "Reach level 99 in the Strength skill.",
    "3137": "Reach virtual level 110 in the Strength skill.",
    "3138": "Reach virtual level 120 in the Strength skill.",
    "3139": "Defeat Masuta the Ascended with at least 7 thrashing waters still remaining.",
    "3140": "Have Thessalia show you what outfits you can wear.",
    "3141": "Kill a ghast in Morytania.",
    "3142": "Learn all of Kili's equipment upgrade tasks.",
    "3143": "Defeat Telos, the Warden at 100% or higher enrage after letting him reach a full anima bar in all 5 phases.",
    "3144": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage after not stunning Zamorak during the 'Infernal Tomb' or 'Decimate' attack and taking the full damage.",
    "3145": "Defeat the Giant Mole solo after stunning her during her 'Berserk' attack.",
    "3146": "Complete this quest.",
    "3147": "Deal at least 2,475 damage to a rock in a single swing. (Includes critical hits and rockertunities.)",
    "3148": "Claim the XP from all Wilderness spirit realm portals.",
    "3149": "Complete this quest.",
    "3150": "Unlock the Summoning pet.",
    "3151": "Reach level 5 in the Summoning skill.",
    "3152": "Reach level 10 in the Summoning skill.",
    "3153": "Reach level 20 in the Summoning skill.",
    "3154": "Reach level 30 in the Summoning skill.",
    "3155": "Reach level 40 in the Summoning skill.",
    "3156": "Reach level 50 in the Summoning skill.",
    "3157": "Reach level 60 in the Summoning skill.",
    "3158": "Reach level 70 in the Summoning skill.",
    "3159": "Reach level 80 in the Summoning skill.",
    "3160": "Reach level 90 in the Summoning skill.",
    "3161": "Reach level 92 in the Summoning skill.",
    "3162": "Reach level 99 in the Summoning skill.",
    "3163": "Reach virtual level 110 in the Summoning skill.",
    "3164": "Reach virtual level 120 in the Summoning skill.",
    "3165": "Plant a dominion marker in the desert, with all its achievements complete, including killing Sunfreet.",
    "3166": "Defeat Commander Zilyana in hard mode, solo, whilst under the effects of her 'Lightning' attack and the Sunshine ability.",
    "3167": "Excavate in the Infernal Source while having the Superheat Form curse active.",
    "3168": "Obtained a collection of unique drops from the Magister.",
    "3169": "Defeat Verak Lith. (X/5)",
    "3170": "Defeat Verak Lith. (X/10)",
    "3171": "Defeat Verak Lith. (X/25)",
    "3172": "Defeat Verak Lith. (X/50)",
    "3173": "Defeat Verak Lith. (X/75)",
    "3174": "Defeat Verak Lith. (X/100)",
    "3175": "Defeat Verak Lith solo. (X/5)",
    "3176": "Defeat Verak Lith solo. (X/10)",
    "3177": "Defeat Verak Lith solo. (X/25)",
    "3178": "Defeat Verak Lith solo. (X/50)",
    "3179": "Defeat Verak Lith solo. (X/75)",
    "3180": "Defeat Verak Lith solo. (X/100)",
    "3181": "Defeat Astellarn the First Celestial without anyone killing a 'Pulsar'.",
    "3182": "Complete five supply runs after 'Death Plateau'.",
    "3183": "Unlock the Supreme Hatchling pet from Dagannoth Supreme.",
    "3184": "Defeat Croesus. (X/5)",
    "3185": "Defeat Croesus. (X/10)",
    "3186": "Defeat Croesus. (X/25)",
    "3187": "Defeat Croesus. (X/50)",
    "3188": "Defeat Croesus. (X/75)",
    "3189": "Defeat Croesus. (X/100)",
    "3190": "Complete this quest.",
    "3191": "Complete this quest.",
    "3192": "Defeat Masuta the Ascended with 65% of the calm waters effect or more.",
    "3193": "Use a steel pickaxe or better to mine some ore.",
    "3194": "Complete a lap going in each direction on the Anachronia agility course.",
    "3195": "Defeat Barrows: Rise of the Six without anyone being hit by Guthan's 'Impale' attack.",
    "3196": "Unlock the War's Retreat teleport spell.",
    "3197": "Flee from any boss using a self-made gatestone.",
    "3198": "Collect all 22 pages of dragonkin research in the Dragonkin Laboratory. (X/22)",
    "3199": "Complete this quest.",
    "3200": "View the recent wilderness kills on the death list noticeboard in Edgeville.",
    "3201": "Reset your current floor progress.",
    "3202": "Deliver the knight's notes from the God Wars Dungeon to Sir Tiffy Cashien.",
    "3203": "Mine some copper in the mining spot to the south-east of Lumbridge Swamp.",
    "3204": "Mine granite at the quarry south of the Bandit Camp.",
    "3205": "Enter the chaos tunnels from an entrance in the Wilderness.",
    "3206": "Unlock every Talent from the Well of Souls.",
    "3207": "Complete this miniquest.",
    "3208": "Complete a Fremennik Saga (abridged or unabridged) after talking to Skaldrun.",
    "3209": "Complete this miniquest.",
    "3210": "Defeat Taraket the Necromancer while both the bloated monstrosity and corpse carrier are still alive.",
    "3211": "Defeat Taraket the Necromancer solo in less than 04:00.",
    "3212": "Defeat Taraket the Necromancer solo in less than 03:00.",
    "3213": "Defeat Taraket the Necromancer. (X/1)",
    "3214": "Defeat Vorago after he has reflected an Ultimate ability through each of his 'Target Link' attacks.",
    "3215": "Defeat Solak, Guardian of the Grove without letting any spore bombs hit the ground during his 'Earthen Seed' attack.",
    "3216": "Complete all the listed area achievement sets.",
    "3217": "Unlock the Tim and Crunchy pets during or after 'Gower Quest'.",
    "3218": "Give Thurgo a redberry pie in the Warforge.",
    "3219": "Activate the lodestone in Taverley.",
    "3220": "Bring Helen the perfect cup of tea at the Archaeology campus.",
    "3221": "Complete this quest.",
    "3222": "Solve this mystery.",
    "3223": "Defeat Telos. (X/1)",
    "3224": "Defeat Telos, the Warden for a 100 killstreak.",
    "3225": "Defeat Telos, the Warden for a 200 killstreak.",
    "3226": "Defeat Telos, the Warden at 300% or higher enrage in less than 04:00.",
    "3227": "Defeat Telos, the Warden at 4000% or higher enrage in less than 02:30.",
    "3228": "Defeat Telos at 50% enrage. (X/50)",
    "3229": "Defeat Telos at 100% enrage. (X/100)",
    "3230": "Defeat Telos at 250% enrage. (X/250)",
    "3231": "Defeat Telos at 500% enrage. (X/500)",
    "3232": "Defeat Telos at 750% enrage. (X/750)",
    "3233": "Defeat Telos at 1,000% enrage. (X/1,000)",
    "3234": "Defeat Telos, the Warden at 2,000% enrage.",
    "3235": "Defeat Telos, the Warden at 1000% or higher enrage in less than 03:15.",
    "3236": "Defeat Telos. (X/5)",
    "3237": "Defeat Telos. (X/10)",
    "3238": "Defeat Telos. (X/25)",
    "3239": "Defeat Telos. (X/50)",
    "3240": "Defeat Telos. (X/75)",
    "3241": "Defeat Telos. (X/100)",
    "3242": "Complete all of the listed achievements.",
    "3243": "Complete this quest.",
    "3244": "Gain 75+ Slayer points from Lapalok.",
    "3245": "Reach a score of 10 using the strange switches in the Wilderness.",
    "3246": "Defeat the Har-Aken without defeating any of his tentacles.",
    "3247": "Unlock the Tess pet from Telos in the Heart of Gielinor.",
    "3248": "Craft an entire set of armour and weapons worthy of a Tetsu warrior.",
    "3249": "Exchange a familiar pouch for shards with Lord Amlodd.",
    "3250": "Charter the Lady of the Waves from Cairn Isle to Port Khazard.",
    "3251": "Harvest memories from a tier 8 (or higher) spring.",
    "3252": "Complete this quest.",
    "3253": "Claim 10,000 coins from Bill Teach after 'Cabin Fever'.",
    "3254": "Try to enter the Grand Library.",
    "3255": "Exchange gems for a machete.",
    "3256": "Experiment with one of Howl's prototype weapons.",
    "3257": "Defeat the Magister after cancelling his 'Soul Siphon' attack.",
    "3258": "Defeat the Ambassador. (X/1)",
    "3259": "Defeat the Ambassador solo in less than 06:00.",
    "3260": "Defeat the Ambassador solo in less than 04:00.",
    "3261": "Defeat the Ambassador solo in less than 1:45.",
    "3262": "Defeat the Ambassador solo in less than 02:30.",
    "3263": "Obtained a collection of unique drops from Slayer monsters located within lost lands and dungeons around Gielinor.",
    "3264": "Recover data for 50 backup memory-storage bots in the Hall of Memories. (X/50)",
    "3265": "Defeat the six Barrows Brothers and loot their chest. (X/1)",
    "3266": "Defeat the empowered Barrows Brothers. (X/1)",
    "3267": "Start any ale brewing below the Green Ghost Inn.",
    "3268": "Defeat Seiryu the Azure Serpent, the Black Stone Dragon and the Ambassador consecutively.",
    "3269": "Complete this quest.",
    "3270": "Browse through Oziach's Armour Shop.",
    "3271": "Collect all 22 pages of Elei's Diary in the Temple of Aminishi. (X/22)",
    "3272": "Complete this quest.",
    "3273": "Complete this quest.",
    "3274": "Complete this quest.",
    "3275": "Use Pawya meat in a grenwall trap.",
    "3276": "Obtained a collection of unique drops from master clue scrolls.",
    "3277": "Mine some coal at the site between Witchaven and the Legends' Guild.",
    "3278": "Obtained a collection of unique drops from the Arch-Glacor.",
    "3279": "Contribute all items to any collection. (X/1)",
    "3280": "Contribute all items to any collection. (X/5)",
    "3281": "Contribute all items to any collection. (X/10)",
    "3282": "Contribute all items to any collection. (X/25)",
    "3283": "Contribute all items to any collection. (X/50)",
    "3284": "Contribute all items to any collection. (X/100)",
    "3285": "Contribute all items to any collection. (X/150)",
    "3286": "Contribute all items to any collection. (X/200)",
    "3287": "Visit Seren and bow or curtsy whilst wearing the Crest of Seren.",
    "3288": "Unlock all non-cosmetic Hunter upgrades from Dundee's Shop.",
    "3289": "Solve this mystery.",
    "3290": "Complete this quest.",
    "3291": "Gaze into the dark star.",
    "3292": "Complete this quest.",
    "3293": "Complete this quest.",
    "3294": "Complete this quest.",
    "3295": "Find and speak to the elf lords and ladies from each of the eight clans inside the walls of Prifddinas. (X/8)",
    "3296": "Excavate damaged artefacts. (X/1)",
    "3297": "Excavate damaged artefacts. (X/5)",
    "3298": "Excavate damaged artefacts. (X/10)",
    "3299": "Excavate damaged artefacts. (X/25)",
    "3300": "Excavate damaged artefacts. (X/50)",
    "3301": "Excavate damaged artefacts. (X/100)",
    "3302": "Excavate damaged artefacts. (X/250)",
    "3303": "Excavate damaged artefacts. (X/500)",
    "3304": "Excavate damaged artefacts. (X/1,000)",
    "3305": "Excavate damaged artefacts. (X/2,500)",
    "3306": "Obtain the Distracted title by completing distractions and diversions.",
    "3307": "Donate artefacts to the museum. (X/1)",
    "3308": "Donate artefacts to the museum. (X/25)",
    "3309": "Donate artefacts to the museum. (X/50)",
    "3310": "Donate artefacts to the museum. (X/100)",
    "3311": "Donate artefacts to the museum. (X/250)",
    "3312": "Solve this mystery.",
    "3313": "Defeat Zemouregal without killing Vorkath.",
    "3314": "Defeat Zemouregal in hard mode without killing Vorkath.",
    "3315": "Complete this quest.",
    "3316": "Fully upgrade the Shadow Pontifex ring.",
    "3317": "Complete all of the listed achievements.",
    "3318": "Solve this mystery.",
    "3319": "Have Wizard Cromperty teleport you to the essence mine.",
    "3320": "Solve this mystery.",
    "3321": "Create a grand ranging potion in a crystal flask from nothing but raw ingredients.",
    "3322": "Complete this quest.",
    "3323": "Attempt to be funny and show a primal feast to someone who won't appreciate it at Stormguard.",
    "3324": "Complete this quest.",
    "3325": "Defeat Verak Lith without being hit by their 'Flame Vortex' attack.",
    "3326": "Complete this quest.",
    "3327": "Claim a fire creature pet from Char's training cave after 'The Firemaker's Curse'.",
    "3328": "Solve this mystery.",
    "3329": "Defeat Zemouregal & Vorkath in hard mode without taking damage from poison.",
    "3330": "Defeat Zemouregal & Vorkath in hard mode without taking damage from their 'Bone Spikes' attack.",
    "3331": "Solve this mystery.",
    "3332": "Complete this quest.",
    "3333": "Complete this quest.",
    "3334": "Sell a raw shrimp to Lumbridge's fishing shop.",
    "3335": "Slow down the regrowth of fungus on a dead creature during a Croesus encounter. (X/1)",
    "3336": "Cleanse the Gate of Elidinis. (X/1)",
    "3337": "Complete this quest.",
    "3338": "Unlock all Hunter upgrades from Dundee's Shop.",
    "3339": "Complete this quest.",
    "3340": "Buy a stat-boosting beer from a waitress in the Rising Sun tavern.",
    "3341": "Complete the Barbarian Outpost Agility Course.",
    "3342": "Complete this quest.",
    "3343": "Complete this quest.",
    "3344": "Create the listed gnome cocktails.",
    "3345": "Learn a lesson from Lea outside the Invention Guild.",
    "3346": "Complete this quest.",
    "3347": "Kill anything on the first floor (upstairs) of the Slayer Tower.",
    "3348": "Uncover all of the murals inside the Sunken Pyramid.",
    "3349": "Beat every boss in Daemonheim.",
    "3350": "Find and follow the recipe for the Infernal Sauce.",
    "3351": "Completed every collection log from all bosses.",
    "3352": "Complete this quest.",
    "3353": "Obtain the Journal of Fell Arnessen from the Arch Glacor.",
    "3354": "Repair a piece of armour at an anvil.",
    "3355": "Complete this quest.",
    "3356": "Mine light animica while the Voice of Seren shines on the Trahaearn district.",
    "3357": "Complete this quest.",
    "3358": "Complete a dungeon, solo.",
    "3359": "Make a magic shieldbow from scratch within the Seers' Village area.",
    "3360": "Complete this quest.",
    "3361": "Complete this quest.",
    "3362": "Defeat the Magister. (X/1)",
    "3363": "Defeat the Magister in less than 00:45.",
    "3364": "Defeat the Magister in less than 00:30.",
    "3365": "Defeat the Magister in less than 00:12.",
    "3366": "Collect the following lore books from bosses inside the Temple of Aminishi.",
    "3367": "Complete this quest.",
    "3368": "Defeat Vorago by personally using the Maul of Omens on him on every rotation.",
    "3369": "Kill a mogre at Mudskipper Point.",
    "3370": "Use the Tirannwn lodestone.",
    "3371": "Complete this quest.",
    "3372": "Complete a perfect shifting tombs run with a shifting tombs reward enhancer. (X/1)",
    "3373": "Complete 5 perfect shifting tombs runs with a shifting tombs reward enhancer. (X/5)",
    "3374": "Complete 10 perfect shifting tombs runs with a shifting tombs reward enhancer. (X/10)",
    "3375": "Complete 25 perfect shifting tombs runs with a shifting tombs reward enhancer. (X/25)",
    "3376": "Buy something from the Lupe's Soul Supplies shop in the City of Um.",
    "3377": "Defeat Raksha, the Shadow Colossus without being stunned by his 'Tail Sweep', 'Trampling Charge' and 'Shadow bomb' attacks.",
    "3378": "Complete this quest.",
    "3379": "Use Potterington Blend #102 Fertiliser or dinosaur 'propellant' on Prehistoric Potterington.",
    "3380": "Equip a TzHaar fire cape while standing in TzHaar.",
    "3381": "Complete this quest.",
    "3382": "Purchase all permanent unlocks from Ezreal's shop at the Archaeology Guild. (X/7)",
    "3383": "Gather the following items in Misthalin. (X/4)",
    "3384": "Defeat the Violet Lotus miniboss using elite death lotus darts.",
    "3385": "Obtain the Ravensworn title by spotting 13 ravens in Prifddinas.",
    "3386": "Take a part in a Zamorakian wedding ceremony inside the chaos church. Requires a preacher with an unholy book, and at least two participants with the Retribution prayer active.",
    "3387": "Send your research team out on field studies. Tracked in hours. (X/24)",
    "3388": "Send your research team out on field studies. Tracked in hours. (X/48)",
    "3389": "Send your research team out on field studies. Tracked in hours. (X/72)",
    "3390": "Send your research team out on field studies. Tracked in hours. (X/168)",
    "3391": "Send your research team out on field studies. Tracked in hours. (X/336)",
    "3392": "Send your research team out on field studies. Tracked in hours. (X/672)",
    "3393": "Send your research team out on field studies. Tracked in hours. (X/1,440)",
    "3394": "Complete this quest.",
    "3395": "Restore damaged artefacts. (X/1)",
    "3396": "Restore damaged artefacts. (X/5)",
    "3397": "Restore damaged artefacts. (X/10)",
    "3398": "Restore damaged artefacts. (X/25)",
    "3399": "Restore damaged artefacts. (X/50)",
    "3400": "Restore damaged artefacts. (X/100)",
    "3401": "Restore damaged artefacts. (X/250)",
    "3402": "Restore damaged artefacts. (X/500)",
    "3403": "Restore damaged artefacts. (X/1,000)",
    "3404": "Restore damaged artefacts. (X/2,500)",
    "3405": "Reach inside the Motherlode Maw. (X/1)",
    "3406": "Reach inside the Motherlode Maw 5 times. (X/5)",
    "3407": "Reach inside the Motherlode Maw 10 times. (X/10)",
    "3408": "Reach inside the Motherlode Maw 25 times. (X/25)",
    "3409": "Harvest a Limpwurt Root from the Farming patch in the Western Ruins.",
    "3410": "Chop the vines to gain deeper access to Brimhaven Dungeon.",
    "3411": "Find out about the Rules of Conduct from the town crier in Draynor.",
    "3412": "Defeat the Sanctum Guardian. (X/1)",
    "3413": "Cut each of the listed gems.",
    "3414": "Kill the following enemies in Misthalin.",
    "3415": "Catch the golden butterfly.",
    "3416": "Obtained a collection of unique drops from the Shadow Reef elite dungeon.",
    "3417": "String a magic shortbow in Seers' Village bank.",
    "3418": "Complete this quest.",
    "3419": "Complete this quest.",
    "3420": "Solve this mystery.",
    "3421": "Obtained a collection of unique drops from Slayer monsters located within the Fremennik Province.",
    "3422": "Enter the Mining Guild.",
    "3423": "Defeat Nakatra, Devourer Eternal without being hit by her 'Sanctum Hieroglyphs' attack.",
    "3424": "Complete this quest.",
    "3425": "Complete this quest.",
    "3426": "Complete this quest.",
    "3427": "Defeat the Arch-Glacor at 4,000% enrage.",
    "3428": "Defeat Telos, the Warden at 4,000% enrage.",
    "3429": "Defeat Avaryss and Nymora. (X/1)",
    "3430": "Completed every collection within the Slayer collection log. (X/13)",
    "3431": "Defeat Kerapac, the bound in hard mode without entering an echo's time thread.",
    "3432": "Solve this mystery.",
    "3433": "Complete this quest.",
    "3434": "Complete this quest.",
    "3435": "Imbue a catalytic wand on a runecrafting altar.",
    "3436": "Loot from all safes within Gielinor. (X/5)",
    "3437": "Complete this quest.",
    "3438": "Find and restore all 22 pages from the burnt grimoire in the Zamorakian Undercity. (X/22)",
    "3439": "Exchange ecto-tokens for brewing yeast with Metarialus in The Green Ghost inn's cellar.",
    "3440": "Complete all of the listed achievements.",
    "3441": "Defeat Amascut, the Devourer at 1000% or higher enrage without damaging the Engulfing Shadow during phase 6.",
    "3442": "Defeat Vorago after mitigating all damage from his 'Waterfall' attack in stage 4.",
    "3443": "Charge an orb at the obelisk of air.",
    "3444": "Travel from Port Sarim to Musa Point for free (with a little help from Charos).",
    "3445": "Defeat K'ril Tsutsaroth, solo, after using 'Debilitate' to mitigate his 'Prayer Destruction' attack.",
    "3446": "Defeat the Dagannoth Kings solo, all within 5 seconds of each other.",
    "3447": "Find a way to silence Romeo, in Zemouregal's study.",
    "3448": "Pickpocket a Falador guard.",
    "3449": "Earn 100% favour in the village of Tai Bwo Wannai.",
    "3450": "Defeat Vermyx, Brood Mother, while four of her coilspawn are still alive.",
    "3451": "Hand in your stick at the end of the Werewolf Agility Course.",
    "3452": "Talk to Tindel Marchant about identifying swords on Kandarin's east coast.",
    "3453": "Unlock the Thieving pet.",
    "3454": "Reach level 5 in the Thieving skill.",
    "3455": "Reach level 10 in the Thieving skill.",
    "3456": "Reach level 20 in the Thieving skill.",
    "3457": "Reach level 30 in the Thieving skill.",
    "3458": "Reach level 40 in the Thieving skill.",
    "3459": "Reach level 50 in the Thieving skill.",
    "3460": "Reach level 60 in the Thieving skill.",
    "3461": "Reach level 70 in the Thieving skill.",
    "3462": "Reach level 80 in the Thieving skill.",
    "3463": "Reach level 90 in the Thieving skill.",
    "3464": "Reach level 92 in the Thieving skill.",
    "3465": "Reach level 99 in the Thieving skill.",
    "3466": "Reach level 110 in the Thieving skill.",
    "3467": "Reach level 113 in the Thieving skill.",
    "3468": "Reach level 120 in the Thieving skill.",
    "3469": "Obtained a collection of all unique drops from elite clue scrolls.",
    "3470": "Defeat Solak, Guardian of the Grove after siphoning all Blight from the Anima storm.",
    "3471": "Deliver some extra spicy crunchies to Dundee.",
    "3472": "Smith a rune hasta at Otto's anvil.",
    "3473": "Defeat Helwyr. (X/5)",
    "3474": "Defeat Helwyr. (X/10)",
    "3475": "Defeat Helwyr. (X/25)",
    "3476": "Defeat Helwyr. (X/50)",
    "3477": "Defeat Helwyr. (X/75)",
    "3478": "Defeat Helwyr. (X/100)",
    "3479": "Open a love letter from a JMod.",
    "3480": "Defeat Rasial, the First Necromancer without being hit by his 'Volley of Souls' attack.",
    "3481": "Defeat Amascut, the Devourer in enrage mode after allowing her to enter phase 7 with 75% of her lifepoints remaining.",
    "3482": "Conduct a musical performance within the amphitheatre at Everlight.",
    "3483": "Complete this saga.",
    "3484": "Complete this saga.",
    "3485": "Summon a ghast familiar in Morytania.",
    "3486": "Defeat Helwyr solo without being hit by his 'Thrash' attack.",
    "3487": "Defeat the King Black Dragon. (X/5)",
    "3488": "Defeat the King Black Dragon. (X/10)",
    "3489": "Defeat the King Black Dragon. (X/25)",
    "3490": "Defeat the King Black Dragon. (X/50)",
    "3491": "Defeat the King Black Dragon. (X/75)",
    "3492": "Defeat the King Black Dragon. (X/100)",
    "3493": "Complete a big game encounter with 3 creatures active.",
    "3494": "Defeat TzKal-Zuk in hard mode in a single run without moving from the challenger's tile in wave 16.",
    "3495": "Claim the enhanced fire cape override from TzHaar-Mej-Jeh, by completing the Fight Kiln once with each of the following combat styles: Melee, Ranged, and Magic.",
    "3496": "Complete this saga.",
    "3497": "Complete this quest.",
    "3498": "Witness Jas task Kerapac with retrieving her kin.",
    "3499": "Kill the Queen Black Dragon with a royal crossbow. Can only be completed in a solo instance.",
    "3500": "Make a chinchompa explode (by accident).",
    "3501": "Smith or craft a piece of level 10 armour in New Varrock.",
    "3502": "Complete 1 clue of each tier.",
    "3503": "Sit down with Tiffy in Falador park.",
    "3504": "Defeat Kerapac, the bound. (X/5)",
    "3505": "Defeat Kerapac, the bound. (X/10)",
    "3506": "Defeat Kerapac. (X/25)",
    "3507": "Defeat Kerapac. (X/50)",
    "3508": "Defeat Kerapac. (X/75)",
    "3509": "Defeat Kerapac. (X/100)",
    "3510": "Use the shortcut to cross the River Salve without going through the temple.",
    "3511": "Solve this mystery.",
    "3512": "Play the organ in Lumbridge's church.",
    "3513": "Activate the lodestone in Tirannwn.",
    "3514": "Given by the elf tracker near the Tirannwn lodestone for completing all Easy Tasks in Tirannwn.",
    "3515": "Given by Elen at the Max Guild for completing all Elite Tasks in Tirannwn.",
    "3516": "Given by Arianwyn in the Cadarn district for completing all Hard Tasks in Tirannwn.",
    "3517": "Given by Gwir in Lletya for completing all Medium Tasks in Tirannwn.",
    "3518": "Craft some flesh runes.",
    "3519": "Fully complete the slayer codex.",
    "3520": "Defeat Vorago without anyone being hit by his 'Destroy Tank' attack in stages 2, 4, and 5.",
    "3521": "Catch a karambwan.",
    "3522": "Help Pastkeeper Sharrigan to remember all stories within the 'Dream of Iaia'.",
    "3523": "Defeat Vorago without anyone being hit by a Scopulus during the 'Scopulus' stage.",
    "3524": "Thaw all the frozen snow implings in Yeti Town after 'Violet is Blue'. (X/4)",
    "3525": "Defeat TokHaar-Hok in the Fight Cauldron minigame using only obsidian equipment.",
    "3526": "Complete this quest.",
    "3527": "Collect the following lore books from bosses inside the Sanctum of Rebirth.",
    "3528": "Complete this quest.",
    "3529": "Defeat Nex solo, without being moved by her 'Drag' attack during her Smoke phase.",
    "3530": "Defeat Nex, Angel of Death in a team of 7 or fewer after she absorbs 5 reavers in phase 1.",
    "3531": "Defeat Nakatra, Devourer Eternal without being hit by her 'Soulfire' attack.",
    "3532": "Defeat Osseous solo after defeating 6 Baby Dinosaur Skeletons within 9s.",
    "3533": "Defeat Helwyr solo without being hit by his 'The Aid of Nature' attack.",
    "3534": "Defeat Helwyr in hard mode, solo, without being hit by his 'Mushroom Explosion' attack.",
    "3535": "Help find Toothless's tooth.",
    "3536": "Create a promethium full helm from scratch.",
    "3537": "Feed a baby troll to Chito.",
    "3538": "Use a lockpick to access Zemouregal's lost property chest (in his study).",
    "3539": "Fully upgrade the Town Hall in the base camp on Anachronia.",
    "3540": "Unlock the Torag bobblehead from Rise of the Six.",
    "3541": "Defeat Kezalam, the Wanderer after destroying each Moonstone obelisk before she finishes charging her attack.",
    "3542": "Defeat Kree'arra solo, without being moved by his 'Ranged Tornado' and 'Magic Tornado' attacks.",
    "3543": "Complete this miniquest.",
    "3544": "Non-ironman: | Hand in a total of 20 items in a single sinkhole. | Ironman: | Enter the 6 resource dungeons with an entry requirement equal to or less than Dungeoneering level 35 within 6 minutes.",
    "3545": "Equip a full set of desert clothing while standing in the desert.",
    "3546": "Take one of Ed's boat tours.",
    "3547": "Complete this quest.",
    "3548": "Climb to the top of the Wizards' Tower.",
    "3549": "Solve a Towers puzzle.",
    "3550": "Defeat the Crassian Leviathan without anyone poisoning it.",
    "3551": "Sell something to one of New Varrock's many shops.",
    "3552": "Defeat Commander Zilyana whilst wearing a full set of Proselyte Armour. Can only be completed in a solo instance.",
    "3553": "Use an ectophial to return to Port Phasmatys.",
    "3554": "Use the stepping stone across the river in Shilo village[sic].",
    "3555": "Complete 1 clue of any tier. (X/1)",
    "3556": "Complete 5 clues of any tier. (X/5)",
    "3557": "Complete 10 clues of any tier. (X/10)",
    "3558": "Complete 25 clues of any tier. (X/25)",
    "3559": "Complete 50 clues of any tier. (X/50)",
    "3560": "Complete 100 clues of any tier. (X/100)",
    "3561": "Complete 250 clues of any tier. (X/250)",
    "3562": "Complete 500 clues of any tier. (X/500)",
    "3563": "Complete 750 clues of any tier. (X/750)",
    "3564": "Complete 1000 clues of any tier. (X/1,000)",
    "3565": "Complete this quest.",
    "3566": "Take a hard companion through a hard route of Temple Trekking.",
    "3567": "Claim the Helmet of Trials.",
    "3568": "Complete this quest.",
    "3569": "Discover all the trinkets and restore the old necklace after 'You Are It'.",
    "3570": "Complete all these to be able to obtain the trimmed completionist cape. (X/81)",
    "3571": "Hunt a plover bird in Sophanem.",
    "3572": "Complete one of the trio storylines from your Player Owned Port. (X/4)",
    "3573": "Unlock the post-quest rewards of Tamayu, Tinsay and Tiadeche.",
    "3574": "Complete this quest.",
    "3575": "Complete this quest.",
    "3576": "Find all of the memoriam crystals in Prifddinas.",
    "3577": "Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Smash' attack.",
    "3578": "Complete this miniquest.",
    "3579": "Complete this quest.",
    "3580": "Defeat the Twin Furies solo in hard mode in less than 01:00.",
    "3581": "Defeat the Twin Furies solo in hard mode in less than 00:45.",
    "3582": "Defeat the Twin Furies solo in less than 02:00.",
    "3583": "Defeat the Twin Furies solo in less than 00:48.",
    "3584": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Lightning Conductor' attack and Ahrim's 'Turret of Fire' attack.",
    "3585": "Burn a magic log in Seers' Village.",
    "3586": "Free Klenter's soul during or after 'Icthlarin's Little Helper'.",
    "3587": "Obtained a collection of unique drops from Raksha, the Shadow Colossus.",
    "3588": "Equip a Tyras helm inside Tyras Camp.",
    "3589": "Attempt the TzHaar Fight Pit or Fight Cave.",
    "3590": "Defeat TzKal-Zuk. (X/1)",
    "3591": "Defeat TzKal-Zuk in hard mode in less than 13:30.",
    "3592": "Defeat TzKal-Zuk in hard mode in less than 16:00.",
    "3593": "Defeat TzKal-Zuk in less than 20:00.",
    "3594": "Defeat TzKal-Zuk in less than 12:30.",
    "3595": "Bring TzKal-Zuk a Chimp ice.",
    "3596": "Unlock the TzRek-Jad pet from Jad in the Fight Caves.",
    "3597": "Defeat TzTok-Jad. (X/1)",
    "3598": "Defeat TzTok-Jad in less than 01:00:00.",
    "3599": "Defeat TzTok-Jad in less than 45:00.",
    "3600": "Make an ugthanki kebab from raw ingredients in Nardah.",
    "3601": "Have at least 50 Penguin Points at once.",
    "3602": "Claim and read the Codex Ultimatus.",
    "3603": "Defeat Raksha without letting him gain any shadow energy. Can only be completed in a solo instance.",
    "3604": "Meet all of the listed inhabitants of Um.",
    "3605": "Collect all 22 pages of Umbral Diplomacy in the Shadow Reef. (X/22)",
    "3606": "Create a spirit kalphite pouch at the obelisk south west of Pollnivneach.",
    "3607": "Travel to an uncharted island. (X/1)",
    "3608": "Travel to 5 uncharted islands. (X/5)",
    "3609": "Travel to 10 uncharted islands. (X/10)",
    "3610": "Travel to 25 uncharted islands. (X/25)",
    "3611": "Travel to 50 uncharted islands. (X/50)",
    "3612": "Travel to 100 uncharted islands. (X/100)",
    "3613": "Aid Lady Trahaearn in removing some corruption by smelting 100 corrupted ore.",
    "3614": "Teleport to the Ungael ritual site using the Ungael Teleport incantation.",
    "3615": "Gain access to the secret treasure room from 'Crocodile Tears'.",
    "3616": "Complete this quest.",
    "3617": "Given by Icthlarin, near the ritual site in the City of Um, for completing all Easy Tasks in the Underworld.",
    "3618": "Given by Crunchy, in The Last Call in Um, for completing all Elite Tasks in the Underworld.",
    "3619": "Given by Kili, by the smithy in Um, for completing all Hard Tasks in the Underworld.",
    "3620": "Given by Frank, east of the main plaza in Um, for completing all Medium Tasks in the Underworld.",
    "3621": "Unlock the ability to craft unholy symbols.",
    "3622": "Defeat Helwyr solo whilst wearing the full Prifddinian worker's outfit.",
    "3623": "Defeat Telos, the Warden at 4000% enrage after charging and using a font in phase 5.",
    "3624": "Jump across a crocodile's back.",
    "3625": "Unlock all of the listed prayers from Selene.",
    "3626": "Teleport to the lodestone in the Wilderness.",
    "3627": "Unlock the listed abilities.",
    "3628": "Purchase unlocks from the Waiko reward shop.",
    "3629": "Purchase additional unlocks from the Waiko reward shop.",
    "3630": "Perform the four emotes from the Stronghold of Security.",
    "3631": "In Vinesweeper, dig up 13 potato seeds.",
    "3632": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage after activating the edicts in order of: 3, 5, 6, 1, 4, 2 (H, V, E2, B, A, E1).",
    "3633": "Solve a celtic knot.",
    "3634": "Complete a floor without dying, solo.",
    "3635": "Complete this quest.",
    "3636": "Kill 15 summoned skeletons within 6 seconds during the encounter with Taraket the Necromancer.",
    "3637": "Purchase an item from the deep sea travelling merchant.",
    "3638": "Sacrifice a frost dragon bone on a prayer altar from a dragon you killed yourself in a solo dungeon.",
    "3639": "Purchase the first tier of upgrades in the Waiko reward shop.",
    "3640": "Purchase all tiers of upgrades in the Waiko reward shop.",
    "3641": "Obtained a collection of all unique drops from hard clue scrolls.",
    "3642": "Clear the shortcut path in the Uzer Mastaba.",
    "3643": "Complete this quest.",
    "3644": "Activate the lodestone in Varrock.",
    "3645": "Light all 14 beacons without using any of the log storage boxes.",
    "3646": "Given by Rat Burgiss south of Varrock for completing all Easy Tasks in Varrock.",
    "3647": "Given by Vannaka in Edgeville for completing all Elite Tasks in Varrock.",
    "3648": "Given by Vannaka in Edgeville for completing all Hard Tasks in Varrock.",
    "3649": "Given by Reldo in Varrock Palace's library for completing all Medium Tasks in Varrock.",
    "3650": "Pick all pockets, open all chests and crack all safes in the Vault of Hereditas Heist before searching the rare chest.",
    "3651": "Search the rare chest in the Vault of Hereditas Heist in 6 minutes or less.",
    "3652": "Search the rare chest in the Vault of Hereditas Heist without being caught.",
    "3653": "Feed all the crocodiles some steak.",
    "3654": "Contribute all items to the collection.",
    "3655": "Contribute all items to the collection.",
    "3656": "Contribute all items to the collection.",
    "3657": "Contribute all items to the collection.",
    "3658": "Contribute all items to the collection.",
    "3659": "Contribute all items to the collection.",
    "3660": "Contribute all items to the collection.",
    "3661": "Contribute all items to the collection.",
    "3662": "Contribute all items to the collection.",
    "3663": "Contribute all items to the collection.",
    "3664": "Contribute all items to the collection.",
    "3665": "Contribute all items to the collection.",
    "3666": "Contribute all items to the collection.",
    "3667": "Contribute all items to the collection.",
    "3668": "Contribute all items to the collection.",
    "3669": "Contribute all items to the collection.",
    "3670": "Contribute all items to the collection.",
    "3671": "Contribute all items to the collection.",
    "3672": "Contribute all items to the collection.",
    "3673": "Contribute all items to the collection.",
    "3674": "Contribute all items to the collection.",
    "3675": "Contribute all items to the collection.",
    "3676": "Contribute all items to the collection.",
    "3677": "Contribute all items to the collection.",
    "3678": "Contribute all items to the collection.",
    "3679": "Contribute all items to the collection.",
    "3680": "Contribute all items to the collection.",
    "3681": "Contribute all items to the collection.",
    "3682": "Complete this saga.",
    "3683": "Unlock the Verac bobblehead from Rise of the Six.",
    "3684": "Defeat Verak Lith. (X/1)",
    "3685": "Defeat Verak Lith solo in less than 04:00.",
    "3686": "Defeat Verak Lith solo in less than 03:00.",
    "3687": "Defeat Vermyx, Brood Mother in hard mode in less than 02:30.",
    "3688": "Defeat Vermyx, Brood Mother in hard mode in less than 01:21.",
    "3689": "Defeat Vermyx, Brood Mother in less than 03:30.",
    "3690": "Defeat Vermyx, Brood Mother in less than 02:15.",
    "3691": "Defeat Vermyx, Brood Mother. (X/1)",
    "3692": "Defeat Vermyx, Brood Mother in hard mode while completing the listed achievements.",
    "3693": "Defeat Vermyx, Brood Mother without being resurrected while completing the listed achievements.",
    "3694": "Unlock the title 'the Cabin Boy / Girl'. (X/1)",
    "3695": "Unlock the title 'Bo'sun' at the player owned port by reaching a port score of 400. (X/400)",
    "3696": "Unlock the title 'First Mate' at the player owned port by reaching a port score of 800. (X/800)",
    "3697": "Unlock the title 'Cap'n' at the player owned port by reaching a port score of 1,200. (X/1,200)",
    "3698": "Unlock the title 'Commodore' at the player owned port by reaching a port score of 1,600. (X/1,600)",
    "3699": "Unlock the title 'Admiral' at the player owned port by reaching a port score of 2,000. (X/2,000)",
    "3700": "Unlock the title 'Admiral of the Fleet' at the player owned port by reaching a port score of 3,500. (X/3,500)",
    "3701": "Unlock the title 'Portmaster' at the player owned port by reaching a port score of 4,500. (X/4,500)",
    "3702": "Make a pot on a potter's wheel.",
    "3703": "Visit the listed resource dungeons.",
    "3704": "Complete this quest.",
    "3705": "Buy a water-filled vial from the general store run by Aemad and Kortan.",
    "3706": "Defeat Vindicta and Gorvek. (X/1)",
    "3707": "Defeat Vindicta & Gorvek solo in less than 01:45.",
    "3708": "Defeat Vindicta & Gorvek in hard mode in less than 03:30.",
    "3709": "Defeat Vindicta & Gorvek in hard mode in less than 02:00.",
    "3710": "Defeat Vindicta & Gorvek solo in less than 00:45.",
    "3711": "Defeat Vindicta and Gorvek in hard mode. (X/5)",
    "3712": "Defeat Vindicta and Gorvek in hard mode. (X/10)",
    "3713": "Defeat Vindicta and Gorvek in hard mode. (X/25)",
    "3714": "Defeat Vindicta and Gorvek in hard mode. (X/50)",
    "3715": "Defeat Vindicta and Gorvek in hard mode. (X/75)",
    "3716": "Defeat Vindicta and Gorvek in hard mode. (X/100)",
    "3717": "Defeat Vindicta and Gorvek. (X/5)",
    "3718": "Defeat Vindicta and Gorvek. (X/10)",
    "3719": "Defeat Vindicta and Gorvek. (X/25)",
    "3720": "Defeat Vindicta and Gorvek. (X/50)",
    "3721": "Defeat Vindicta and Gorvek. (X/75)",
    "3722": "Defeat Vindicta and Gorvek. (X/100)",
    "3723": "Unlock the Vindiddy pet from Vindicta in the Heart of Gielinor.",
    "3724": "Kill your own jade vine after the Back to my Roots quest.",
    "3725": "Complete this quest.",
    "3726": "Complete this quest.",
    "3727": "Unlock the Vitalis pet from Vorago.",
    "3728": "Sell some rubium to Ezekial Lovecraft in Witchaven.",
    "3729": "Hit an enemy with Volley of Souls with at least 3 residual soul stacks within the City of Um.",
    "3730": "Defeat Vorago, if you think you're hard enough. (X/1)",
    "3731": "Defeat Vorago in a team of two or fewer.",
    "3732": "Defeat Vorago in hard mode in a team of two or fewer.",
    "3733": "Defeat Vorago in hard mode while completing the listed achievements.",
    "3734": "Defeat Vorago in hard mode solo.",
    "3735": "Defeat Vorago in hard mode in a team of three or fewer.",
    "3736": "Defeat Vorago in hard mode while completing the listed achievements.",
    "3737": "Defeat Vorago in hard mode in less than 14:00.",
    "3738": "Defeat Vorago in hard mode in a team of 4 or fewer in less than 09:30.",
    "3739": "Defeat Vorago in hard mode in a team of 4 or fewer in less than 11:00.",
    "3740": "Defeat Vorago solo.",
    "3741": "Defeat Vorago in a team of 4 or fewer in less than 08:30.",
    "3742": "Defeat Vorago in a team of 2 or fewer in less than 06:30.",
    "3743": "Defeat Vorago in a team of 2 or fewer in less than 07:15.",
    "3744": "Unlock the Vorki pet from Zemouregal & Vorkath.",
    "3745": "Visit Fred the Farmer's chicken and sheep farm.",
    "3746": "Defeat Telos, the Warden at 1000% or higher enrage without letting him use his basic attack in phase 4.",
    "3747": "Defeat the Queen Black Dragon without being hit by her fire wave attack.",
    "3748": "Make a waka canoe near Edgeville.",
    "3749": "Open the sarcophagus in the level 61 room of Pyramid Plunder.",
    "3750": "Weaken the forces involved in the civil war in the Wilderness by completing 1 Wilderness event. (X/1)",
    "3751": "Weaken the forces involved in the civil war in the Wilderness by completing 25 Wilderness events. (X/25)",
    "3752": "Weaken the forces involved in the civil war in the Wilderness by completing 100 Wilderness events. (X/100)",
    "3753": "Weaken the forces involved in the civil war in the Wilderness by completing 250 Wilderness events. (X/250)",
    "3754": "Complete the Stryke the Wyrm Wilderness flash event.",
    "3755": "Take your chameleon for a walk around Cairn Isle to see its egg-home.",
    "3756": "Find all reefwalker's cape scroll pieces in Player Owned Ports. (X/4)",
    "3757": "Obtained a collection of unique drops from Zemouregal & Vorkath.",
    "3758": "Complete this miniquest.",
    "3759": "Complete this quest.",
    "3760": "Obtained a collection of unique drops from Hermod, the Spirit of War.",
    "3761": "Buy all unlocks and upgrades from War's store. (X/3)",
    "3762": "Excavate at Kharid-et whilst the pylons are active.",
    "3763": "Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Charge' attack.",
    "3764": "Complete this quest.",
    "3765": "Cross the River Dougne using the log balance.",
    "3766": "Equip a charged enchanted water tiara while in the desert.",
    "3767": "Charge five water orbs in one go.",
    "3768": "Complete this quest.",
    "3769": "Make an enemy apply Bloated to at least 2 targets on death.",
    "3770": "Obtained a collection of unique drops from Legiones.",
    "3771": "Smith a full set of fully upgraded armour into burial armour in the Artisans' Workshop, donating it to the dwarves in the process.",
    "3772": "Defeat Astellarn, with your entire group having taken less than 10,000 total damage from her solar storm throughout the fight.",
    "3773": "Defeat Kree'arra in hard mode, solo, without being hit by his 'Vortex' attack.",
    "3774": "Make a level 90 milestone cape using a loom in Prifddinas.",
    "3775": "Defeat Araxxi at 100% enrage.",
    "3776": "Defeat Araxxi at 200% enrage.",
    "3777": "Defeat Araxxi at 300% enrage.",
    "3778": "Defeat Araxxi after using the correct protection prayer against all of her basic attacks in phase 4.",
    "3779": "Defeat Araxxor and Araxxi without anyone taking unnecessary damage from their 'Cocoon' attack.",
    "3780": "Cut a willow tree east of Lumbridge Castle.",
    "3781": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage while letting every Chaos demon leave Infernus.",
    "3782": "Find a needle in a haystack.",
    "3783": "Place a Stone of Jas plug in your aquarium.",
    "3784": "Use a waka canoe to travel to the Wilderness.",
    "3785": "Defeat the Giant Mole in hard mode. (X/5)",
    "3786": "Defeat the Giant Mole in hard mode. (X/10)",
    "3787": "Defeat the Giant Mole in hard mode. (X/25)",
    "3788": "Defeat the Giant Mole in hard mode. (X/50)",
    "3789": "Defeat the Giant Mole in hard mode. (X/75)",
    "3790": "Defeat the Giant Mole in hard mode. (X/100)",
    "3791": "Defeat the Black Stone Dragon. (X/5)",
    "3792": "Defeat the Black Stone Dragon. (X/10)",
    "3793": "Defeat the Black Stone Dragon. (X/25)",
    "3794": "Defeat the Black Stone Dragon. (X/50)",
    "3795": "Defeat the Black Stone Dragon. (X/75)",
    "3796": "Defeat the Black Stone Dragon. (X/100)",
    "3797": "Defeat the Black Stone Dragon solo. (X/5)",
    "3798": "Defeat the Black Stone Dragon solo. (X/10)",
    "3799": "Defeat the Black Stone Dragon solo. (X/25)",
    "3800": "Defeat the Black Stone Dragon solo. (X/50)",
    "3801": "Defeat the Black Stone Dragon solo. (X/75)",
    "3802": "Defeat the Black Stone Dragon solo. (X/100)",
    "3803": "Kill 10 Nodon dragonkin with a siege engine.",
    "3804": "Obtained a collection of unique drops from K'ril Tsutsaroth.",
    "3805": "Play a non-reward game of Rush of Blood.",
    "3806": "Convert a memory, or an enriched memory, into experience.",
    "3807": "Defeat Amascut, the Devourer at 1000% or higher enrage after charging all 4 Fragments of Tumeken at once in phase 5.",
    "3808": "Deal over 9,000 damage to Goku the Unrelenting in one hit.",
    "3809": "Defeat the Ambassador without letting him absorb any sinister fragments.",
    "3810": "Have Sedridor teleport you to the Rune Essence Mine.",
    "3811": "Complete this quest.",
    "3812": "Take the Dagon-hai shortcut to the Chaos Altar.",
    "3813": "Make a Camouflage potion whilst in the Wilderness from scratch.",
    "3814": "Ice Barrage 99 times in Castle Wars. (X/99)",
    "3815": "Pick watermelons from the Farming patch north of Ardougne.",
    "3816": "Buy something from the ticket exchange in the Ranging Guild.",
    "3817": "Store the items required for an emote clue in a Treasure Trail hidey-hole.",
    "3818": "Complete all of the Doric and Boric tasks.",
    "3819": "Complete this quest.",
    "3820": "Catch a rocktail in the Living Rock Caverns.",
    "3821": "Defeat Kezalam, the Wanderer. (X/5)",
    "3822": "Defeat Kezalam, the Wanderer. (X/10)",
    "3823": "Defeat Kezalam, the Wanderer. (X/25)",
    "3824": "Defeat Kezalam, the Wanderer. (X/50)",
    "3825": "Defeat Kezalam, the Wanderer. (X/75)",
    "3826": "Defeat Kezalam, the Wanderer. (X/100)",
    "3827": "Get Beefy Bill to bank something for you.",
    "3828": "Complete this quest.",
    "3829": "Kill an abyssal demon in the Slayer Tower.",
    "3830": "Achieve the Master White Knight rank.",
    "3831": "Talk to Romily Weaklax and give him a wild pie.",
    "3832": "Sample all of the listed pies.",
    "3833": "Defeat each different type of broodoo victim whilst wearing their coloured mask.",
    "3834": "Complete the following set of achievements.",
    "3835": "Cast the Watchtower Teleport spell.",
    "3836": "Complete the replica statue of Rhiannon in the Max Guild garden.",
    "3837": "Use the fairy rings to travel to the Haunted Woods.",
    "3838": "Adorn a hellhound with some fabulously retro infernal fashion.",
    "3839": "Interact with a pet rock.",
    "3840": "Kill a total number of bosses. (X/500)",
    "3841": "Kill a total number of bosses. (X/1,000)",
    "3842": "Kill a total number of bosses. (X/2,000)",
    "3843": "Kill a total number of bosses. (X/3,000)",
    "3844": "Kill a total number of bosses. (X/4,000)",
    "3845": "Kill a total number of bosses. (X/5,000)",
    "3846": "Discover the Throne Room.",
    "3847": "Defeat Vorago whilst holding your pet rock for the whole kill.",
    "3848": "Use one of the chaos portals while wearing a full set of chaos equipment.",
    "3849": "Complete the Ungael combat activity on standard mode.",
    "3850": "Collect three seaweed from the shore north-east of Rellekka.",
    "3851": "Kill a skeletal wyvern in the Asgarnian Ice Dungeon.",
    "3852": "Defeat Vermyx, Brood Mother. (X/5)",
    "3853": "Defeat Vermyx, Brood Mother. (X/10)",
    "3854": "Defeat Vermyx, Brood Mother. (X/25)",
    "3855": "Defeat Vermyx, Brood Mother. (X/50)",
    "3856": "Defeat Vermyx, Brood Mother. (X/75)",
    "3857": "Defeat Vermyx, Brood Mother. (X/100)",
    "3858": "Kill five rock crabs on the shore near Rellekka or on Waterbirth Island.",
    "3859": "Walk clockwise around the big mysterious statue.",
    "3860": "Perform the troubadour dance emote near the dancers outside the Citharede Abbey.",
    "3861": "Activate the lodestone near the Wilderness Crater.",
    "3862": "Given by Mr Ex, north of Edgeville bank, for completing all Easy Tasks in the Wilderness.",
    "3863": "Given by Kolodion, in the Mage Arena bank, for completing all Elite Tasks in the Wilderness.",
    "3864": "Given by Quercus, at the ditch north of the Grand Exchange, for completing all Hard Tasks in the Wilderness.",
    "3865": "Given by Mandrith, near the Pirates' Hideout in the Wilderness, for completing all Medium Tasks in the Wilderness.",
    "3866": "Obtained a collection of unique drops from Slayer monsters located within the Wilderness.",
    "3867": "Light a willow log fire on top of the Lumbridge Castle's gatehouse.",
    "3868": "Browse Lumbridge's general store.",
    "3869": "Solve this mystery.",
    "3870": "Contribute all items to the collection.",
    "3871": "Contribute all items to the collection.",
    "3872": "Contribute all items to the collection.",
    "3873": "Contribute all items to the collection.",
    "3874": "Contribute all items to the collection.",
    "3875": "Complete this quest.",
    "3876": "Complete this miniquest.",
    "3877": "Get a full complement of rats on your rat pole.",
    "3878": "Complete this quest.",
    "3879": "Kill Blink in a solo Dungeoneering instance, without dying.",
    "3880": "Defeat Helwyr whilst there are 4 Cywir Alphas still alive. Can only be completed in a solo instance.",
    "3881": "Complete this quest.",
    "3882": "Fully fortify Fort Forinthry by building up all the walls and gates.",
    "3883": "Defeat Solak. (X/5)",
    "3884": "Defeat Solak. (X/10)",
    "3885": "Defeat Solak, Guardian of the Grove. (X/25)",
    "3886": "Defeat Solak. (X/50)",
    "3887": "Defeat Solak. (X/75)",
    "3888": "Defeat Solak. (X/100)",
    "3889": "Unlock the Woodcutting pet.",
    "3890": "Reach level 5 in the Woodcutting skill.",
    "3891": "Reach level 10 in the Woodcutting skill.",
    "3892": "Reach level 20 in the Woodcutting skill.",
    "3893": "Reach level 30 in the Woodcutting skill.",
    "3894": "Reach level 40 in the Woodcutting skill.",
    "3895": "Reach level 50 in the Woodcutting skill.",
    "3896": "Reach level 60 in the Woodcutting skill.",
    "3897": "Reach level 70 in the Woodcutting skill.",
    "3898": "Reach level 80 in the Woodcutting skill.",
    "3899": "Reach level 90 in the Woodcutting skill.",
    "3900": "Reach level 92 in the Woodcutting skill.",
    "3901": "Reach level 99 in the Woodcutting skill.",
    "3902": "Reach level 110 in the Woodcutting skill.",
    "3903": "Reach virtual level 120 in the Woodcutting skill.",
    "3904": "Give the 6 demon statuettes from Lumbridge Catacombs to Xenia/Ilona at the entrance.",
    "3905": "Unlock all rewards from the Artisans' Workshop (excluding outfits and auras).",
    "3906": "Unlock all rewards from the Artisans' Workshop (including outfits and excluding auras).",
    "3907": "Defeat Kerapac, the bound in hard mode, solo without letting any of your echoes die.",
    "3908": "Defeat Zamorak, Lord of Chaos solo at 4,000% enrage.",
    "3909": "Solve this mystery.",
    "3910": "Harvest limpwurt in the farming patch near Port Phasmatys.",
    "3911": "Defeat the Ambassador without anyone intercepting any of his 'Circle of Black Hands' attacks.",
    "3912": "Sing an attuned crystal weapon from an attuned seed in the Ithell area of Prifddinas.",
    "3913": "Hand in rune dust to a runesphere.",
    "3914": "Hand in rune dust to a runesphere 5 times. (X/5)",
    "3915": "Hand in rune dust to a runesphere 10 times. (X/10)",
    "3916": "Hand in rune dust to a runesphere 25 times. (X/25)",
    "3917": "Defeat Yakamaru. (X/5)",
    "3918": "Defeat Yakamaru. (X/10)",
    "3919": "Defeat Yakamaru. (X/25)",
    "3920": "Defeat Yakamaru. (X/50)",
    "3921": "Defeat Yakamaru. (X/75)",
    "3922": "Defeat Yakamaru. (X/100)",
    "3923": "Wear yak-hide armour and kill an ice troll.",
    "3924": "Defeat Yakamaru. (X/1)",
    "3925": "Defeat Yakamaru in a team of 2 or fewer.",
    "3926": "Defeat Yakamaru in less than 05:30.",
    "3927": "Defeat Yakamaru in less than 02:30.",
    "3928": "Defeat Yakamaru in less than 03:00.",
    "3929": "Unlock the Yakaminu pet from Yakamaru in the Liberation of Mazcab.",
    "3930": "Successfully breed a yak with the Ravensworn trait.",
    "3931": "Unlock the enhanced Yaktwee stick by catching charm sprites. (X/1,000)",
    "3932": "Activate the lodestone in Yanille.",
    "3933": "Be assigned a Slayer task in Shilo Village.",
    "3934": "Attempt to steal from any stall in Ardougne Market, or from any guard.",
    "3935": "Kill Cerberus Juvenile whilst using a hellhound familiar.",
    "3936": "Complete this quest.",
    "3937": "Defeat Solak, Guardian of the Grove without anyone being hit by his 'Blight Siphon' attack.",
    "3938": "Defeat Amascut, the Devourer. (X/5)",
    "3939": "Defeat Amascut, the Devourer. (X/10)",
    "3940": "Defeat Amascut, the Devourer. (X/25)",
    "3941": "Defeat Amascut, the Devourer. (X/50)",
    "3942": "Defeat Amascut, the Devourer. (X/75)",
    "3943": "Defeat Amascut, the Devourer. (X/100)",
    "3944": "Attempt to picklock the door to the basement in Yanille Agility Dungeon.",
    "3945": "Kill a giant rat in Lumbridge Swamp.",
    "3946": "Complete a furnished floor solo on any complexity.",
    "3947": "Complete all bagrada rex breeds.",
    "3948": "Complete all brutish dinosaur breeds.",
    "3949": "Collect all breeds of chicken at the Player Owned Farm.",
    "3950": "Collect all breeds of chinchompa at the Player Owned Farm.",
    "3951": "Complete all corbicula rex breeds.",
    "3952": "Collect all breeds of cow at the Player Owned Farm.",
    "3953": "Collect all breeds of dragon at the Player Owned Farm.",
    "3954": "Complete all frog breeds.",
    "3955": "Complete all jadinko breeds.",
    "3956": "Complete all malletops breeds.",
    "3957": "Complete all pavosaurus rex breeds.",
    "3958": "Collect all breeds of rabbit at the Player Owned Farm.",
    "3959": "Complete all salamander breeds.",
    "3960": "Complete all scimitops breeds. (X/4)",
    "3961": "Collect all breeds of sheep at the Player Owned Farm.",
    "3962": "Complete all spicati apoterrasaur breeds.",
    "3963": "Collect all breeds of spider at the Player Owned Farm.",
    "3964": "Complete all varanusaur dinosaur breeds.",
    "3965": "Collect all breeds of yak at the Player Owned Farm.",
    "3966": "Collect all breeds of zygomite at the Player Owned Farm.",
    "3967": "Complete all arcane apoterrasaur breeds.",
    "3968": "Complete all asciatops breeds.",
    "3969": "Complete all oculi apoterrasaur breeds. (X/4)",
    "3970": "Solve this mystery.",
    "3971": "Go to the Fossegrimen and charm her into accepting a raw bass.",
    "3972": "Repair a Nodon siege engine.",
    "3973": "Return Mistag's brooch and claim a mining helmet after 'The Lost Tribe'.",
    "3974": "Look at Yrsa's options for recolouring your boots in her clothes shop in Rellekka.",
    "3975": "Defeat TzKal-Zuk in hard mode. (X/5)",
    "3976": "Defeat TzKal-Zuk in hard mode. (X/10)",
    "3977": "Defeat TzKal-Zuk in hard mode. (X/25)",
    "3978": "Defeat TzKal-Zuk in hard mode. (X/50)",
    "3979": "Defeat TzKal-Zuk in hard mode. (X/75)",
    "3980": "Defeat TzKal-Zuk in hard mode. (X/100)",
    "3981": "Defeat Amascut, the Devourer at 1000% or higher enrage without allowing her to heal through 'Healing in Strength'.",
    "3982": "Sample all of the listed pizzas.",
    "3983": "Kill Sangri the Red while under the effect of Berserk.",
    "3984": "Enter the A Soul's Bane rift.",
    "3985": "Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Mad' attack.",
    "3986": "Defeat TzKal-Zuk. (X/5)",
    "3987": "Defeat TzKal-Zuk. (X/10)",
    "3988": "Defeat TzKal-Zuk. (X/25)",
    "3989": "Defeat TzKal-Zuk. (X/50)",
    "3990": "Defeat TzKal-Zuk. (X/75)",
    "3991": "Defeat TzKal-Zuk. (X/100)",
    "3992": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage without anyone using shield defensive abilities.",
    "3993": "Tag 30 correct pillars in a row successfully in the Brimhaven Agility Arena.",
    "3994": "Gather elder chronicle fragments in the Elder Halls of Freneskae.",
    "3995": "Defeat the boss on floor 1, solo.",
    "3996": "Be on the winning side in a game of Castle Wars.",
    "3997": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage while keeping the Chaos Demon alive in phase 7.",
    "3998": "Defeat Nex, Angel of Death in a team of 7 or fewer without letting any Praesul mages gather their full strength.",
    "3999": "Defeat Nex, Angel of Death in a team of 7 or fewer after defeating each Praesul at their full strength.",
    "4000": "Obtained a collection of unique drops from master clue scrolls.",
    "4001": "Defeat Zamorak, Lord of Chaos at 1,000% or higher enrage after letting him fully charge his world-ending attack in phase 7.",
    "4002": "Unlock the Zammo the Rak pet from the Zamorak, Lord of Chaos encounter.",
    "4003": "Defeat Zamorak, Lord of Chaos (X/5)",
    "4004": "Defeat Zamorak, Lord of Chaos (X/10)",
    "4005": "Defeat Zamorak, Lord of Chaos (X/25)",
    "4006": "Defeat Zamorak, Lord of Chaos (X/50)",
    "4007": "Defeat Zamorak, Lord of Chaos (X/75)",
    "4008": "Defeat Zamorak, Lord of Chaos (X/100)",
    "4009": "Defeat Zamorak, Lord of Chaos at 500% or higher enrage in less than 06:30.",
    "4010": "Defeat Zamorak, Lord of Chaos at 2000% or higher enrage in less than 05:12.",
    "4011": "Defeat Zamorak, Lord of Chaos at 1000% or higher enrage in less than 05:12.",
    "4012": "Defeat Zamorak (X/1)",
    "4013": "Defeat Zamorak, Lord of Chaos at 750% or higher enrage while completing the listed achievements.",
    "4014": "Reach maximum reputation with the Zamorak faction in the Heart of Gielinor. (X/5,000)",
    "4015": "Restored a collection of Zamorakian artefacts.",
    "4016": "Reach maximum reputation with the Zaros faction in the Heart of Gielinor. (X/5,000)",
    "4017": "Restored a collection of Zarosian artefacts.",
    "4018": "Deposit Zarosian memoriam crystals, then search the Sanctum alcove.",
    "4019": "Defeat Zemouregal & Vorkath. (X/1)",
    "4020": "Defeat Zemouregal & Vorkath in hard mode in less than 05:00.",
    "4021": "Defeat Zemouregal & Vorkath in hard mode in less than 01:45.",
    "4022": "Defeat Zemouregal & Vorkath in hard mode in less than 02:45.",
    "4023": "Defeat Zemouregal & Vorkath. (X/5)",
    "4024": "Defeat Zemouregal & Vorkath. (X/10)",
    "4025": "Defeat Zemouregal & Vorkath. (X/25)",
    "4026": "Defeat Zemouregal & Vorkath. (X/50)",
    "4027": "Defeat Zemouregal & Vorkath. (X/75)",
    "4028": "Defeat Zemouregal & Vorkath. (X/100)",
    "4029": "Defeat Zemouregal & Vorkath in less than 05:30.",
    "4030": "Defeat Zemouregal & Vorkath in less than 04:00.",
    "4031": "Unlock the Zez pet from accumulating RuneScore. (X/5,000)",
    "4032": "Defeat Commander Zilyana in hard mode. (X/5)",
    "4033": "Defeat Commander Zilyana in hard mode. (X/10)",
    "4034": "Defeat Commander Zilyana in hard mode. (X/25)",
    "4035": "Defeat Commander Zilyana in hard mode. (X/50)",
    "4036": "Defeat Commander Zilyana in hard mode. (X/75)",
    "4037": "Defeat Commander Zilyana in hard mode. (X/100)",
    "4038": "Defeat Commander Zilyana. (X/5)",
    "4039": "Defeat Commander Zilyana. (X/10)",
    "4040": "Defeat Commander Zilyana. (X/25)",
    "4041": "Defeat Commander Zilyana. (X/50)",
    "4042": "Defeat Commander Zilyana. (X/75)",
    "4043": "Defeat Commander Zilyana. (X/100)",
    "4044": "Complete this quest.",
    "4045": "Successfully breed a zygomite with the Ravensworn trait."
  }
}